{
  "surah": 68,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "نٓ ۚ وَٱلْقَلَمِ وَمَا يَسْطُرُونَ",
      "english": "Nun. By the pen and what they inscribe,",
      "hausa": "Ñ. Na rantse da alƙalami da abin da (marubũta) suke rubũtãwa."
    },
    {
      "ayah": 2,
      "arabic": "مَآ أَنتَ بِنِعْمَةِ رَبِّكَ بِمَجْنُونٍ",
      "english": "You are not, [O Muhammad], by the favor of your Lord, a madman.",
      "hausa": "Kai, sabõda ni'imar Ubangijinka, bã mahaukaci kake ba."
    },
    {
      "ayah": 3,
      "arabic": "وَإِنَّ لَكَ لَأَجْرًا غَيْرَ مَمْنُونٍ",
      "english": "And indeed, for you is a reward uninterrupted.",
      "hausa": "Kuma, lalle, haƙĩƙa kanã da lãdar da bã ta yankewa."
    },
    {
      "ayah": 4,
      "arabic": "وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ",
      "english": "And indeed, you are of a great moral character.",
      "hausa": "Kuma, lalle haƙiƙa kana a kan hãlãyen kirki, manya."
    },
    {
      "ayah": 5,
      "arabic": "فَسَتُبْصِرُ وَيُبْصِرُونَ",
      "english": "So you will see and they will see",
      "hausa": "Don haka, zã ka gani, sũ kuma zã su gani."
    },
    {
      "ayah": 6,
      "arabic": "بِأَييِّكُمُ ٱلْمَفْتُونُ",
      "english": "Which of you is the afflicted [by a devil].",
      "hausa": "Ga wanenku haukã take."
    },
    {
      "ayah": 7,
      "arabic": "إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِۦ وَهُوَ أَعْلَمُ بِٱلْمُهْتَدِينَ",
      "english": "Indeed, your Lord is most knowing of who has gone astray from His way, and He is most knowing of the [rightly] guided.",
      "hausa": "Lalle Ubangijinka Shi ne Mafi sani ga wanda ya ɓace daga tafarkinSa. Kuma Shi ne Mafi sani ga mãsu shiryuwa."
    },
    {
      "ayah": 8,
      "arabic": "فَلَا تُطِعِ ٱلْمُكَذِّبِينَ",
      "english": "Then do not obey the deniers.",
      "hausa": "Saboda haka kada ka bi mãsu ƙaryatãwa."
    },
    {
      "ayah": 9,
      "arabic": "وَدُّوا۟ لَوْ تُدْهِنُ فَيُدْهِنُونَ",
      "english": "They wish that you would soften [in your position], so they would soften [toward you].",
      "hausa": "Sunã fatar ka sassauta, su kuma sũ sassauta."
    },
    {
      "ayah": 10,
      "arabic": "وَلَا تُطِعْ كُلَّ حَلَّافٍ مَّهِينٍ",
      "english": "And do not obey every worthless habitual swearer",
      "hausa": "Kada ka bi dukkan mai yawan rantsuwa, walãkantacce."
    },
    {
      "ayah": 11,
      "arabic": "هَمَّازٍ مَّشَّآءٍۭ بِنَمِيمٍ",
      "english": "[And] scorner, going about with malicious gossip -",
      "hausa": "Mai zunɗe, mai yãwo da gulma."
    },
    {
      "ayah": 12,
      "arabic": "مَّنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ أَثِيمٍ",
      "english": "A preventer of good, transgressing and sinful,",
      "hausa": "Mai hana alhẽri mai zãlunci, mai zunubi."
    },
    {
      "ayah": 13,
      "arabic": "عُتُلٍّۭ بَعْدَ ذَٰلِكَ زَنِيمٍ",
      "english": "Cruel, moreover, and an illegitimate pretender.",
      "hausa": "Mai girman kai, bãyan haka kuma la'ĩmi (bã ya son alhẽri)."
    },
    {
      "ayah": 14,
      "arabic": "أَن كَانَ ذَا مَالٍ وَبَنِينَ",
      "english": "Because he is a possessor of wealth and children,",
      "hausa": "Sabõda yã kasance mai dũkiya da ɗiya."
    },
    {
      "ayah": 15,
      "arabic": "إِذَا تُتْلَىٰ عَلَيْهِ ءَايَـٰتُنَا قَالَ أَسَـٰطِيرُ ٱلْأَوَّلِينَ",
      "english": "When Our verses are recited to him, he says, \"Legends of the former peoples.\"",
      "hausa": "Idan ana karanta masa ãyõyinMu, sai ya ce: \"Tatsũniyõyin mutãnen farko ne.\""
    },
    {
      "ayah": 16,
      "arabic": "سَنَسِمُهُۥ عَلَى ٱلْخُرْطُومِ",
      "english": "We will brand him upon the snout.",
      "hausa": "Zã Mu yi masa alãma a kan hanci."
    },
    {
      "ayah": 17,
      "arabic": "إِنَّا بَلَوْنَـٰهُمْ كَمَا بَلَوْنَآ أَصْحَـٰبَ ٱلْجَنَّةِ إِذْ أَقْسَمُوا۟ لَيَصْرِمُنَّهَا مُصْبِحِينَ",
      "english": "Indeed, We have tried them as We tried the companions of the garden, when they swore to cut its fruit in the [early] morning",
      "hausa": "Lalle Mun jarrabe su kamar yadda Muka jarrabi mãsu gonar lambu, a lokacin da suka yi rantsuwa, wai lalle zã su girbe amfãninta, suna mãsu asubanci."
    },
    {
      "ayah": 18,
      "arabic": "وَلَا يَسْتَثْنُونَ",
      "english": "Without making exception.",
      "hausa": "Kuma (suka yi niyya), bã su kõ tõgẽwa."
    },
    {
      "ayah": 19,
      "arabic": "فَطَافَ عَلَيْهَا طَآئِفٌ مِّن رَّبِّكَ وَهُمْ نَآئِمُونَ",
      "english": "So there came upon the garden an affliction from your Lord while they were asleep.",
      "hausa": "Wani mai kẽwayãwa daga Ubangijinka ya kẽwayã a kanta, (ya ƙone ta,) alhãli sunã barci."
    },
    {
      "ayah": 20,
      "arabic": "فَأَصْبَحَتْ كَٱلصَّرِيمِ",
      "english": "And it became as though reaped.",
      "hausa": "Sai ta wãyi gari (baƙa ƙirin) kamar dare."
    },
    {
      "ayah": 21,
      "arabic": "فَتَنَادَوْا۟ مُصْبِحِينَ",
      "english": "And they called one another at morning,",
      "hausa": "Sai suka kirãyi jũna, sunã mãsu yin asubanci."
    },
    {
      "ayah": 22,
      "arabic": "أَنِ ٱغْدُوا۟ عَلَىٰ حَرْثِكُمْ إِن كُنتُمْ صَـٰرِمِينَ",
      "english": "[Saying], \"Go early to your crop if you would cut the fruit.\"",
      "hausa": "Cẽwa ku yi sammakõ ga amfãnin gõnarku, idan kun kasance mãsu girbewa."
    },
    {
      "ayah": 23,
      "arabic": "فَٱنطَلَقُوا۟ وَهُمْ يَتَخَـٰفَتُونَ",
      "english": "So they set out, while lowering their voices,",
      "hausa": "Sai suka tafi sunã shãwara a ɓõye (sunã cẽwa)."
    },
    {
      "ayah": 24,
      "arabic": "أَن لَّا يَدْخُلَنَّهَا ٱلْيَوْمَ عَلَيْكُم مِّسْكِينٌ",
      "english": "[Saying], \"There will surely not enter it today upon you [any] poor person.\"",
      "hausa": "\"Lalle kada wani miskĩni ya shigar muku ita a yau!\""
    },
    {
      "ayah": 25,
      "arabic": "وَغَدَوْا۟ عَلَىٰ حَرْدٍ قَـٰدِرِينَ",
      "english": "And they went early in determination, [assuming themselves] able.",
      "hausa": "Kuma suka yi sammako akan (niyyar) rõwa, matuƙar iyãwarsu."
    },
    {
      "ayah": 26,
      "arabic": "فَلَمَّا رَأَوْهَا قَالُوٓا۟ إِنَّا لَضَآلُّونَ",
      "english": "But when they saw it, they said, \"Indeed, we are lost;",
      "hausa": "Lõkacin da suka gan ta, sai suka ce: \"Lalle, mun saki hanya (mun ɓace)!\""
    },
    {
      "ayah": 27,
      "arabic": "بَلْ نَحْنُ مَحْرُومُونَ",
      "english": "Rather, we have been deprived.\"",
      "hausa": "\"Ba haka ba, mũ dai, an hana mu ne.\""
    },
    {
      "ayah": 28,
      "arabic": "قَالَ أَوْسَطُهُمْ أَلَمْ أَقُل لَّكُمْ لَوْلَا تُسَبِّحُونَ",
      "english": "The most moderate of them said, \"Did I not say to you, 'Why do you not exalt [Allah]?' \"",
      "hausa": "Mafificinsu (hankali) ya ce: \"Ban gaya muku ba, yã kamata ku tsarkake Allah?\""
    },
    {
      "ayah": 29,
      "arabic": "قَالُوا۟ سُبْحَـٰنَ رَبِّنَآ إِنَّا كُنَّا ظَـٰلِمِينَ",
      "english": "They said, \"Exalted is our Lord! Indeed, we were wrongdoers.\"",
      "hausa": "Suka ce: \"Tsarki ya tabbata ga Ubangijinmu! Lalle, mu mun kasance azzãlumai.\""
    },
    {
      "ayah": 30,
      "arabic": "فَأَقْبَلَ بَعْضُهُمْ عَلَىٰ بَعْضٍ يَتَلَـٰوَمُونَ",
      "english": "Then they approached one another, blaming each other.",
      "hausa": "Sai suka fuskanci jũna, sunã zargin kansu."
    },
    {
      "ayah": 31,
      "arabic": "قَالُوا۟ يَـٰوَيْلَنَآ إِنَّا كُنَّا طَـٰغِينَ",
      "english": "They said, \"O woe to us; indeed we were transgressors.",
      "hausa": "Suka ce: \"Kaitonmu! Lalle, mũ ne muka kasance mãsu ƙẽtare iyãka.\""
    },
    {
      "ayah": 32,
      "arabic": "عَسَىٰ رَبُّنَآ أَن يُبْدِلَنَا خَيْرًا مِّنْهَآ إِنَّآ إِلَىٰ رَبِّنَا رَٰغِبُونَ",
      "english": "Perhaps our Lord will substitute for us [one] better than it. Indeed, we are toward our Lord desirous.\"",
      "hausa": "\"Mai yiwuwa ne Ubangijinmu Ya musanya mana da wani abu da yã fi ta. Lalle, mũ (ba mu yanke ƙauna ba) zuwa ga Ubangijinmu, mãsu kwaɗayi ne.\""
    },
    {
      "ayah": 33,
      "arabic": "كَذَٰلِكَ ٱلْعَذَابُ ۖ وَلَعَذَابُ ٱلْـَٔاخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا۟ يَعْلَمُونَ",
      "english": "Such is the punishment [of this world]. And the punishment of the Hereafter is greater, if they only knew.",
      "hausa": "Haka dai azãbar take, kuma lalle ne azãbar Lãhira ta fi girma, in da sun kasance zã su iya gãnẽwã."
    },
    {
      "ayah": 34,
      "arabic": "إِنَّ لِلْمُتَّقِينَ عِندَ رَبِّهِمْ جَنَّـٰتِ ٱلنَّعِيمِ",
      "english": "Indeed, for the righteous with their Lord are the Gardens of Pleasure.",
      "hausa": "Lalle ne mãsu taƙawa nã da a wurin Ubangijinsu, gidãjen Aljanna na ni'ima."
    },
    {
      "ayah": 35,
      "arabic": "أَفَنَجْعَلُ ٱلْمُسْلِمِينَ كَٱلْمُجْرِمِينَ",
      "english": "Then will We treat the Muslims like the criminals?",
      "hausa": "Shin ko zã Mu sanya waɗanda ke bi da ɗa'a kamar mãsu laifi?"
    },
    {
      "ayah": 36,
      "arabic": "مَا لَكُمْ كَيْفَ تَحْكُمُونَ",
      "english": "What is [the matter] with you? How do you judge?",
      "hausa": "Me ya sãme ku, yãya kuke yin hukunci (da haka)?"
    },
    {
      "ayah": 37,
      "arabic": "أَمْ لَكُمْ كِتَـٰبٌ فِيهِ تَدْرُسُونَ",
      "english": "Or do you have a scripture in which you learn",
      "hausa": "Ko kuna da wani littafi, wanda a cikinsa, kuke karantãwa?"
    },
    {
      "ayah": 38,
      "arabic": "إِنَّ لَكُمْ فِيهِ لَمَا تَخَيَّرُونَ",
      "english": "That indeed for you is whatever you choose?",
      "hausa": "Cẽwã kunã da, a cikinsa lalle (duk) abin da rãyukanku suka zãɓa?"
    },
    {
      "ayah": 39,
      "arabic": "أَمْ لَكُمْ أَيْمَـٰنٌ عَلَيْنَا بَـٰلِغَةٌ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ ۙ إِنَّ لَكُمْ لَمَا تَحْكُمُونَ",
      "english": "Or do you have oaths [binding] upon Us, extending until the Day of Resurrection, that indeed for you is whatever you judge?",
      "hausa": "Kõ kunã (riƙe) da wasu rantsuwõyin alkawari a kanMu, har ya zuwa Rãnar ¡iyãma, cẽwa lalle ne kunã da abin da kuke hukuntã wa kanku?"
    },
    {
      "ayah": 40,
      "arabic": "سَلْهُمْ أَيُّهُم بِذَٰلِكَ زَعِيمٌ",
      "english": "Ask them which of them, for that [claim], is responsible.",
      "hausa": "Ka tambaye su, wãne, a cikinsu, ke lãmuncewã ga sãmun wannan (hukuncin)?"
    },
    {
      "ayah": 41,
      "arabic": "أَمْ لَهُمْ شُرَكَآءُ فَلْيَأْتُوا۟ بِشُرَكَآئِهِمْ إِن كَانُوا۟ صَـٰدِقِينَ",
      "english": "Or do they have partners? Then let them bring their partners, if they should be truthful.",
      "hausa": "Kõ sunã da abõkan tãrẽwa (ga wannan ra'ayi)? To, sai su kãwo abõkan tãrayyarsu, idan sun kasance mãsu gaskiya."
    },
    {
      "ayah": 42,
      "arabic": "يَوْمَ يُكْشَفُ عَن سَاقٍ وَيُدْعَوْنَ إِلَى ٱلسُّجُودِ فَلَا يَسْتَطِيعُونَ",
      "english": "The Day the shin will be uncovered and they are invited to prostration but the disbelievers will not be able,",
      "hausa": "Ranar da zã a kuranye ƙwabri, kuma a kira su zuwa ga yin sujũda, sai bã zã su iyãwa ba."
    },
    {
      "ayah": 43,
      "arabic": "خَـٰشِعَةً أَبْصَـٰرُهُمْ تَرْهَقُهُمْ ذِلَّةٌ ۖ وَقَدْ كَانُوا۟ يُدْعَوْنَ إِلَى ٱلسُّجُودِ وَهُمْ سَـٰلِمُونَ",
      "english": "Their eyes humbled, humiliation will cover them. And they used to be invited to prostration while they were sound.",
      "hausa": "Su fito da idãnu ƙasƙantattu, wulãkanci yana rufe su. Lalle ne a dã sun kasance anã kiran su zuwa, yin sujũdar, alhãli kuwa sunã lãfiya lau, (suka ƙi yi)."
    },
    {
      "ayah": 44,
      "arabic": "فَذَرْنِى وَمَن يُكَذِّبُ بِهَـٰذَا ٱلْحَدِيثِ ۖ سَنَسْتَدْرِجُهُم مِّنْ حَيْثُ لَا يَعْلَمُونَ",
      "english": "So leave Me, [O Muhammad], with [the matter of] whoever denies the Qur'an. We will progressively lead them [to punishment] from where they do not know.",
      "hausa": "Sabõda haka ka bar Ni da mai ƙaryata wanna lãbãri (Alƙur'ãni). Zã Mu yi musu istidrãji daga inda ba su sani ba."
    },
    {
      "ayah": 45,
      "arabic": "وَأُمْلِى لَهُمْ ۚ إِنَّ كَيْدِى مَتِينٌ",
      "english": "And I will give them time. Indeed, My plan is firm.",
      "hausa": "Ina jinkirtã musu, lalle kaidiNa mai ƙarfi ne."
    },
    {
      "ayah": 46,
      "arabic": "أَمْ تَسْـَٔلُهُمْ أَجْرًا فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ",
      "english": "Or do you ask of them a payment, so they are by debt burdened down?",
      "hausa": "Kõ kana tambayar su wata la'ada ne, sabõda haka sũ, daga wannan tãrar, suke jin an nauyaya musu?"
    },
    {
      "ayah": 47,
      "arabic": "أَمْ عِندَهُمُ ٱلْغَيْبُ فَهُمْ يَكْتُبُونَ",
      "english": "Or have they [knowledge of] the unseen, so they write [it] down?",
      "hausa": "Ko kuma sunã da ilmin gaibu ne, wãto sunã yin rubũtun (abin da suke faɗã daga gare shi) ne?"
    },
    {
      "ayah": 48,
      "arabic": "فَٱصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تَكُن كَصَاحِبِ ٱلْحُوتِ إِذْ نَادَىٰ وَهُوَ مَكْظُومٌ",
      "english": "Then be patient for the decision of your Lord, [O Muhammad], and be not like the companion of the fish when he called out while he was distressed.",
      "hausa": "Sabõda haka, ka yi haƙuri da hukuncin Ubangijinka, kada ka zama kamar Ma'abũcin kĩfi, alõkacin da ya yi kira, alhãli yana cike da hushi."
    },
    {
      "ayah": 49,
      "arabic": "لَّوْلَآ أَن تَدَٰرَكَهُۥ نِعْمَةٌ مِّن رَّبِّهِۦ لَنُبِذَ بِٱلْعَرَآءِ وَهُوَ مَذْمُومٌ",
      "english": "If not that a favor from his Lord overtook him, he would have been thrown onto the naked shore while he was censured.",
      "hausa": "Ba dõmin ni'ima daga wajen Ubangijinsa tã riske shi ba, lalle ne da an jẽfa shi a cikin wõfintacciyar ƙasa, alhãli yanã abin zargi."
    },
    {
      "ayah": 50,
      "arabic": "فَٱجْتَبَـٰهُ رَبُّهُۥ فَجَعَلَهُۥ مِنَ ٱلصَّـٰلِحِينَ",
      "english": "And his Lord chose him and made him of the righteous.",
      "hausa": "Sai Ubangijinsa Ya zãɓe shi, sa'an nan Ya sanya shi a cikin mutãnen kirki."
    },
    {
      "ayah": 51,
      "arabic": "وَإِن يَكَادُ ٱلَّذِينَ كَفَرُوا۟ لَيُزْلِقُونَكَ بِأَبْصَـٰرِهِمْ لَمَّا سَمِعُوا۟ ٱلذِّكْرَ وَيَقُولُونَ إِنَّهُۥ لَمَجْنُونٌ",
      "english": "And indeed, those who disbelieve would almost make you slip with their eyes when they hear the message, and they say, \"Indeed, he is mad.\"",
      "hausa": "Kuma lalle, ne waɗanda suka kãfirta sunã yin kamar su kãyar da kai sabõ da kallonsu (kallon mãmãki), a lokacin da suke jin karãtun Alƙur'ãni, kuma sunã cẽwa, \"Lalle ne shi mahaukaci ne!\""
    },
    {
      "ayah": 52,
      "arabic": "وَمَا هُوَ إِلَّا ذِكْرٌ لِّلْعَـٰلَمِينَ",
      "english": "But it is not except a reminder to the worlds.",
      "hausa": "Shi (Alƙur'ãni) bai kasance ba, fãce abin tunãtarwa ne ga duka dũniya."
    }
  ]
}