{
  "surah": 40,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "حمٓ",
      "english": "Ha, Meem.",
      "hausa": "Ḥ. M̃."
    },
    {
      "ayah": 2,
      "arabic": "تَنزِيلُ ٱلْكِتَـٰبِ مِنَ ٱللَّهِ ٱلْعَزِيزِ ٱلْعَلِيمِ",
      "english": "The revelation of the Book is from Allah, the Exalted in Might, the Knowing.",
      "hausa": "Saukar da Littãfi daga Allah ne, Mabuwãyi, Masani."
    },
    {
      "ayah": 3,
      "arabic": "غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوْبِ شَدِيدِ ٱلْعِقَابِ ذِى ٱلطَّوْلِ ۖ لَآ إِلَـٰهَ إِلَّا هُوَ ۖ إِلَيْهِ ٱلْمَصِيرُ",
      "english": "The forgiver of sin, acceptor of repentance, severe in punishment, owner of abundance. There is no deity except Him; to Him is the destination.",
      "hausa": "Mai gãfarta zunubi kuma Mai karɓar tũba Mai tsananin azãba, Mai wadãtarwa bãbu abin bautawa fãce Shi, zuwa gare Shi makõma take."
    },
    {
      "ayah": 4,
      "arabic": "مَا يُجَـٰدِلُ فِىٓ ءَايَـٰتِ ٱللَّهِ إِلَّا ٱلَّذِينَ كَفَرُوا۟ فَلَا يَغْرُرْكَ تَقَلُّبُهُمْ فِى ٱلْبِلَـٰدِ",
      "english": "No one disputes concerning the signs of Allah except those who disbelieve, so be not deceived by their [uninhibited] movement throughout the land.",
      "hausa": "Bãbu mai jãyayya a cikin ãyõyin Allah, fãce waɗanda suka kãfirta. Sabõda haka kada jũyãwarsu a cikin garũruwa ta rũɗe ka"
    },
    {
      "ayah": 5,
      "arabic": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَٱلْأَحْزَابُ مِنۢ بَعْدِهِمْ ۖ وَهَمَّتْ كُلُّ أُمَّةٍۭ بِرَسُولِهِمْ لِيَأْخُذُوهُ ۖ وَجَـٰدَلُوا۟ بِٱلْبَـٰطِلِ لِيُدْحِضُوا۟ بِهِ ٱلْحَقَّ فَأَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ عِقَابِ",
      "english": "The people of Noah denied before them and the [disbelieving] factions after them, and every nation intended [a plot] for their messenger to seize him, and they disputed by [using] falsehood to [attempt to] invalidate thereby the truth. So I seized them, and how [terrible] was My penalty.",
      "hausa": "Mutãnen Nũhu sun ƙaryata a gabãninsu, da ƙungiyõyin da suke a bãyansu, kuma kõwace al'umma tã yi nufi game da Manzonsu, dõmin su kãmã shi. Kuma suka yi jãyayya da ƙarya dõmin su gusar da gaskiya da ita. Sai Na kãmã su. To, yãya azãbãTa take?"
    },
    {
      "ayah": 6,
      "arabic": "وَكَذَٰلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِينَ كَفَرُوٓا۟ أَنَّهُمْ أَصْحَـٰبُ ٱلنَّارِ",
      "english": "And thus has the word of your Lord come into effect upon those who disbelieved that they are companions of the Fire.",
      "hausa": "Kuma kamar haka kalmar Ubangijinka ta wajaba a kan waɗanda suka kãfirta, dõmin sũ 'yan wutã ne."
    },
    {
      "ayah": 7,
      "arabic": "ٱلَّذِينَ يَحْمِلُونَ ٱلْعَرْشَ وَمَنْ حَوْلَهُۥ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِۦ وَيَسْتَغْفِرُونَ لِلَّذِينَ ءَامَنُوا۟ رَبَّنَا وَسِعْتَ كُلَّ شَىْءٍ رَّحْمَةً وَعِلْمًا فَٱغْفِرْ لِلَّذِينَ تَابُوا۟ وَٱتَّبَعُوا۟ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ",
      "english": "Those [angels] who carry the Throne and those around it exalt [Allah] with praise of their Lord and believe in Him and ask forgiveness for those who have believed, [saying], \"Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire.",
      "hausa": "Waɗanda ke ɗaukar Al'arshi da waɗanda ke kẽwayenta, sunã tasbĩhi game da gõde wa Ubangijinsu, kuma sunã yin ĩmãni da Shi, kuma sunã yin istigfãri dõmin waɗanda suka yi ĩmãni, (sunã cẽwa), \"Yã Ubangijinmu! Kã yalwaci dukan kõme da rahama da ilmi to Ka yi gãfara ga waɗanda suka tũba kuma suka bi hanyarKa, kuma Ka tsare musu azãbar Jahĩm.\""
    },
    {
      "ayah": 8,
      "arabic": "رَبَّنَا وَأَدْخِلْهُمْ جَنَّـٰتِ عَدْنٍ ٱلَّتِى وَعَدتَّهُمْ وَمَن صَلَحَ مِنْ ءَابَآئِهِمْ وَأَزْوَٰجِهِمْ وَذُرِّيَّـٰتِهِمْ ۚ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "english": "Our Lord, and admit them to gardens of perpetual residence which You have promised them and whoever was righteous among their fathers, their spouses and their offspring. Indeed, it is You who is the Exalted in Might, the Wise.",
      "hausa": "\"Ya Ubangijinmu! Kuma Ka shigar da su a gidãjen Aljannar zama, wannan da Ka yi musu wa'adi, sũ da wanda ya kyautatu daga ubanninsu da mãtan aurensu da zurriyarsu. Lalle Kai, Kai ne Mabuwãyi, Mai hikima.\""
    },
    {
      "ayah": 9,
      "arabic": "وَقِهِمُ ٱلسَّيِّـَٔاتِ ۚ وَمَن تَقِ ٱلسَّيِّـَٔاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُۥ ۚ وَذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "english": "And protect them from the evil consequences [of their deeds]. And he whom You protect from evil consequences that Day - You will have given him mercy. And that is the great attainment.\"",
      "hausa": "\"Kuma Ka tsare su daga mũnãnan ayyuka, kuma wanda Ka tsare shi daga mũnãnan ayyuka a rãnarnan, to, lalle, Ka yi masa rahama kuma wancan shi ne babban rabo mai girma.\""
    },
    {
      "ayah": 10,
      "arabic": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ يُنَادَوْنَ لَمَقْتُ ٱللَّهِ أَكْبَرُ مِن مَّقْتِكُمْ أَنفُسَكُمْ إِذْ تُدْعَوْنَ إِلَى ٱلْإِيمَـٰنِ فَتَكْفُرُونَ",
      "english": "Indeed, those who disbelieve will be addressed, \"The hatred of Allah for you was [even] greater than your hatred of yourselves [this Day in Hell] when you were invited to faith, but you refused.\"",
      "hausa": "Lalle waɗanda suka kãfirta, anã kiran su, \"Haƙĩƙa, ƙin Allah (a gare ku) shĩ ne mafi girma daga ƙinku ga kanku a lõkacin da ake kiran ku zuwa ga ĩmãni, sai kunã ta kãfircẽwa.\""
    },
    {
      "ayah": 11,
      "arabic": "قَالُوا۟ رَبَّنَآ أَمَتَّنَا ٱثْنَتَيْنِ وَأَحْيَيْتَنَا ٱثْنَتَيْنِ فَٱعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَىٰ خُرُوجٍ مِّن سَبِيلٍ",
      "english": "They will say, \"Our Lord, You made us lifeless twice and gave us life twice, and we have confessed our sins. So is there to an exit any way?\"",
      "hausa": "Suka ce: \"Ya Ubangijinmu! Kã matar da mu sau biyu, kuma Kã rãyar da mu sau biyu, sabõda haka mun yarda da laifuffukan mu. To, shin, akwai wata hanya zuwa ga fita?\""
    },
    {
      "ayah": 12,
      "arabic": "ذَٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِىَ ٱللَّهُ وَحْدَهُۥ كَفَرْتُمْ ۖ وَإِن يُشْرَكْ بِهِۦ تُؤْمِنُوا۟ ۚ فَٱلْحُكْمُ لِلَّهِ ٱلْعَلِىِّ ٱلْكَبِيرِ",
      "english": "[They will be told], \"That is because, when Allah was called upon alone, you disbelieved; but if others were associated with Him, you believed. So the judgement is with Allah, the Most High, the Grand.\"",
      "hausa": "Wancan sababinsa, lalle (shi ne) idan an kirãyi Allah Shi kaɗai, sai ku kãfirta, kuma idan aka yi shirki game da Shi, sai ku yi ĩmãni. To, hukuncin fa, na Allah Maɗaukaki, Mai girma ne."
    },
    {
      "ayah": 13,
      "arabic": "هُوَ ٱلَّذِى يُرِيكُمْ ءَايَـٰتِهِۦ وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ رِزْقًا ۚ وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ",
      "english": "It is He who shows you His signs and sends down to you from the sky, provision. But none will remember except he who turns back [in repentance].",
      "hausa": "Shĩ ne Wanda ke nũna muku ãyõyinSa, kuma Ya saukar da arziki daga sama sabõda ku, kuma bãbu mai yin tunãni fãce mai mayar da al'amari ga Allah."
    },
    {
      "ayah": 14,
      "arabic": "فَٱدْعُوا۟ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ وَلَوْ كَرِهَ ٱلْكَـٰفِرُونَ",
      "english": "So invoke Allah, [being] sincere to Him in religion, although the disbelievers dislike it.",
      "hausa": "Sabõda haka ku kirãyi Allah, kunã mãsu tsarkake addini a gare Shi, kuma kõ dã kãfirai sun ƙi."
    },
    {
      "ayah": 15,
      "arabic": "رَفِيعُ ٱلدَّرَجَـٰتِ ذُو ٱلْعَرْشِ يُلْقِى ٱلرُّوحَ مِنْ أَمْرِهِۦ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ لِيُنذِرَ يَوْمَ ٱلتَّلَاقِ",
      "english": "[He is] the Exalted above [all] degrees, Owner of the Throne; He places the inspiration of His command upon whom He wills of His servants to warn of the Day of Meeting.",
      "hausa": "Mai ɗaukaka darajõji (dõmin mũminai), Mai Al'arshi, Yanã jẽfa rũhi daga al'amarinSa a kan wanda Ya so daga bãyinSa, dõmin ya yi gargaɗi kan rãnar gamuwa."
    },
    {
      "ayah": 16,
      "arabic": "يَوْمَ هُم بَـٰرِزُونَ ۖ لَا يَخْفَىٰ عَلَى ٱللَّهِ مِنْهُمْ شَىْءٌ ۚ لِّمَنِ ٱلْمُلْكُ ٱلْيَوْمَ ۖ لِلَّهِ ٱلْوَٰحِدِ ٱلْقَهَّارِ",
      "english": "The Day they come forth nothing concerning them will be concealed from Allah. To whom belongs [all] sovereignty this Day? To Allah, the One, the Prevailing.",
      "hausa": "Rãnar da suke bayyanannu, bãbu wani abu daga gare su wanda yake iya bõyuwa ga Allah. \"Mulki ga wa ya ke a yau?\" Yana ga Allah, Makaɗaici, Mai tĩlastãwa."
    },
    {
      "ayah": 17,
      "arabic": "ٱلْيَوْمَ تُجْزَىٰ كُلُّ نَفْسٍۭ بِمَا كَسَبَتْ ۚ لَا ظُلْمَ ٱلْيَوْمَ ۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
      "english": "This Day every soul will be recompensed for what it earned. No injustice today! Indeed, Allah is swift in account.",
      "hausa": "Yau anã sãka wa kõwane rai a game da abin da ya aikata, bãbu zãlunci a yau. Lalle Allah Mai gaggawar hisãbi ne."
    },
    {
      "ayah": 18,
      "arabic": "وَأَنذِرْهُمْ يَوْمَ ٱلْـَٔازِفَةِ إِذِ ٱلْقُلُوبُ لَدَى ٱلْحَنَاجِرِ كَـٰظِمِينَ ۚ مَا لِلظَّـٰلِمِينَ مِنْ حَمِيمٍ وَلَا شَفِيعٍ يُطَاعُ",
      "english": "And warn them, [O Muhammad], of the Approaching Day, when hearts are at the throats, filled [with distress]. For the wrongdoers there will be no devoted friend and no intercessor [who is] obeyed.",
      "hausa": "Kuma ka yi musu gargaɗi kan rãnar (Sã'a) makusanciya, a lõkacin da zukãta suke mãsu cika da bakin ciki, ga maƙõsansu. Bãbu wani masõyi ga azzãlumai, kuma bãbu wani mai cẽto da zã a yi wa dã'a (ga cẽtonsu)."
    },
    {
      "ayah": 19,
      "arabic": "يَعْلَمُ خَآئِنَةَ ٱلْأَعْيُنِ وَمَا تُخْفِى ٱلصُّدُورُ",
      "english": "He knows that which deceives the eyes and what the breasts conceal.",
      "hausa": "(Allah) Ya san yaudarar idãnu da abin da ƙirãza ke ɓõyẽwa."
    },
    {
      "ayah": 20,
      "arabic": "وَٱللَّهُ يَقْضِى بِٱلْحَقِّ ۖ وَٱلَّذِينَ يَدْعُونَ مِن دُونِهِۦ لَا يَقْضُونَ بِشَىْءٍ ۗ إِنَّ ٱللَّهَ هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ",
      "english": "And Allah judges with truth, while those they invoke besides Him judge not with anything. Indeed, Allah - He is the Hearing, the Seeing.",
      "hausa": "Kuma Allah Shĩ ke yin hukunci da gaskiya, waɗannan da kuke kira, waninSa, bã su yin hukunci da kõme. Lalle Allah, Shĩ ne Mai ji, Mai gani."
    },
    {
      "ayah": 21,
      "arabic": "أَوَلَمْ يَسِيرُوا۟ فِى ٱلْأَرْضِ فَيَنظُرُوا۟ كَيْفَ كَانَ عَـٰقِبَةُ ٱلَّذِينَ كَانُوا۟ مِن قَبْلِهِمْ ۚ كَانُوا۟ هُمْ أَشَدَّ مِنْهُمْ قُوَّةً وَءَاثَارًا فِى ٱلْأَرْضِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمْ وَمَا كَانَ لَهُم مِّنَ ٱللَّهِ مِن وَاقٍ",
      "english": "Have they not traveled through the land and observed how was the end of those who were before them? They were greater than them in strength and in impression on the land, but Allah seized them for their sins. And they had not from Allah any protector.",
      "hausa": "Ashe, ba su yi tafiya ba, a cikin ƙasã, dõmin su dũba ga yadda ãƙibar waɗanda suka kasance a gabãninsu ta zama? Sun kasance sũ ne mafi tsananin ƙarfi daga gare su, da kufaifan aiki a cikin ƙasã, sai Allah Ya kãmã su da laifuffukansu. Kuma bã su da wani mai tsarẽwa daga Allah."
    },
    {
      "ayah": 22,
      "arabic": "ذَٰلِكَ بِأَنَّهُمْ كَانَت تَّأْتِيهِمْ رُسُلُهُم بِٱلْبَيِّنَـٰتِ فَكَفَرُوا۟ فَأَخَذَهُمُ ٱللَّهُ ۚ إِنَّهُۥ قَوِىٌّ شَدِيدُ ٱلْعِقَابِ",
      "english": "That was because their messengers were coming to them with clear proofs, but they disbelieved, so Allah seized them. Indeed, He is Powerful and severe in punishment.",
      "hausa": "Wancan sababinsa, dõmin sũ Manzanninsu sun kasance sunã zuwa gare su da hujjõji bayyanannu, sai suka kãfirta, sai Allah Ya kãmã su. Lalle Shĩ Mai ƙarfi ne, Mai tsananin azãba."
    },
    {
      "ayah": 23,
      "arabic": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِـَٔايَـٰتِنَا وَسُلْطَـٰنٍ مُّبِينٍ",
      "english": "And We did certainly send Moses with Our signs and a clear authority",
      "hausa": "Kuma lalle ne, haƙĩƙa, Mun aika Mũsã a game da ãyõyinMu da wani dalĩli bayyananne."
    },
    {
      "ayah": 24,
      "arabic": "إِلَىٰ فِرْعَوْنَ وَهَـٰمَـٰنَ وَقَـٰرُونَ فَقَالُوا۟ سَـٰحِرٌ كَذَّابٌ",
      "english": "To Pharaoh, Haman and Qarun; but they said, \"[He is] a magician and a liar.\"",
      "hausa": "Zuwa ga Fir'auna da Hãmãna da Kãrũna, sai suka ce: \"Mai sihiri ne, maƙaryaci.\""
    },
    {
      "ayah": 25,
      "arabic": "فَلَمَّا جَآءَهُم بِٱلْحَقِّ مِنْ عِندِنَا قَالُوا۟ ٱقْتُلُوٓا۟ أَبْنَآءَ ٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ وَٱسْتَحْيُوا۟ نِسَآءَهُمْ ۚ وَمَا كَيْدُ ٱلْكَـٰفِرِينَ إِلَّا فِى ضَلَـٰلٍ",
      "english": "And when he brought them the truth from Us, they said, \"Kill the sons of those who have believed with him and keep their women alive.\" But the plan of the disbelievers is not except in error.",
      "hausa": "Sa'an nan, a lõkacin da ya jẽ musu da gaskiya daga wurinMu, suka ce: \"Ku kashe ɗiyan waɗanda suka yi ĩmãni tãre da shi, kuma ku rãyar da mãtansu.\" Kuma mugun shirin kãfirai, bai zama ba fãce a cikin bata."
    },
    {
      "ayah": 26,
      "arabic": "وَقَالَ فِرْعَوْنُ ذَرُونِىٓ أَقْتُلْ مُوسَىٰ وَلْيَدْعُ رَبَّهُۥٓ ۖ إِنِّىٓ أَخَافُ أَن يُبَدِّلَ دِينَكُمْ أَوْ أَن يُظْهِرَ فِى ٱلْأَرْضِ ٱلْفَسَادَ",
      "english": "And Pharaoh said, \"Let me kill Moses and let him call upon his Lord. Indeed, I fear that he will change your religion or that he will cause corruption in the land.\"",
      "hausa": "Kuma Fir'auna ya ce: \"Ku bar ni in kashe Mũsã, kuma shĩ, ya kirãyi Ubangijinsa. Lalle ne nĩ, inã tsõron ya musanya addininku, kõ kuwa ya bayyana ɓarna a cikin kasã.\""
    },
    {
      "ayah": 27,
      "arabic": "وَقَالَ مُوسَىٰٓ إِنِّى عُذْتُ بِرَبِّى وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرٍ لَّا يُؤْمِنُ بِيَوْمِ ٱلْحِسَابِ",
      "english": "But Moses said, \"Indeed, I have sought refuge in my Lord and your Lord from every arrogant one who does not believe in the Day of Account.\"",
      "hausa": "Kuma Mũsã ya ce: \"Lalle nĩ, nã nẽmi tsari da Ubangijĩna kuma Ubangijinku, daga dukan makangari, wanda bã ya ĩmani da rãnar Hisãbi.\""
    },
    {
      "ayah": 28,
      "arabic": "وَقَالَ رَجُلٌ مُّؤْمِنٌ مِّنْ ءَالِ فِرْعَوْنَ يَكْتُمُ إِيمَـٰنَهُۥٓ أَتَقْتُلُونَ رَجُلًا أَن يَقُولَ رَبِّىَ ٱللَّهُ وَقَدْ جَآءَكُم بِٱلْبَيِّنَـٰتِ مِن رَّبِّكُمْ ۖ وَإِن يَكُ كَـٰذِبًا فَعَلَيْهِ كَذِبُهُۥ ۖ وَإِن يَكُ صَادِقًا يُصِبْكُم بَعْضُ ٱلَّذِى يَعِدُكُمْ ۖ إِنَّ ٱللَّهَ لَا يَهْدِى مَنْ هُوَ مُسْرِفٌ كَذَّابٌ",
      "english": "And a believing man from the family of Pharaoh who concealed his faith said, \"Do you kill a man [merely] because he says, 'My Lord is Allah' while he has brought you clear proofs from your Lord? And if he should be lying, then upon him is [the consequence of] his lie; but if he should be truthful, there will strike you some of what he promises you. Indeed, Allah does not guide one who is a transgressor and a liar.",
      "hausa": "Kuma wani namiji mũmini daga dangin Fir'auna, yanã bõye ĩmãninsa, ya ce: \"Ashe, za ku kashe mutum dõmin ya ce Ubangijina Allah ne, alhãli kuwa haƙĩƙa ya zo muku da hujjõji bayyanannu daga Ubangijinku? Idan yã kasance maƙaryaci ne, to, ƙaryarsa na kansa, kuma idan ya kasance mai gaskiya ne, sãshen abin da yake yi muku wa'adi zai sãme ku. Lalle ne Allah bã Ya shiryar da wanda yake mai barna, mai yawan ƙarya.\""
    },
    {
      "ayah": 29,
      "arabic": "يَـٰقَوْمِ لَكُمُ ٱلْمُلْكُ ٱلْيَوْمَ ظَـٰهِرِينَ فِى ٱلْأَرْضِ فَمَن يَنصُرُنَا مِنۢ بَأْسِ ٱللَّهِ إِن جَآءَنَا ۚ قَالَ فِرْعَوْنُ مَآ أُرِيكُمْ إِلَّا مَآ أَرَىٰ وَمَآ أَهْدِيكُمْ إِلَّا سَبِيلَ ٱلرَّشَادِ",
      "english": "O my people, sovereignty is yours today, [your being] dominant in the land. But who would protect us from the punishment of Allah if it came to us?\" Pharaoh said, \"I do not show you except what I see, and I do not guide you except to the way of right conduct.\"",
      "hausa": "\"Yã kũ mutãnẽna! Kunã da mulki a yau, kuma kũ ne marinjãya a cikin kasã to wãne ne zai taimake mu daga azãbar Allah idan ta zo mana?\" Fir'auna ya ce: \"Bã ni nũnamuku kõme face abin da na gani, kuma ba ni shiryar da ku, sai ga hanyar shiryuwa.\""
    },
    {
      "ayah": 30,
      "arabic": "وَقَالَ ٱلَّذِىٓ ءَامَنَ يَـٰقَوْمِ إِنِّىٓ أَخَافُ عَلَيْكُم مِّثْلَ يَوْمِ ٱلْأَحْزَابِ",
      "english": "And he who believed said, \"O my people, indeed I fear for you [a fate] like the day of the companies -",
      "hausa": "Kuma wannan da ya yi ĩmãni ya ce: \"Ya mutãnẽnã! Lallene, nĩ, inã yi muku tsõron kwatankwacin rãnar ƙungiyõyi.\""
    },
    {
      "ayah": 31,
      "arabic": "مِثْلَ دَأْبِ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَٱلَّذِينَ مِنۢ بَعْدِهِمْ ۚ وَمَا ٱللَّهُ يُرِيدُ ظُلْمًا لِّلْعِبَادِ",
      "english": "Like the custom of the people of Noah and of 'Aad and Thamud and those after them. And Allah wants no injustice for [His] servants.",
      "hausa": "\"Kwatankwacin al'adar mutãnen Nũhu da Ãdãwa da Samũdãwa da waɗanda ke a bãyansu. Kuma Allah bã Ya nufin zãlunci ga bãyinSa.\""
    },
    {
      "ayah": 32,
      "arabic": "وَيَـٰقَوْمِ إِنِّىٓ أَخَافُ عَلَيْكُمْ يَوْمَ ٱلتَّنَادِ",
      "english": "And O my people, indeed I fear for you the Day of Calling -",
      "hausa": "\"Kuma ya mutãnẽna! Lallenĩ, inã yi muku tsõron rãnar kiran jũna.\""
    },
    {
      "ayah": 33,
      "arabic": "يَوْمَ تُوَلُّونَ مُدْبِرِينَ مَا لَكُم مِّنَ ٱللَّهِ مِنْ عَاصِمٍ ۗ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٍ",
      "english": "The Day you will turn your backs fleeing; there is not for you from Allah any protector. And whoever Allah leaves astray - there is not for him any guide.",
      "hausa": "\"A rãnar da zã ku jũya, kunã mãsu bãyar da bãya (gudãne) bã ku da wani mai tsaro daga Allah. Kuma wanda Allah Ya ɓatar, to, bã shi da wani mai shiryarwa.\""
    },
    {
      "ayah": 34,
      "arabic": "وَلَقَدْ جَآءَكُمْ يُوسُفُ مِن قَبْلُ بِٱلْبَيِّنَـٰتِ فَمَا زِلْتُمْ فِى شَكٍّ مِّمَّا جَآءَكُم بِهِۦ ۖ حَتَّىٰٓ إِذَا هَلَكَ قُلْتُمْ لَن يَبْعَثَ ٱللَّهُ مِنۢ بَعْدِهِۦ رَسُولًا ۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَنْ هُوَ مُسْرِفٌ مُّرْتَابٌ",
      "english": "And Joseph had already come to you before with clear proofs, but you remained in doubt of that which he brought to you, until when he died, you said, 'Never will Allah send a messenger after him.' Thus does Allah leave astray he who is a transgressor and skeptic.\"",
      "hausa": "\"Kuma lalle ne, haƙĩƙa, Yusufu ya zo muku daga gabãni, da hujjõji bayyanannu, ba ku gushe ba kunã a cikin shakka daga abin da ya zo muku da shi, har a lõkacin da ya halaka kuka ce, 'Allah bã zai aiko wani Manzo ba, a bãyansa.' Kamar haka Allah ke ɓatar da wanda yake mai ɓarna, mai shakka.\""
    },
    {
      "ayah": 35,
      "arabic": "ٱلَّذِينَ يُجَـٰدِلُونَ فِىٓ ءَايَـٰتِ ٱللَّهِ بِغَيْرِ سُلْطَـٰنٍ أَتَىٰهُمْ ۖ كَبُرَ مَقْتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِينَ ءَامَنُوا۟ ۚ كَذَٰلِكَ يَطْبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ",
      "english": "Those who dispute concerning the signs of Allah without an authority having come to them - great is hatred [of them] in the sight of Allah and in the sight of those who have believed. Thus does Allah seal over every heart [belonging to] an arrogant tyrant.",
      "hausa": "\"Waɗanda kejayayya a cikin ãyõyin Allah, bã da wani dalĩli da ya zo musu ba. Jidalin ya girma ga zamansa abin ki a wurin Allah da wurin waɗanda suka yi ĩmãni. Kamar haka Allah ke bicẽwar haske a kan zũciyar dukan makangari, mai tĩlastãwa.\""
    },
    {
      "ayah": 36,
      "arabic": "وَقَالَ فِرْعَوْنُ يَـٰهَـٰمَـٰنُ ٱبْنِ لِى صَرْحًا لَّعَلِّىٓ أَبْلُغُ ٱلْأَسْبَـٰبَ",
      "english": "And Pharaoh said, \"O Haman, construct for me a tower that I might reach the ways -",
      "hausa": "Kuma Fir'auna ye ce, \"Yã Hãmana! Ka gina mini bẽne, dammãnĩna zã ni isa ga ƙõfõfi.\""
    },
    {
      "ayah": 37,
      "arabic": "أَسْبَـٰبَ ٱلسَّمَـٰوَٰتِ فَأَطَّلِعَ إِلَىٰٓ إِلَـٰهِ مُوسَىٰ وَإِنِّى لَأَظُنُّهُۥ كَـٰذِبًا ۚ وَكَذَٰلِكَ زُيِّنَ لِفِرْعَوْنَ سُوٓءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِيلِ ۚ وَمَا كَيْدُ فِرْعَوْنَ إِلَّا فِى تَبَابٍ",
      "english": "The ways into the heavens - so that I may look at the deity of Moses; but indeed, I think he is a liar.\" And thus was made attractive to Pharaoh the evil of his deed, and he was averted from the [right] way. And the plan of Pharaoh was not except in ruin.",
      "hausa": "\"¡õfõfin sammai dõmin in yi ninƙaya zuwa ga abin bautãwar Mũsã. Kuma lalle nĩ haƙĩƙa inã zaton sa maƙaryaci.\" Kuma haka dai aka ƙawãce wa Fir'auna mũnãnan aikinsakuma aka danne shi daga barin tafarki. Kuma mugun nufin Fir'auna bai zama ba fãce yanã a cikin hasãra.\""
    },
    {
      "ayah": 38,
      "arabic": "وَقَالَ ٱلَّذِىٓ ءَامَنَ يَـٰقَوْمِ ٱتَّبِعُونِ أَهْدِكُمْ سَبِيلَ ٱلرَّشَادِ",
      "english": "And he who believed said, \"O my people, follow me, I will guide you to the way of right conduct.",
      "hausa": "Kuma wannan da ya yi ĩmãni ya ce: \"Ya mutãnẽna! Ku bĩ ni, in shiryar da ku tafarkin shiryuwa.\""
    },
    {
      "ayah": 39,
      "arabic": "يَـٰقَوْمِ إِنَّمَا هَـٰذِهِ ٱلْحَيَوٰةُ ٱلدُّنْيَا مَتَـٰعٌ وَإِنَّ ٱلْـَٔاخِرَةَ هِىَ دَارُ ٱلْقَرَارِ",
      "english": "O my people, this worldly life is only [temporary] enjoyment, and indeed, the Hereafter - that is the home of [permanent] settlement.",
      "hausa": "\"Kuma ya mutãnẽna! Wannan rãyuwa ta dũniya dan jin dãɗi ne kawai, kuma lalle Lãhira ita ce gidan tabbata.\""
    },
    {
      "ayah": 40,
      "arabic": "مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزَىٰٓ إِلَّا مِثْلَهَا ۖ وَمَنْ عَمِلَ صَـٰلِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَأُو۟لَـٰٓئِكَ يَدْخُلُونَ ٱلْجَنَّةَ يُرْزَقُونَ فِيهَا بِغَيْرِ حِسَابٍ",
      "english": "Whoever does an evil deed will not be recompensed except by the like thereof; but whoever does righteousness, whether male or female, while he is a believer - those will enter Paradise, being given provision therein without account.",
      "hausa": "\"Wanda ya aikata mummunan aiki to, ba za a sãka masa ba fãce da misãlinsa, kuma wanda ya aikata aiki na ƙwarai daga namiji kõ mace alhãli kuwa shĩ mũmini ne, to, waɗannan sunã shiga Aljanna, anã ciyar da su a cikinta, bã da lissãfi ba.\""
    },
    {
      "ayah": 41,
      "arabic": "وَيَـٰقَوْمِ مَا لِىٓ أَدْعُوكُمْ إِلَى ٱلنَّجَوٰةِ وَتَدْعُونَنِىٓ إِلَى ٱلنَّارِ",
      "english": "And O my people, how is it that I invite you to salvation while you invite me to the Fire?",
      "hausa": "\"Kuma ya mutãnẽna! Me ya sãme ni, inã kiran ku zuwa ga tsĩra, kuma kunã kira na zuwa ga wutã?\""
    },
    {
      "ayah": 42,
      "arabic": "تَدْعُونَنِى لِأَكْفُرَ بِٱللَّهِ وَأُشْرِكَ بِهِۦ مَا لَيْسَ لِى بِهِۦ عِلْمٌ وَأَنَا۠ أَدْعُوكُمْ إِلَى ٱلْعَزِيزِ ٱلْغَفَّـٰرِ",
      "english": "You invite me to disbelieve in Allah and associate with Him that of which I have no knowledge, and I invite you to the Exalted in Might, the Perpetual Forgiver.",
      "hausa": "\"Kuna kira na zuwa ga in kãfirta da Allah, kuma in yi shirki, game da Shi, da abin da bãbu wani ilmi game da shi gare ni, kuma ni inã kiran ku zuwa ga Mabuwãyi, Mai gãfara.\""
    },
    {
      "ayah": 43,
      "arabic": "لَا جَرَمَ أَنَّمَا تَدْعُونَنِىٓ إِلَيْهِ لَيْسَ لَهُۥ دَعْوَةٌ فِى ٱلدُّنْيَا وَلَا فِى ٱلْـَٔاخِرَةِ وَأَنَّ مَرَدَّنَآ إِلَى ٱللَّهِ وَأَنَّ ٱلْمُسْرِفِينَ هُمْ أَصْحَـٰبُ ٱلنَّارِ",
      "english": "Assuredly, that to which you invite me has no [response to a] supplication in this world or in the Hereafter; and indeed, our return is to Allah, and indeed, the transgressors will be companions of the Fire.",
      "hausa": "\"Haƙƙan ne abin da kawai kuke kira na zuwa gare shi, bã ya da wani kira a cikin dũniya, kuma bã shi da shi a Lãhira kuma lalle makomarmu zuwa ga Allah take, kuma lalle mabarnata sũ ne 'yan wutã.\""
    },
    {
      "ayah": 44,
      "arabic": "فَسَتَذْكُرُونَ مَآ أَقُولُ لَكُمْ ۚ وَأُفَوِّضُ أَمْرِىٓ إِلَى ٱللَّهِ ۚ إِنَّ ٱللَّهَ بَصِيرٌۢ بِٱلْعِبَادِ",
      "english": "And you will remember what I [now] say to you, and I entrust my affair to Allah. Indeed, Allah is Seeing of [His] servants.\"",
      "hausa": "\"To zã ku ambaci abin da nake gaya muku, kuma inã fawwala al'amarina zuwa ga Allah. Lalle Allah Mai gani ne ga bãyinSa.\""
    },
    {
      "ayah": 45,
      "arabic": "فَوَقَىٰهُ ٱللَّهُ سَيِّـَٔاتِ مَا مَكَرُوا۟ ۖ وَحَاقَ بِـَٔالِ فِرْعَوْنَ سُوٓءُ ٱلْعَذَابِ",
      "english": "So Allah protected him from the evils they plotted, and the people of Pharaoh were enveloped by the worst of punishment -",
      "hausa": "Sai Allah Ya tsare shi daga mũnãnan abũbuwa da suka yi na mãkirci, kuma mummunar azãba ta wajaba ga mutãnen Fir'auna."
    },
    {
      "ayah": 46,
      "arabic": "ٱلنَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا ۖ وَيَوْمَ تَقُومُ ٱلسَّاعَةُ أَدْخِلُوٓا۟ ءَالَ فِرْعَوْنَ أَشَدَّ ٱلْعَذَابِ",
      "english": "The Fire, they are exposed to it morning and evening. And the Day the Hour appears [it will be said], \"Make the people of Pharaoh enter the severest punishment.\"",
      "hausa": "Wutã, anã gitta su a kanta, sãfe da maraice, kuma a rãnar da Sa'a take tsayuwa, anã cẽwa, \"Ku shigar da mutãnen Fir'auna a mafi tsananin azãba.\""
    },
    {
      "ayah": 47,
      "arabic": "وَإِذْ يَتَحَآجُّونَ فِى ٱلنَّارِ فَيَقُولُ ٱلضُّعَفَـٰٓؤُا۟ لِلَّذِينَ ٱسْتَكْبَرُوٓا۟ إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنتُم مُّغْنُونَ عَنَّا نَصِيبًا مِّنَ ٱلنَّارِ",
      "english": "And [mention] when they will argue within the Fire, and the weak will say to those who had been arrogant, \"Indeed, we were [only] your followers, so will you relieve us of a share of the Fire?\"",
      "hausa": "Kuma a lõkacin da suke husũma a cikin wutã, sai raunãna (mabiya) su ce wa waɗanda suka kangara (shugabanni), \"Lalle mũ, mun kasance mabiya gare ku, to, shin kũ mãsu wadãtar da mu ne daga barin wani rabo daga wutã?\""
    },
    {
      "ayah": 48,
      "arabic": "قَالَ ٱلَّذِينَ ٱسْتَكْبَرُوٓا۟ إِنَّا كُلٌّ فِيهَآ إِنَّ ٱللَّهَ قَدْ حَكَمَ بَيْنَ ٱلْعِبَادِ",
      "english": "Those who had been arrogant will say, \"Indeed, all [of us] are in it. Indeed, Allah has judged between the servants.\"",
      "hausa": "Waɗanda suka kangara suka ce: \"Lalle mũ duka munã a cikinta. Lalle ne, Allah Ya yi hukunci a tsakãnin bãyinSa.\""
    },
    {
      "ayah": 49,
      "arabic": "وَقَالَ ٱلَّذِينَ فِى ٱلنَّارِ لِخَزَنَةِ جَهَنَّمَ ٱدْعُوا۟ رَبَّكُمْ يُخَفِّفْ عَنَّا يَوْمًا مِّنَ ٱلْعَذَابِ",
      "english": "And those in the Fire will say to the keepers of Hell, \"Supplicate your Lord to lighten for us a day from the punishment.\"",
      "hausa": "Kuma waɗanda suke a cikin wutã suka ce wa matsaran Jahannama, \"Ku rõki Ubangijinku Ya sauƙaƙa mana, a yini ɗaya, daga azãba.\""
    },
    {
      "ayah": 50,
      "arabic": "قَالُوٓا۟ أَوَلَمْ تَكُ تَأْتِيكُمْ رُسُلُكُم بِٱلْبَيِّنَـٰتِ ۖ قَالُوا۟ بَلَىٰ ۚ قَالُوا۟ فَٱدْعُوا۟ ۗ وَمَا دُعَـٰٓؤُا۟ ٱلْكَـٰفِرِينَ إِلَّا فِى ضَلَـٰلٍ",
      "english": "They will say, \"Did there not come to you your messengers with clear proofs?\" They will say, \"Yes.\" They will reply, \"Then supplicate [yourselves], but the supplication of the disbelievers is not except in error.\"",
      "hausa": "Suka ce: \"Ashe, Manzanninku ba su jẽ muku da hujjõji bayyanannu ba?\" Suka ce: \"Na'am, sun jẽ!\" Suka ce: \"To, ku rõƙa.\" Kuma rõƙon kãfirai bai zamo ba fãce a cikin ɓata."
    },
    {
      "ayah": 51,
      "arabic": "إِنَّا لَنَنصُرُ رُسُلَنَا وَٱلَّذِينَ ءَامَنُوا۟ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَيَوْمَ يَقُومُ ٱلْأَشْهَـٰدُ",
      "english": "Indeed, We will support Our messengers and those who believe during the life of this world and on the Day when the witnesses will stand -",
      "hausa": "Lalle Mũ, hakĩka, Munã taimakon ManzanninMu da waɗanda suka yi ĩmãni, a cikin rãyuwar dũniya da rãnar da shaidu ke tsayãwa."
    },
    {
      "ayah": 52,
      "arabic": "يَوْمَ لَا يَنفَعُ ٱلظَّـٰلِمِينَ مَعْذِرَتُهُمْ ۖ وَلَهُمُ ٱللَّعْنَةُ وَلَهُمْ سُوٓءُ ٱلدَّارِ",
      "english": "The Day their excuse will not benefit the wrongdoers, and they will have the curse, and they will have the worst home.",
      "hausa": "Rãnar da uzurin azzãlumai bã ya amfãninsu, kuma sunã da la'ana, kuma sunã da mũnin gida."
    },
    {
      "ayah": 53,
      "arabic": "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْهُدَىٰ وَأَوْرَثْنَا بَنِىٓ إِسْرَٰٓءِيلَ ٱلْكِتَـٰبَ",
      "english": "And We had certainly given Moses guidance, and We caused the Children of Israel to inherit the Scripture",
      "hausa": "Kuma lalle haƙĩƙa, Mun bai wa Mũsã shiriya, kuma Mun gãdar da Banĩ Isrã'ĩla Littãfi."
    },
    {
      "ayah": 54,
      "arabic": "هُدًى وَذِكْرَىٰ لِأُو۟لِى ٱلْأَلْبَـٰبِ",
      "english": "As guidance and a reminder for those of understanding.",
      "hausa": "Shiryarwa da tunãwa ga ma'abũta hankali."
    },
    {
      "ayah": 55,
      "arabic": "فَٱصْبِرْ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ وَٱسْتَغْفِرْ لِذَنۢبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِٱلْعَشِىِّ وَٱلْإِبْكَـٰرِ",
      "english": "So be patient, [O Muhammad]. Indeed, the promise of Allah is truth. And ask forgiveness for your sin and exalt [Allah] with praise of your Lord in the evening and the morning.",
      "hausa": "Sabõda haka, ka yi haƙuri, lalle wa'adin Allah gaskiya ne. Kuma ka nẽmi gãfara ga zunubinka, kuma ka yi tasbĩhi game da gõde wa Ubangijinka, maraice da kuma wãyẽwar sãfiya."
    },
    {
      "ayah": 56,
      "arabic": "إِنَّ ٱلَّذِينَ يُجَـٰدِلُونَ فِىٓ ءَايَـٰتِ ٱللَّهِ بِغَيْرِ سُلْطَـٰنٍ أَتَىٰهُمْ ۙ إِن فِى صُدُورِهِمْ إِلَّا كِبْرٌ مَّا هُم بِبَـٰلِغِيهِ ۚ فَٱسْتَعِذْ بِٱللَّهِ ۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ",
      "english": "Indeed, those who dispute concerning the signs of Allah without [any] authority having come to them - there is not within their breasts except pride, [the extent of] which they cannot reach. So seek refuge in Allah. Indeed, it is He who is the Hearing, the Seeing.",
      "hausa": "Lalle waɗanda ke jãyayya a cikin ãyõyin Allah, bã game da wani dalĩli wanda ya jẽ musu ba, bãbu kõme a cikin kirãzansu, fãce girman kai, ba su zama mãsu isa ga gũrinsu ba, sabõda haka ka nẽmi tsari daga Allah. Lalle Shĩ, Shĩ ne Mai ji, Mai gani."
    },
    {
      "ayah": 57,
      "arabic": "لَخَلْقُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ أَكْبَرُ مِنْ خَلْقِ ٱلنَّاسِ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
      "english": "The creation of the heavens and earth is greater than the creation of mankind, but most of the people do not know.",
      "hausa": "Lalle halittar sammai da ƙasã, ita ce mafi girma daga halittar mutãne, kuma amma mafi yawan mutãne ba su sani ba."
    },
    {
      "ayah": 58,
      "arabic": "وَمَا يَسْتَوِى ٱلْأَعْمَىٰ وَٱلْبَصِيرُ وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَلَا ٱلْمُسِىٓءُ ۚ قَلِيلًا مَّا تَتَذَكَّرُونَ",
      "english": "And not equal are the blind and the seeing, nor are those who believe and do righteous deeds and the evildoer. Little do you remember.",
      "hausa": "Kuma makãho da mai gani bã su daidaita kuma waɗanda suka yi ĩmãni suka, aikata ayyukan ƙwarai da mai mũnanãwa bã su daidaita. Kaɗan ƙwarai, kuke yin tunãni."
    },
    {
      "ayah": 59,
      "arabic": "إِنَّ ٱلسَّاعَةَ لَـَٔاتِيَةٌ لَّا رَيْبَ فِيهَا وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يُؤْمِنُونَ",
      "english": "Indeed, the Hour is coming - no doubt about it - but most of the people do not believe.",
      "hausa": "Lalle Sa'a, haƙĩƙa mai zuwa ce, bãbu shakka a gare ta, kuma amma mafi yawan mutãne bã su yin ĩmãni."
    },
    {
      "ayah": 60,
      "arabic": "وَقَالَ رَبُّكُمُ ٱدْعُونِىٓ أَسْتَجِبْ لَكُمْ ۚ إِنَّ ٱلَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِى سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ",
      "english": "And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible.",
      "hausa": "Kuma Ubangijinku ya ce: \"Ku kira Ni in karɓa muku. Lalle waɗannan da ke kangara daga barin bauta Mini, za su shiga Jahannama sunã ƙasƙantattu.\""
    },
    {
      "ayah": 61,
      "arabic": "ٱللَّهُ ٱلَّذِى جَعَلَ لَكُمُ ٱلَّيْلَ لِتَسْكُنُوا۟ فِيهِ وَٱلنَّهَارَ مُبْصِرًا ۚ إِنَّ ٱللَّهَ لَذُو فَضْلٍ عَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَشْكُرُونَ",
      "english": "It is Allah who made for you the night that you may rest therein and the day giving sight. Indeed, Allah is full of bounty to the people, but most of the people are not grateful.",
      "hausa": "Allah ne Wanda Ya sanya muku dare dõmin ku natsu a cikinsa, da rãna mai gãnarwa. Lalle Allah, haƙĩƙa, Ma'abũcin falala ne a kan mutãne, kuma amma mafi yawan mutãne bã su gõdẽwa."
    },
    {
      "ayah": 62,
      "arabic": "ذَٰلِكُمُ ٱللَّهُ رَبُّكُمْ خَـٰلِقُ كُلِّ شَىْءٍ لَّآ إِلَـٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُؤْفَكُونَ",
      "english": "That is Allah, your Lord, Creator of all things; there is no deity except Him, so how are you deluded?",
      "hausa": "Wancan shine Allah Ubangijinku, Mahaliccin dukan kõme, bãbu abin bautãwa fãce Shi. To, yãya ake karkatar da ku?"
    },
    {
      "ayah": 63,
      "arabic": "كَذَٰلِكَ يُؤْفَكُ ٱلَّذِينَ كَانُوا۟ بِـَٔايَـٰتِ ٱللَّهِ يَجْحَدُونَ",
      "english": "Thus were those [before you] deluded who were rejecting the signs of Allah.",
      "hausa": "Kamar haka ake karkatar da waɗanda suka kasance sunã jãyayya game da ãyõyin Allah."
    },
    {
      "ayah": 64,
      "arabic": "ٱللَّهُ ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ قَرَارًا وَٱلسَّمَآءَ بِنَآءً وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَـٰتِ ۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمْ ۖ فَتَبَارَكَ ٱللَّهُ رَبُّ ٱلْعَـٰلَمِينَ",
      "english": "It is Allah who made for you the earth a place of settlement and the sky a ceiling and formed you and perfected your forms and provided you with good things. That is Allah, your Lord; then blessed is Allah, Lord of the worlds.",
      "hausa": "Allah ne Ya sanya muku kasã tabbatacciya, da sama ginanniya, kuma Ya sũranta ku, sa'an nan Ya kyautata sũrõrinku,, kuma Ya azurta ku daga abũbuwa mãsu dãɗi. Wancan Shĩne Allah Ubangijinku. To, albarkar Allah Ubangijin halittu tã bayyana."
    },
    {
      "ayah": 65,
      "arabic": "هُوَ ٱلْحَىُّ لَآ إِلَـٰهَ إِلَّا هُوَ فَٱدْعُوهُ مُخْلِصِينَ لَهُ ٱلدِّينَ ۗ ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ",
      "english": "He is the Ever-Living; there is no deity except Him, so call upon Him, [being] sincere to Him in religion. [All] praise is [due] to Allah, Lord of the worlds.",
      "hausa": "Shĩ ne Mai rai, bãbu abin bautãwa fãce Shi. Sabõda haka ku kira Shi, kunã mãsu tsarkake addini a gare Shi. Gõdiya ta tabbata ga Allah Ubangijin halittu."
    },
    {
      "ayah": 66,
      "arabic": "قُلْ إِنِّى نُهِيتُ أَنْ أَعْبُدَ ٱلَّذِينَ تَدْعُونَ مِن دُونِ ٱللَّهِ لَمَّا جَآءَنِىَ ٱلْبَيِّنَـٰتُ مِن رَّبِّى وَأُمِرْتُ أَنْ أُسْلِمَ لِرَبِّ ٱلْعَـٰلَمِينَ",
      "english": "Say, [O Muhammad], \"Indeed, I have been forbidden to worship those you call upon besides Allah once the clear proofs have come to me from my Lord, and I have been commanded to submit to the Lord of the worlds.\"",
      "hausa": "Ka ce: \"Lalle nĩ, an hana ni in bauta wa waɗanda kuke kira waɗansun Allah a lõkacin da hujjõji bayyanannu suka zo mini daga Ubangijina, kuma an umurce ni in sallama ga Ubangijin halittu.\""
    },
    {
      "ayah": 67,
      "arabic": "هُوَ ٱلَّذِى خَلَقَكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ يُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوٓا۟ أَشُدَّكُمْ ثُمَّ لِتَكُونُوا۟ شُيُوخًا ۚ وَمِنكُم مَّن يُتَوَفَّىٰ مِن قَبْلُ ۖ وَلِتَبْلُغُوٓا۟ أَجَلًا مُّسَمًّى وَلَعَلَّكُمْ تَعْقِلُونَ",
      "english": "It is He who created you from dust, then from a sperm-drop, then from a clinging clot; then He brings you out as a child; then [He develops you] that you reach your [time of] maturity, then [further] that you become elders. And among you is he who is taken in death before [that], so that you reach a specified term; and perhaps you will use reason.",
      "hausa": "Shĩ ne Wanda Ya halitta ku daga turɓãya, sa'an nan daga maniyyi, sa'an nan daga sãren jini, sa'an nan Ya fitar da ku kunã jãrĩri, sa'an nan dõmin ku isa ga cikar ƙarfinku sa'an nan dõmin ku kasance tsõfaffi, kuma daga cikinku, akwai wanda ake karɓar ransa a gabãnin haka, kuma dõmin ku isa ga ajali ambatacce, kuma dammãninku ko zã ku hankalta."
    },
    {
      "ayah": 68,
      "arabic": "هُوَ ٱلَّذِى يُحْىِۦ وَيُمِيتُ ۖ فَإِذَا قَضَىٰٓ أَمْرًا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ",
      "english": "He it is who gives life and causes death; and when He decrees a matter, He but says to it, \"Be,\" and it is.",
      "hausa": "Shi ne Wanda ke rayarwa kuma Yana kashewa. To, idan Ya hukunta wani al'amari, to, Yana cewa kawai gare shi, ka kasance sai yana kasancewa (kamar yadda ake bukatar sa.)"
    },
    {
      "ayah": 69,
      "arabic": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ يُجَـٰدِلُونَ فِىٓ ءَايَـٰتِ ٱللَّهِ أَنَّىٰ يُصْرَفُونَ",
      "english": "Do you not consider those who dispute concerning the signs of Allah - how are they averted?",
      "hausa": "Ashe, ba ka gani ba ga waɗanda ke jãyayya a cikin ãyõyin Allah, yadda ake karkatar da su?"
    },
    {
      "ayah": 70,
      "arabic": "ٱلَّذِينَ كَذَّبُوا۟ بِٱلْكِتَـٰبِ وَبِمَآ أَرْسَلْنَا بِهِۦ رُسُلَنَا ۖ فَسَوْفَ يَعْلَمُونَ",
      "english": "Those who deny the Book and that with which We sent Our messengers - they are going to know,",
      "hausa": "Waɗanda suka ƙaryata, game da Littãfin, kuma da abin da Muka aika Manzanninmu da shi. To, za su sani."
    },
    {
      "ayah": 71,
      "arabic": "إِذِ ٱلْأَغْلَـٰلُ فِىٓ أَعْنَـٰقِهِمْ وَٱلسَّلَـٰسِلُ يُسْحَبُونَ",
      "english": "When the shackles are around their necks and the chains; they will be dragged",
      "hausa": "A lõkacin da ƙuƙumma suke a cikin wuyõyinsu, da sarƙõƙi anã jan su."
    },
    {
      "ayah": 72,
      "arabic": "فِى ٱلْحَمِيمِ ثُمَّ فِى ٱلنَّارِ يُسْجَرُونَ",
      "english": "In boiling water; then in the Fire they will be filled [with flame].",
      "hausa": "A cikin ruwan zãfi, sa'an nan a cikin wutã anã babbaka su."
    },
    {
      "ayah": 73,
      "arabic": "ثُمَّ قِيلَ لَهُمْ أَيْنَ مَا كُنتُمْ تُشْرِكُونَ",
      "english": "Then it will be said to them, \"Where is that which you used to associate [with Him in worship]",
      "hausa": "Sa'an nan a ce musu, \"Ina abin da kuka kasance kunã shirki da shi\""
    },
    {
      "ayah": 74,
      "arabic": "مِن دُونِ ٱللَّهِ ۖ قَالُوا۟ ضَلُّوا۟ عَنَّا بَل لَّمْ نَكُن نَّدْعُوا۟ مِن قَبْلُ شَيْـًٔا ۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ ٱلْكَـٰفِرِينَ",
      "english": "Other than Allah?\" They will say, \"They have departed from us; rather, we did not used to invoke previously anything.\" Thus does Allah put astray the disbelievers.",
      "hausa": "\"Wanin Allah?\" Suka ce: \"Sun ɓace mana. Ã'a, ba mu kasance munã kiran kõme ba a gabani.\"Kamar wancan ne Allah Yake ɓatar da kãfirai."
    },
    {
      "ayah": 75,
      "arabic": "ذَٰلِكُم بِمَا كُنتُمْ تَفْرَحُونَ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَبِمَا كُنتُمْ تَمْرَحُونَ",
      "english": "[The angels will say], \"That was because you used to exult upon the earth without right and you used to behave insolently.",
      "hausa": "Wancan dõmin abin da kuka kasance ne kunã farin ciki da shi, a cikin ƙasã, bã da hakki ba, kuma da abin da kuka kasance kunã yi na nishãɗi."
    },
    {
      "ayah": 76,
      "arabic": "ٱدْخُلُوٓا۟ أَبْوَٰبَ جَهَنَّمَ خَـٰلِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى ٱلْمُتَكَبِّرِينَ",
      "english": "Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\"",
      "hausa": "Ku shiga kofõfin Jahannama kunã madawwama a cikinta. To, mazaunin mãsu girman kai yã mũnana."
    },
    {
      "ayah": 77,
      "arabic": "فَٱصْبِرْ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ ۚ فَإِمَّا نُرِيَنَّكَ بَعْضَ ٱلَّذِى نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا يُرْجَعُونَ",
      "english": "So be patient, [O Muhammad]; indeed, the promise of Allah is truth. And whether We show you some of what We have promised them or We take you in death, it is to Us they will be returned.",
      "hausa": "Sabõda haka ka yi haƙuri. Lalle wa'adin Allah gaskiya ne. To, kõ dai lalle Mu nũna maka sãshen abin da Muka yi musu wa'adi da shi kõ kuwa lalle Mu karɓi ranka, to, zuwa gare Mu ake mayar da su."
    },
    {
      "ayah": 78,
      "arabic": "وَلَقَدْ أَرْسَلْنَا رُسُلًا مِّن قَبْلِكَ مِنْهُم مَّن قَصَصْنَا عَلَيْكَ وَمِنْهُم مَّن لَّمْ نَقْصُصْ عَلَيْكَ ۗ وَمَا كَانَ لِرَسُولٍ أَن يَأْتِىَ بِـَٔايَةٍ إِلَّا بِإِذْنِ ٱللَّهِ ۚ فَإِذَا جَآءَ أَمْرُ ٱللَّهِ قُضِىَ بِٱلْحَقِّ وَخَسِرَ هُنَالِكَ ٱلْمُبْطِلُونَ",
      "english": "And We have already sent messengers before you. Among them are those [whose stories] We have related to you, and among them are those [whose stories] We have not related to you. And it was not for any messenger to bring a sign [or verse] except by permission of Allah. So when the command of Allah comes, it will be concluded in truth, and the falsifiers will thereupon lose [all].",
      "hausa": "Kuma lalle haƙĩƙa, Mun aika wasu Manzanni daga gabãninka, daga cikinsu akwai wanda Muka ƙissanta maka lãbãrinsa kuma daga cikinsu akwai wanda ba Mu ƙissanta lãbãrinsa ba a gare ka. Bã ya yiwuwa ga wani Manzo ya jẽ da wata ãyar mu'ujiza fãce da iznin Allah. Sa'an nan idan umurnin Allah ya jẽ, sai a yi hukunci da gaskiya, mãsu ɓãtãwa sun yi hasara a can."
    },
    {
      "ayah": 79,
      "arabic": "ٱللَّهُ ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَنْعَـٰمَ لِتَرْكَبُوا۟ مِنْهَا وَمِنْهَا تَأْكُلُونَ",
      "english": "It is Allah who made for you the grazing animals upon which you ride, and some of them you eat.",
      "hausa": "Allah ne Wanda Ya sanya muku dabbõbi dõmin ku hau daga gare su, kuma daga gare su kuke ci."
    },
    {
      "ayah": 80,
      "arabic": "وَلَكُمْ فِيهَا مَنَـٰفِعُ وَلِتَبْلُغُوا۟ عَلَيْهَا حَاجَةً فِى صُدُورِكُمْ وَعَلَيْهَا وَعَلَى ٱلْفُلْكِ تُحْمَلُونَ",
      "english": "And for you therein are [other] benefits and that you may realize upon them a need which is in your breasts; and upon them and upon ships you are carried.",
      "hausa": "Kuma kunã da abũbuwan amfãni a cikinsu, kuma dõmin ku isar da wata buƙãta, a cikin ƙirãzanku a kansu kuma a kansu da a kan jirãge ake, ɗaukar ku."
    },
    {
      "ayah": 81,
      "arabic": "وَيُرِيكُمْ ءَايَـٰتِهِۦ فَأَىَّ ءَايَـٰتِ ٱللَّهِ تُنكِرُونَ",
      "english": "And He shows you His signs. So which of the signs of Allah do you deny?",
      "hausa": "Kuma Ya nũna muku ayõyinSa. To, wane ãyõyin Allah kuke musu?"
    },
    {
      "ayah": 82,
      "arabic": "أَفَلَمْ يَسِيرُوا۟ فِى ٱلْأَرْضِ فَيَنظُرُوا۟ كَيْفَ كَانَ عَـٰقِبَةُ ٱلَّذِينَ مِن قَبْلِهِمْ ۚ كَانُوٓا۟ أَكْثَرَ مِنْهُمْ وَأَشَدَّ قُوَّةً وَءَاثَارًا فِى ٱلْأَرْضِ فَمَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يَكْسِبُونَ",
      "english": "Have they not traveled through the land and observed how was the end of those before them? They were more numerous than themselves and greater in strength and in impression on the land, but they were not availed by what they used to earn.",
      "hausa": "Ashe fa, ba su yi tafiya a cikin ƙasã ba, dõmin su dũba yadda ãƙibar waɗanda ke a gabãninsu ta kasance? Sun kasance mafi yawa daga gare su. Kuma sun fi tsananin ƙarfi, da (yawan) gurãbun sanã'õ'i a cikin ƙasã. To, abin da suka kasance sunã aikatãwa bai wadãtar da su ba."
    },
    {
      "ayah": 83,
      "arabic": "فَلَمَّا جَآءَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَـٰتِ فَرِحُوا۟ بِمَا عِندَهُم مِّنَ ٱلْعِلْمِ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
      "english": "And when their messengers came to them with clear proofs, they [merely] rejoiced in what they had of knowledge, but they were enveloped by what they used to ridicule.",
      "hausa": "A lõkacin da Manzanninsu suka jẽ musu da hujjõji bayyanannu, suka yi farin ciki da abin da ke wurinsu na ilmi kuma abin da suka kasance sunã yi na izgili da shi ya wajaba a kansu."
    },
    {
      "ayah": 84,
      "arabic": "فَلَمَّا رَأَوْا۟ بَأْسَنَا قَالُوٓا۟ ءَامَنَّا بِٱللَّهِ وَحْدَهُۥ وَكَفَرْنَا بِمَا كُنَّا بِهِۦ مُشْرِكِينَ",
      "english": "And when they saw Our punishment, they said,\" We believe in Allah alone and disbelieve in that which we used to associate with Him.\"",
      "hausa": "Sa'an nan a lõkacin da suka ga azãbarMu, suka ce: \"Mun yi ĩmãni da Allah, Shi kaɗai, kuma mun kãfirta da abin da muka kasance munã shirki da shi.\""
    },
    {
      "ayah": 85,
      "arabic": "فَلَمْ يَكُ يَنفَعُهُمْ إِيمَـٰنُهُمْ لَمَّا رَأَوْا۟ بَأْسَنَا ۖ سُنَّتَ ٱللَّهِ ٱلَّتِى قَدْ خَلَتْ فِى عِبَادِهِۦ ۖ وَخَسِرَ هُنَالِكَ ٱلْكَـٰفِرُونَ",
      "english": "But never did their faith benefit them once they saw Our punishment. [It is] the established way of Allah which has preceded among His servants. And the disbelievers thereupon lost [all].",
      "hausa": "To ĩmaninsu bai kasance yanã amfaninsu ba a lõkacin da suka ga azãbarMu. Hanyar Allah wadda ta gabãta a cikin bãyinSa. Kuma kãfirai sun yi hasãra a can."
    }
  ]
}