{
  "surah": 30,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "الٓمٓ",
      "english": "Alif, Lam, Meem.",
      "hausa": "A. L̃. M̃."
    },
    {
      "ayah": 2,
      "arabic": "غُلِبَتِ ٱلرُّومُ",
      "english": "The Byzantines have been defeated",
      "hausa": "An rinjãyi Rũmawa."
    },
    {
      "ayah": 3,
      "arabic": "فِىٓ أَدْنَى ٱلْأَرْضِ وَهُم مِّنۢ بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ",
      "english": "In the nearest land. But they, after their defeat, will overcome.",
      "hausa": "A cikin mafi kusantar ƙasarsu, kuma sũ, a bãyan rinjãyarsu, zã sn rinjãya."
    },
    {
      "ayah": 4,
      "arabic": "فِى بِضْعِ سِنِينَ ۗ لِلَّهِ ٱلْأَمْرُ مِن قَبْلُ وَمِنۢ بَعْدُ ۚ وَيَوْمَئِذٍ يَفْرَحُ ٱلْمُؤْمِنُونَ",
      "english": "Within three to nine years. To Allah belongs the command before and after. And that day the believers will rejoice",
      "hausa": "A cikin'yan shẽkaru. Al'amari na Allah ne a gabãnin kõme da bãyansa, kuma a rãnar nan mũminai zã su yi farin ciki."
    },
    {
      "ayah": 5,
      "arabic": "بِنَصْرِ ٱللَّهِ ۚ يَنصُرُ مَن يَشَآءُ ۖ وَهُوَ ٱلْعَزِيزُ ٱلرَّحِيمُ",
      "english": "In the victory of Allah. He gives victory to whom He wills, and He is the Exalted in Might, the Merciful.",
      "hausa": "Da taimakon Allah Yanã taimakon wanda Yake so. Kuma Shĩ ne Mabuwãyi, Mai jin ƙai."
    },
    {
      "ayah": 6,
      "arabic": "وَعْدَ ٱللَّهِ ۖ لَا يُخْلِفُ ٱللَّهُ وَعْدَهُۥ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
      "english": "[It is] the promise of Allah. Allah does not fail in His promise, but most of the people do not know.",
      "hausa": "Wa'adin Allah, Allah bã ya sãɓãwa ga wa'adinsa, kuma amma mafi yawan mutãne ba su sani ba."
    },
    {
      "ayah": 7,
      "arabic": "يَعْلَمُونَ ظَـٰهِرًا مِّنَ ٱلْحَيَوٰةِ ٱلدُّنْيَا وَهُمْ عَنِ ٱلْـَٔاخِرَةِ هُمْ غَـٰفِلُونَ",
      "english": "They know what is apparent of the worldly life, but they, of the Hereafter, are unaware.",
      "hausa": "Sunã sanin bayyanannar rãyuwar dũniya, alhãli kuwa sũ shagalallu ne daga rãyuwar Lãhira."
    },
    {
      "ayah": 8,
      "arabic": "أَوَلَمْ يَتَفَكَّرُوا۟ فِىٓ أَنفُسِهِم ۗ مَّا خَلَقَ ٱللَّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ وَمَا بَيْنَهُمَآ إِلَّا بِٱلْحَقِّ وَأَجَلٍ مُّسَمًّى ۗ وَإِنَّ كَثِيرًا مِّنَ ٱلنَّاسِ بِلِقَآئِ رَبِّهِمْ لَكَـٰفِرُونَ",
      "english": "Do they not contemplate within themselves? Allah has not created the heavens and the earth and what is between them except in truth and for a specified term. And indeed, many of the people, in [the matter of] the meeting with their Lord, are disbelievers.",
      "hausa": "Shin, ba su yi tunãni ba a cikin zukãtansu cẽwa Allah bai halitta sammai da ƙasa ba da abin da ke tsakãninsu, fãce da gaskiya da ajali ambatacce? Kuma lalle mãsu yawa daga mutãne kãfirai ne ga gamuwa da Ubangijinsu?"
    },
    {
      "ayah": 9,
      "arabic": "أَوَلَمْ يَسِيرُوا۟ فِى ٱلْأَرْضِ فَيَنظُرُوا۟ كَيْفَ كَانَ عَـٰقِبَةُ ٱلَّذِينَ مِن قَبْلِهِمْ ۚ كَانُوٓا۟ أَشَدَّ مِنْهُمْ قُوَّةً وَأَثَارُوا۟ ٱلْأَرْضَ وَعَمَرُوهَآ أَكْثَرَ مِمَّا عَمَرُوهَا وَجَآءَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَـٰتِ ۖ فَمَا كَانَ ٱللَّهُ لِيَظْلِمَهُمْ وَلَـٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ",
      "english": "Have they not traveled through the earth and observed how was the end of those before them? They were greater than them in power, and they plowed the earth and built it up more than they have built it up, and their messengers came to them with clear evidences. And Allah would not ever have wronged them, but they were wronging themselves.",
      "hausa": "Shin, kuma ba su yi tafiya ba, a cikin ƙasã dõmin su gani yadda aƙibar waɗanda ke a gabãninsu ta kasance? Sun kasance mafiya ƙarfi daga gare su kuma suka nõmi ƙasa suka rãya ta fiye da yadda suka raya ta, kuma manzanninsu suka je musu da hujjoji bayyanannu. Sabo da haka Allah ba Ya yiwuwa Ya zãlunce su, amma kansu suka kasance sunã zãlunta."
    },
    {
      "ayah": 10,
      "arabic": "ثُمَّ كَانَ عَـٰقِبَةَ ٱلَّذِينَ أَسَـٰٓـُٔوا۟ ٱلسُّوٓأَىٰٓ أَن كَذَّبُوا۟ بِـَٔايَـٰتِ ٱللَّهِ وَكَانُوا۟ بِهَا يَسْتَهْزِءُونَ",
      "english": "Then the end of those who did evil was the worst [consequence] because they denied the signs of Allah and used to ridicule them.",
      "hausa": "Sa'an nan ãƙibar waɗannan da suka aikata mũgun aiki ta kasance mafi muni, wãtau sun ƙaryata game da ãyõyin Allah, kuma suka kasance sunã izgili da su."
    },
    {
      "ayah": 11,
      "arabic": "ٱللَّهُ يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
      "english": "Allah begins creation; then He will repeat it; then to Him you will be returned.",
      "hausa": "Allah ne ke fãra yin halitta, sa'an nan Ya sãke ta sa'an nan zuwa gare Shi ake mayar da ku."
    },
    {
      "ayah": 12,
      "arabic": "وَيَوْمَ تَقُومُ ٱلسَّاعَةُ يُبْلِسُ ٱلْمُجْرِمُونَ",
      "english": "And the Day the Hour appears the criminals will be in despair.",
      "hausa": "Kuma a rãnar da sa'a ke tsayuwa, mãsu laifi zã su kãsa magana."
    },
    {
      "ayah": 13,
      "arabic": "وَلَمْ يَكُن لَّهُم مِّن شُرَكَآئِهِمْ شُفَعَـٰٓؤُا۟ وَكَانُوا۟ بِشُرَكَآئِهِمْ كَـٰفِرِينَ",
      "english": "And there will not be for them among their [alleged] partners any intercessors, and they will [then] be disbelievers in their partners.",
      "hausa": "Kuma bã su da mãsu cẽto daga abũbuwan shirkinsu, kuma snn kasance mãsu kãfircẽwadaga abũbuwan shirkinsu."
    },
    {
      "ayah": 14,
      "arabic": "وَيَوْمَ تَقُومُ ٱلسَّاعَةُ يَوْمَئِذٍ يَتَفَرَّقُونَ",
      "english": "And the Day the Hour appears - that Day they will become separated.",
      "hausa": "Kuma a rãnar da Sa'a ke tsayuwa, a rãnar nan mutãne ke farraba."
    },
    {
      "ayah": 15,
      "arabic": "فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَهُمْ فِى رَوْضَةٍ يُحْبَرُونَ",
      "english": "And as for those who had believed and done righteous deeds, they will be in a garden [of Paradise], delighted.",
      "hausa": "To, amma waɗanda suka yi ĩmãni, kuma suka aikata ayyukan ƙwarai to sũ anã faranta musu rãyuka, a cikin wani lambu."
    },
    {
      "ayah": 16,
      "arabic": "وَأَمَّا ٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَـٰتِنَا وَلِقَآئِ ٱلْـَٔاخِرَةِ فَأُو۟لَـٰٓئِكَ فِى ٱلْعَذَابِ مُحْضَرُونَ",
      "english": "But as for those who disbelieved and denied Our verses and the meeting of the Hereafter, those will be brought into the punishment [to remain].",
      "hausa": "Kuma waɗanda suka kãfirta, kuma suka ƙaryata, game da ãyõyinMu da kuma haɗuwa da Rãnar Lãhira, to, waɗancan anã halartar da su a cikin azãba."
    },
    {
      "ayah": 17,
      "arabic": "فَسُبْحَـٰنَ ٱللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ",
      "english": "So exalted is Allah when you reach the evening and when you reach the morning.",
      "hausa": "Sabõda haka tsarkakẽwa ta tabbata ga Allah a lõkacin da kuke shiga maraice, da lõkacin da kuke shiga sãfiya."
    },
    {
      "ayah": 18,
      "arabic": "وَلَهُ ٱلْحَمْدُ فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَعَشِيًّا وَحِينَ تُظْهِرُونَ",
      "english": "And to Him is [due all] praise throughout the heavens and the earth. And [exalted is He] at night and when you are at noon.",
      "hausa": "Kuma Shĩ ne da gõdiya, a cikin sammai da ƙasã kuma da lõkacin yamma da lõkacin zawãli."
    },
    {
      "ayah": 19,
      "arabic": "يُخْرِجُ ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَيُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَىِّ وَيُحْىِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا ۚ وَكَذَٰلِكَ تُخْرَجُونَ",
      "english": "He brings the living out of the dead and brings the dead out of the living and brings to life the earth after its lifelessness. And thus will you be brought out.",
      "hausa": "Yanã fitar da mai rai daga matacce kuma Yanã fitar da matacce daga mai rai, kuma Yanã rãyar da ƙasa a bãyan mutuwarta. Kuma haka ake fitar da ku."
    },
    {
      "ayah": 20,
      "arabic": "وَمِنْ ءَايَـٰتِهِۦٓ أَنْ خَلَقَكُم مِّن تُرَابٍ ثُمَّ إِذَآ أَنتُم بَشَرٌ تَنتَشِرُونَ",
      "english": "And of His signs is that He created you from dust; then, suddenly you were human beings dispersing [throughout the earth].",
      "hausa": "Kuma akwai daga ãyõyinSa, Ya halitta ku daga turɓãya, sai gã ku kun zama mutum, kunã wãtsuwa."
    },
    {
      "ayah": 21,
      "arabic": "وَمِنْ ءَايَـٰتِهِۦٓ أَنْ خَلَقَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَٰجًا لِّتَسْكُنُوٓا۟ إِلَيْهَا وَجَعَلَ بَيْنَكُم مَّوَدَّةً وَرَحْمَةً ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يَتَفَكَّرُونَ",
      "english": "And of His signs is that He created for you from yourselves mates that you may find tranquillity in them; and He placed between you affection and mercy. Indeed in that are signs for a people who give thought.",
      "hausa": "Kuma akwai daga ãyõyinsa, Ya halitta muku mãtan aure daga kanku, dõmin ku natsu zuwa gare ta, kuma Ya sanya sõyayya da rahama a tsakãninku. Lalle a cikin wancan akwai ãyõyi ga mutãne mãsu yin tunãni."
    },
    {
      "ayah": 22,
      "arabic": "وَمِنْ ءَايَـٰتِهِۦ خَلْقُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَـٰفُ أَلْسِنَتِكُمْ وَأَلْوَٰنِكُمْ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّلْعَـٰلِمِينَ",
      "english": "And of His signs is the creation of the heavens and the earth and the diversity of your languages and your colors. Indeed in that are signs for those of knowledge.",
      "hausa": "Kuma akwai daga ãyõyinSa halittar sammai da ƙasã da sãɓã, war harsunanku, da launukanku. Lalle a cikin wannan akwai ãyõyi ga mãsu ilmi."
    },
    {
      "ayah": 23,
      "arabic": "وَمِنْ ءَايَـٰتِهِۦ مَنَامُكُم بِٱلَّيْلِ وَٱلنَّهَارِ وَٱبْتِغَآؤُكُم مِّن فَضْلِهِۦٓ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يَسْمَعُونَ",
      "english": "And of His signs is your sleep by night and day and your seeking of His bounty. Indeed in that are signs for a people who listen.",
      "hausa": "Kuma akwai daga cikin ãyõyinSa, barcinku a cikin dare da rãna, da nẽmanku ga falalarsa. Lalle a cikin wannan akwai ãyõyi ga mutãne mãsu saurãrãwa."
    },
    {
      "ayah": 24,
      "arabic": "وَمِنْ ءَايَـٰتِهِۦ يُرِيكُمُ ٱلْبَرْقَ خَوْفًا وَطَمَعًا وَيُنَزِّلُ مِنَ ٱلسَّمَآءِ مَآءً فَيُحْىِۦ بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَآ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يَعْقِلُونَ",
      "english": "And of His signs is [that] He shows you the lightning [causing] fear and aspiration, and He sends down rain from the sky by which He brings to life the earth after its lifelessness. Indeed in that are signs for a people who use reason.",
      "hausa": "Kuma akwai daga cikin ãyõyinSa, Ya nũna muku walƙiya a kan tsõro da ɗammãni kuma Ya dinga saukar da ruwa daga sama Sa'an nan Ya rãyar da ƙasã game da shi a bãyan mutuwarta. Lalle a cikin wannan akwai ãyõyi ga mutãne mãsu hankaltawa."
    },
    {
      "ayah": 25,
      "arabic": "وَمِنْ ءَايَـٰتِهِۦٓ أَن تَقُومَ ٱلسَّمَآءُ وَٱلْأَرْضُ بِأَمْرِهِۦ ۚ ثُمَّ إِذَا دَعَاكُمْ دَعْوَةً مِّنَ ٱلْأَرْضِ إِذَآ أَنتُمْ تَخْرُجُونَ",
      "english": "And of His signs is that the heaven and earth remain by His command. Then when He calls you with a [single] call from the earth, immediately you will come forth.",
      "hausa": "Kuma akwai daga ãyõyinsa, tsayuwar sama da asƙã bisa umurninsa, sa'an nan idan Ya kira ku, kira ɗaya, daga ƙasã, sai gã ku kunã fita."
    },
    {
      "ayah": 26,
      "arabic": "وَلَهُۥ مَن فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ كُلٌّ لَّهُۥ قَـٰنِتُونَ",
      "english": "And to Him belongs whoever is in the heavens and earth. All are to Him devoutly obedient.",
      "hausa": "Kuma wanda ke cikin sammai da ƙasã Nãsa ne shi kaɗai. Dukansu mãsu tawãli'u ne a gare Shi."
    },
    {
      "ayah": 27,
      "arabic": "وَهُوَ ٱلَّذِى يَبْدَؤُا۟ ٱلْخَلْقَ ثُمَّ يُعِيدُهُۥ وَهُوَ أَهْوَنُ عَلَيْهِ ۚ وَلَهُ ٱلْمَثَلُ ٱلْأَعْلَىٰ فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۚ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "english": "And it is He who begins creation; then He repeats it, and that is [even] easier for Him. To Him belongs the highest attribute in the heavens and earth. And He is the Exalted in Might, the Wise.",
      "hausa": "Kuma Shĩ ne Wanda Ya fãra halitta, sa'an nan Ya sãke ta kuma sakẽwarta tã fi sauƙi a gare shi. Kuma Yanã da misãli wanda ya fi ɗaukaka a cikin sammai da ƙasã kuma Shĩ ne Mabuwãyi, Mai jin ƙai."
    },
    {
      "ayah": 28,
      "arabic": "ضَرَبَ لَكُم مَّثَلًا مِّنْ أَنفُسِكُمْ ۖ هَل لَّكُم مِّن مَّا مَلَكَتْ أَيْمَـٰنُكُم مِّن شُرَكَآءَ فِى مَا رَزَقْنَـٰكُمْ فَأَنتُمْ فِيهِ سَوَآءٌ تَخَافُونَهُمْ كَخِيفَتِكُمْ أَنفُسَكُمْ ۚ كَذَٰلِكَ نُفَصِّلُ ٱلْـَٔايَـٰتِ لِقَوْمٍ يَعْقِلُونَ",
      "english": "He presents to you an example from yourselves. Do you have among those whom your right hands possess any partners in what We have provided for you so that you are equal therein [and] would fear them as your fear of one another [within a partnership]? Thus do We detail the verses for a people who use reason.",
      "hausa": "Ya bũga muku wani misãli daga kanku. Kõ kunã da abõkan tarẽwa, daga cikin bãyin da hannãyenku na dãma suka mallaka, a cikin arzikinku, watau ku zama daidai a ciki kunã tsõron su kamar tSõronku ga kanku? Haka dai Muke bayyana ãyõyi, daki-daki, ga mutãne mãsu hankaltawa."
    },
    {
      "ayah": 29,
      "arabic": "بَلِ ٱتَّبَعَ ٱلَّذِينَ ظَلَمُوٓا۟ أَهْوَآءَهُم بِغَيْرِ عِلْمٍ ۖ فَمَن يَهْدِى مَنْ أَضَلَّ ٱللَّهُ ۖ وَمَا لَهُم مِّن نَّـٰصِرِينَ",
      "english": "But those who wrong follow their [own] desires without knowledge. Then who can guide one whom Allah has sent astray? And for them there are no helpers.",
      "hausa": "Ã'aha! waɗanda suka yi zã1unci sun bi son zũciyõyinsu, bã tãre da wani ilmi ba. To wãne ne zai shiryar da wanda Allah Ya ɓatar, kuma bã su da waɗansu mataimaka?"
    },
    {
      "ayah": 30,
      "arabic": "فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا ۚ فِطْرَتَ ٱللَّهِ ٱلَّتِى فَطَرَ ٱلنَّاسَ عَلَيْهَا ۚ لَا تَبْدِيلَ لِخَلْقِ ٱللَّهِ ۚ ذَٰلِكَ ٱلدِّينُ ٱلْقَيِّمُ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
      "english": "So direct your face toward the religion, inclining to truth. [Adhere to] the fitrah of Allah upon which He has created [all] people. No change should there be in the creation of Allah. That is the correct religion, but most of the people do not know.",
      "hausa": "Sabõda haka, ka tsayar da fuskarka ga addini, kanã mai karkata zuwa ga gaskiya, halittar Allah da Ya halitta mutãne a kanta. Bãbu musanyãwa ga halittar Allah, wannan shĩ ne addini madaidaici kuma amma mafi yawan mutãne ba su sani ba."
    },
    {
      "ayah": 31,
      "arabic": "مُنِيبِينَ إِلَيْهِ وَٱتَّقُوهُ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَلَا تَكُونُوا۟ مِنَ ٱلْمُشْرِكِينَ",
      "english": "[Adhere to it], turning in repentance to Him, and fear Him and establish prayer and do not be of those who associate others with Allah",
      "hausa": "Kunã mãsu mai da al'amari gare Shi, kuma ku bĩ Shi dataƙawa, kuma ku tsayar da salla, kuma kada ku kasance daga mushirikai."
    },
    {
      "ayah": 32,
      "arabic": "مِنَ ٱلَّذِينَ فَرَّقُوا۟ دِينَهُمْ وَكَانُوا۟ شِيَعًا ۖ كُلُّ حِزْبٍۭ بِمَا لَدَيْهِمْ فَرِحُونَ",
      "english": "[Or] of those who have divided their religion and become sects, every faction rejoicing in what it has.",
      "hausa": "Wãtau waɗanda suka rarrabe addininsu kuma suka kasance ƙungiya-ƙungiya, kõwace ƙungiya tanã mai farin ciki da abin da ke a gare ta kawai."
    },
    {
      "ayah": 33,
      "arabic": "وَإِذَا مَسَّ ٱلنَّاسَ ضُرٌّ دَعَوْا۟ رَبَّهُم مُّنِيبِينَ إِلَيْهِ ثُمَّ إِذَآ أَذَاقَهُم مِّنْهُ رَحْمَةً إِذَا فَرِيقٌ مِّنْهُم بِرَبِّهِمْ يُشْرِكُونَ",
      "english": "And when adversity touches the people, they call upon their Lord, turning in repentance to Him. Then when He lets them taste mercy from Him, at once a party of them associate others with their Lord,",
      "hausa": "Kuma idan cũta ta shãfi mutãne, sai su kirãyi Ubangijinsu, sunã mãsu mai da al'amari gare Shi, sa'an nan idan Ya ɗanɗana musu wata rahama daga gare Shi, sai gã wani ɓangare daga gare su sunã shirki da Ubangijinsu."
    },
    {
      "ayah": 34,
      "arabic": "لِيَكْفُرُوا۟ بِمَآ ءَاتَيْنَـٰهُمْ ۚ فَتَمَتَّعُوا۟ فَسَوْفَ تَعْلَمُونَ",
      "english": "So that they will deny what We have granted them. Then enjoy yourselves, for you are going to know.",
      "hausa": "Dõmin su kãfirta dl abin da Muka bã su. To ku ji dãɗi kaɗan Sa'an nan zã ku, sani."
    },
    {
      "ayah": 35,
      "arabic": "أَمْ أَنزَلْنَا عَلَيْهِمْ سُلْطَـٰنًا فَهُوَ يَتَكَلَّمُ بِمَا كَانُوا۟ بِهِۦ يُشْرِكُونَ",
      "english": "Or have We sent down to them an authority, and it speaks of what they were associating with Him?",
      "hausa": "Kõ Mun saukar da wani dalĩ li a gare su? Shi kuwa yanã magana da abin da suka kasance sunã shirkin da shi?"
    },
    {
      "ayah": 36,
      "arabic": "وَإِذَآ أَذَقْنَا ٱلنَّاسَ رَحْمَةً فَرِحُوا۟ بِهَا ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌۢ بِمَا قَدَّمَتْ أَيْدِيهِمْ إِذَا هُمْ يَقْنَطُونَ",
      "english": "And when We let the people taste mercy, they rejoice therein, but if evil afflicts them for what their hands have put forth, immediately they despair.",
      "hausa": "Kuma idan Muka ɗanɗana wa mutãne wata rahama, sai su yi farin ciki da ita kuma idan cũta ta sãme su, sabõda abin da hannayensu suka gabãtar, sai gã su sunã yanke ƙauna,"
    },
    {
      "ayah": 37,
      "arabic": "أَوَلَمْ يَرَوْا۟ أَنَّ ٱللَّهَ يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يُؤْمِنُونَ",
      "english": "Do they not see that Allah extends provision for whom He wills and restricts [it]? Indeed, in that are signs for a people who believe.",
      "hausa": "Shin, kuma ba su gani ba cẽwa Allah na shimfida arziki ga wanda Yake so kuma Yanã ƙuntatãwa? Lalle a cikin wancan akwai ãyõyi ga mutãne mãsu yin ĩmãni."
    },
    {
      "ayah": 38,
      "arabic": "فَـَٔاتِ ذَا ٱلْقُرْبَىٰ حَقَّهُۥ وَٱلْمِسْكِينَ وَٱبْنَ ٱلسَّبِيلِ ۚ ذَٰلِكَ خَيْرٌ لِّلَّذِينَ يُرِيدُونَ وَجْهَ ٱللَّهِ ۖ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
      "english": "So give the relative his right, as well as the needy and the traveler. That is best for those who desire the countenance of Allah, and it is they who will be the successful.",
      "hausa": "Sabõda haka ka bai wa zumu hakkinsa da miskĩnai da ɗan hanya, wannan shĩ ne alhẽri ga waɗanda ke nufin yardar Allah kuma waɗancan sũ ne mãsu sãmun babban rabo."
    },
    {
      "ayah": 39,
      "arabic": "وَمَآ ءَاتَيْتُم مِّن رِّبًا لِّيَرْبُوَا۟ فِىٓ أَمْوَٰلِ ٱلنَّاسِ فَلَا يَرْبُوا۟ عِندَ ٱللَّهِ ۖ وَمَآ ءَاتَيْتُم مِّن زَكَوٰةٍ تُرِيدُونَ وَجْهَ ٱللَّهِ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُضْعِفُونَ",
      "english": "And whatever you give for interest to increase within the wealth of people will not increase with Allah. But what you give in zakah, desiring the countenance of Allah - those are the multipliers.",
      "hausa": "Kuma abin da kuka bãyar na riba dõmin ya ƙãru a cikin dũkiyar mutãne to, bã zai ƙãru ba, a wurin Allah. Kuma abin da kuka bãyar na zakka, kanã nufin yardar Allah to (mãsu yin haka) waɗancan sũ ne mãsu ninkãwa (ga dũkiyarsu)."
    },
    {
      "ayah": 40,
      "arabic": "ٱللَّهُ ٱلَّذِى خَلَقَكُمْ ثُمَّ رَزَقَكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ۖ هَلْ مِن شُرَكَآئِكُم مَّن يَفْعَلُ مِن ذَٰلِكُم مِّن شَىْءٍ ۚ سُبْحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا يُشْرِكُونَ",
      "english": "Allah is the one who created you, then provided for you, then will cause you to die, and then will give you life. Are there any of your \"partners\" who does anything of that? Exalted is He and high above what they associate with Him.",
      "hausa": "Allah ne Wanda Ya halitta ku, sa'an nan Ya azurta ku, sa'an nan Ya matar da ku, sa'an nan Ya rãyar da ku. Ashe, daga cikin abũbuwan shirkinku akwai wanda ke aikata wani abu daga waɗannan ahũbuwa? Tsarki ya tabbata ga Allah, kuma Ya ɗaukaka bisa ga abin da suke yi na shirki."
    },
    {
      "ayah": 41,
      "arabic": "ظَهَرَ ٱلْفَسَادُ فِى ٱلْبَرِّ وَٱلْبَحْرِ بِمَا كَسَبَتْ أَيْدِى ٱلنَّاسِ لِيُذِيقَهُم بَعْضَ ٱلَّذِى عَمِلُوا۟ لَعَلَّهُمْ يَرْجِعُونَ",
      "english": "Corruption has appeared throughout the land and sea by [reason of] what the hands of people have earned so He may let them taste part of [the consequence of] what they have done that perhaps they will return [to righteousness].",
      "hausa": "¥arnã tã bayyana a cikin ƙasa da tẽku, sabõda abin da hannãyen mutãne suka aikata. Dõmin Allah Ya ɗanɗana musu sãshin abin da suka aikata, ɗammãninsu zã su kõmo."
    },
    {
      "ayah": 42,
      "arabic": "قُلْ سِيرُوا۟ فِى ٱلْأَرْضِ فَٱنظُرُوا۟ كَيْفَ كَانَ عَـٰقِبَةُ ٱلَّذِينَ مِن قَبْلُ ۚ كَانَ أَكْثَرُهُم مُّشْرِكِينَ",
      "english": "Say, [O Muhammad], \"Travel through the land and observe how was the end of those before. Most of them were associators [of others with Allah].",
      "hausa": "Ka ce: \"Ku tafi a cikin ƙasã sa'an nan ku dũbi yadda ãƙibar waɗanda suka kasance a gabãninku ta kasance. Mafi yawansu sun kasance mãsu yin shirki.\""
    },
    {
      "ayah": 43,
      "arabic": "فَأَقِمْ وَجْهَكَ لِلدِّينِ ٱلْقَيِّمِ مِن قَبْلِ أَن يَأْتِىَ يَوْمٌ لَّا مَرَدَّ لَهُۥ مِنَ ٱللَّهِ ۖ يَوْمَئِذٍ يَصَّدَّعُونَ",
      "english": "So direct your face toward the correct religion before a Day comes from Allah of which there is no repelling. That Day, they will be divided.",
      "hausa": "Sabõda haka, ka tsayar da fuskarka ga addini madaidaici a gabãnin wani yini ya zo, bãbu makawa gare Shi daga Allah, a rãnar nan mutãne sunã tsãgẽwa (su rabu biyu)."
    },
    {
      "ayah": 44,
      "arabic": "مَن كَفَرَ فَعَلَيْهِ كُفْرُهُۥ ۖ وَمَنْ عَمِلَ صَـٰلِحًا فَلِأَنفُسِهِمْ يَمْهَدُونَ",
      "english": "Whoever disbelieves - upon him is [the consequence of] his disbelief. And whoever does righteousness - they are for themselves preparing,",
      "hausa": "Wanda ya kãfirta, to, kãfircinsa na kansa, kuma wanda ya aikata aikin ƙwarai, to, sabõda kansu suke yin shimfiɗa."
    },
    {
      "ayah": 45,
      "arabic": "لِيَجْزِىَ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِن فَضْلِهِۦٓ ۚ إِنَّهُۥ لَا يُحِبُّ ٱلْكَـٰفِرِينَ",
      "english": "That He may reward those who have believed and done righteous deeds out of His bounty. Indeed, He does not like the disbelievers.",
      "hausa": "Dõmin Ya sãkã wa waɗanda suka yi ĩmãni, kuma suka aikata ayyukan ƙwarai, daga falalarSa. Lalle Allah bã Ya son kafirai."
    },
    {
      "ayah": 46,
      "arabic": "وَمِنْ ءَايَـٰتِهِۦٓ أَن يُرْسِلَ ٱلرِّيَاحَ مُبَشِّرَٰتٍ وَلِيُذِيقَكُم مِّن رَّحْمَتِهِۦ وَلِتَجْرِىَ ٱلْفُلْكُ بِأَمْرِهِۦ وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "english": "And of His signs is that He sends the winds as bringers of good tidings and to let you taste His mercy and so the ships may sail at His command and so you may seek of His bounty, and perhaps you will be grateful.",
      "hausa": "Kuma akwai daga ãyõyinSa, ya aika iskõki mãsu bãyar da bushãra kuma dõmin Ya ɗanɗana muku daga rahamarSa, kuma dõmin jirãgen ruwa su gudãna da umurninSa, kuma dõmin ku nẽma daga falalarSa, fãtanku zã ku gode."
    },
    {
      "ayah": 47,
      "arabic": "وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ رُسُلًا إِلَىٰ قَوْمِهِمْ فَجَآءُوهُم بِٱلْبَيِّنَـٰتِ فَٱنتَقَمْنَا مِنَ ٱلَّذِينَ أَجْرَمُوا۟ ۖ وَكَانَ حَقًّا عَلَيْنَا نَصْرُ ٱلْمُؤْمِنِينَ",
      "english": "And We have already sent messengers before you to their peoples, and they came to them with clear evidences; then We took retribution from those who committed crimes, and incumbent upon Us was support of the believers.",
      "hausa": "Kuma lalle Mun aiki waɗansu Manzanni a gabãninka, zuwa ga mutãnensu sai suka je musu da hujjõji, bayyanannu, sa'an nan Muka azabtar da waɗanda suka yi laifi, kuma ya kasance tabbatacce taimakon mũminai wajibi ne a kan mu."
    },
    {
      "ayah": 48,
      "arabic": "ٱللَّهُ ٱلَّذِى يُرْسِلُ ٱلرِّيَـٰحَ فَتُثِيرُ سَحَابًا فَيَبْسُطُهُۥ فِى ٱلسَّمَآءِ كَيْفَ يَشَآءُ وَيَجْعَلُهُۥ كِسَفًا فَتَرَى ٱلْوَدْقَ يَخْرُجُ مِنْ خِلَـٰلِهِۦ ۖ فَإِذَآ أَصَابَ بِهِۦ مَن يَشَآءُ مِنْ عِبَادِهِۦٓ إِذَا هُمْ يَسْتَبْشِرُونَ",
      "english": "It is Allah who sends the winds, and they stir the clouds and spread them in the sky however He wills, and He makes them fragments so you see the rain emerge from within them. And when He causes it to fall upon whom He wills of His servants, immediately they rejoice",
      "hausa": "Allah ne Wanda ke aika iskõki, sai su mõtsar da girgije, sa'an nan Ya shimfiɗa shi a cikin sama yadda Yake so, kuma Ya sanya shi wani ɓaɓɓake, sa'an nan ka ga ruwa na fita daga tsakãninsa. Sa'an nan idan Allah Ya sãmi waɗanda Ya so daga bãyinsa, Sai gã su suna bushãra da shi."
    },
    {
      "ayah": 49,
      "arabic": "وَإِن كَانُوا۟ مِن قَبْلِ أَن يُنَزَّلَ عَلَيْهِم مِّن قَبْلِهِۦ لَمُبْلِسِينَ",
      "english": "Although they were, before it was sent down upon them - before that, in despair.",
      "hausa": "Kuma kõ da sun kasance a gabãnin a saukar da shi a kansu, kusa-kusa, sunã baƙin ciki hai bã su iya magana."
    },
    {
      "ayah": 50,
      "arabic": "فَٱنظُرْ إِلَىٰٓ ءَاثَـٰرِ رَحْمَتِ ٱللَّهِ كَيْفَ يُحْىِ ٱلْأَرْضَ بَعْدَ مَوْتِهَآ ۚ إِنَّ ذَٰلِكَ لَمُحْىِ ٱلْمَوْتَىٰ ۖ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
      "english": "So observe the effects of the mercy of Allah - how He gives life to the earth after its lifelessness. Indeed, that [same one] will give life to the dead, and He is over all things competent.",
      "hausa": "Sai ka dũbi alãmõmin rahamar Allah yadda Yake rãyar da ƙasã a bãyan mutuwarta. Lalle wannan (Mai wannan aiki), tabbas, Mai rãyar da halitta ne, kuma Shi Mai ikon yi ne a kan kõme."
    },
    {
      "ayah": 51,
      "arabic": "وَلَئِنْ أَرْسَلْنَا رِيحًا فَرَأَوْهُ مُصْفَرًّا لَّظَلُّوا۟ مِنۢ بَعْدِهِۦ يَكْفُرُونَ",
      "english": "But if We should send a [bad] wind and they saw [their crops] turned yellow, they would remain thereafter disbelievers.",
      "hausa": "Kuma lalle idan Mun aika wata iska, suka ganta fatsifatsi, lalle zã su yini a bãyansa sunã kãfirta."
    },
    {
      "ayah": 52,
      "arabic": "فَإِنَّكَ لَا تُسْمِعُ ٱلْمَوْتَىٰ وَلَا تُسْمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوْا۟ مُدْبِرِينَ",
      "english": "So indeed, you will not make the dead hear, nor will you make the deaf hear the call when they turn their backs, retreating.",
      "hausa": "Sabõda haka, kai, bã ka jiyar da matattu kira, kuma bã ka jiyar da kurãme kira idan sun jũya bãya sunã gudu."
    },
    {
      "ayah": 53,
      "arabic": "وَمَآ أَنتَ بِهَـٰدِ ٱلْعُمْىِ عَن ضَلَـٰلَتِهِمْ ۖ إِن تُسْمِعُ إِلَّا مَن يُؤْمِنُ بِـَٔايَـٰتِنَا فَهُم مُّسْلِمُونَ",
      "english": "And you cannot guide the blind away from their error. You will only make hear those who believe in Our verses so they are Muslims [in submission to Allah].",
      "hausa": "Kuma ba ka zamo mai shiryar da makãfi ba daga ɓatarsu, bã ka jiyarwa fãce wanda ke yin ĩmãni da ãyõyinMu, watau sũ ne mãsu mĩƙa wuya, su sallama."
    },
    {
      "ayah": 54,
      "arabic": "ٱللَّهُ ٱلَّذِى خَلَقَكُم مِّن ضَعْفٍ ثُمَّ جَعَلَ مِنۢ بَعْدِ ضَعْفٍ قُوَّةً ثُمَّ جَعَلَ مِنۢ بَعْدِ قُوَّةٍ ضَعْفًا وَشَيْبَةً ۚ يَخْلُقُ مَا يَشَآءُ ۖ وَهُوَ ٱلْعَلِيمُ ٱلْقَدِيرُ",
      "english": "Allah is the one who created you from weakness, then made after weakness strength, then made after strength weakness and white hair. He creates what He wills, and He is the Knowing, the Competent.",
      "hausa": "Allah ne Ya halitta ku daga rauni, sa'an nan Ya sanya wani ƙarfi a bayan wani rauni, sa'an nan Ya sanya wani rauni da furfura a bãyan wani ƙarfi, Allah na halitta abin da Ya so, kuma Shĩ ne Mai ilmi, Mai ĩkon yi,"
    },
    {
      "ayah": 55,
      "arabic": "وَيَوْمَ تَقُومُ ٱلسَّاعَةُ يُقْسِمُ ٱلْمُجْرِمُونَ مَا لَبِثُوا۟ غَيْرَ سَاعَةٍ ۚ كَذَٰلِكَ كَانُوا۟ يُؤْفَكُونَ",
      "english": "And the Day the Hour appears the criminals will swear they had remained but an hour. Thus they were deluded.",
      "hausa": "Kuma a rãnar da Sa'a ke tsayuwa, mãsu laifi na rantsuwã: Ba su zauna a cikin kabari ba fãce sã'a guda. Kamar haka suka kasance anã karkatar da su."
    },
    {
      "ayah": 56,
      "arabic": "وَقَالَ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ وَٱلْإِيمَـٰنَ لَقَدْ لَبِثْتُمْ فِى كِتَـٰبِ ٱللَّهِ إِلَىٰ يَوْمِ ٱلْبَعْثِ ۖ فَهَـٰذَا يَوْمُ ٱلْبَعْثِ وَلَـٰكِنَّكُمْ كُنتُمْ لَا تَعْلَمُونَ",
      "english": "But those who were given knowledge and faith will say, \"You remained the extent of Allah 's decree until the Day of Resurrection, and this is the Day of Resurrection, but you did not used to know.\"",
      "hausa": "Kuma waɗanda aka bai wa ilmi da ĩmãni suka ce: \"Lalle, haƙĩƙa kun zauna a cikin Littãfin Allah, har zuwa rãnar tãyarwa, to, kuma wannan ita ce rãnar tãyarwar, kuma amma kũ, kun kasance ba ku sani ba.\""
    },
    {
      "ayah": 57,
      "arabic": "فَيَوْمَئِذٍ لَّا يَنفَعُ ٱلَّذِينَ ظَلَمُوا۟ مَعْذِرَتُهُمْ وَلَا هُمْ يُسْتَعْتَبُونَ",
      "english": "So that Day, their excuse will not benefit those who wronged, nor will they be asked to appease [Allah].",
      "hausa": "To, a rãnar da uzurin waɗanda suka yi zãlunci bã ya amfaninsu, kuma bã a neman yardarsu."
    },
    {
      "ayah": 58,
      "arabic": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِى هَـٰذَا ٱلْقُرْءَانِ مِن كُلِّ مَثَلٍ ۚ وَلَئِن جِئْتَهُم بِـَٔايَةٍ لَّيَقُولَنَّ ٱلَّذِينَ كَفَرُوٓا۟ إِنْ أَنتُمْ إِلَّا مُبْطِلُونَ",
      "english": "And We have certainly presented to the people in this Qur'an from every [kind of] example. But, [O Muhammad], if you should bring them a sign, the disbelievers will surely say, \"You [believers] are but falsifiers.\"",
      "hausa": "Kuma lalle tabbas Mun buga kõwane irin misãli ga mutãne a cikin wannan Alƙur'ãni, kuma lalle idan kã je musu da kõwace ãyã, lalle, waɗanda suka kãfirta zã su ce \"Kũ, bã kõme kuke ba fãce mãsu barua.\""
    },
    {
      "ayah": 59,
      "arabic": "كَذَٰلِكَ يَطْبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلَّذِينَ لَا يَعْلَمُونَ",
      "english": "Thus does Allah seal the hearts of those who do not know.",
      "hausa": "Kamar haka Allah Yake shãfe haske a kan zukãtan waɗanda ba su sani ba."
    },
    {
      "ayah": 60,
      "arabic": "فَٱصْبِرْ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ ۖ وَلَا يَسْتَخِفَّنَّكَ ٱلَّذِينَ لَا يُوقِنُونَ",
      "english": "So be patient. Indeed, the promise of Allah is truth. And let them not disquiet you who are not certain [in faith].",
      "hausa": "Sabõda haka ka yi haƙuri lalle wa'adin Allah gaskiya ne, kuma kada waɗanda bã su da yaƙĩni su sassabce maka hankali."
    }
  ]
}