{
  "surah": 14,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "الٓر ۚ كِتَـٰبٌ أَنزَلْنَـٰهُ إِلَيْكَ لِتُخْرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ بِإِذْنِ رَبِّهِمْ إِلَىٰ صِرَٰطِ ٱلْعَزِيزِ ٱلْحَمِيدِ",
      "english": "Alif, Lam, Ra. [This is] a Book which We have revealed to you, [O Muhammad], that you might bring mankind out of darknesses into the light by permission of their Lord - to the path of the Exalted in Might, the Praiseworthy -",
      "hausa": "A. L̃.R. Littãfi ne mun saukar da shi zuwa gare ka dõmin ka fitar da mutãne daga duhunhuna zuwa ga haske, da iznin Ubangijinsu, zuwa ga tafarkin Mabuwãyi, Abin gõdẽwa."
    },
    {
      "ayah": 2,
      "arabic": "ٱللَّهِ ٱلَّذِى لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ وَوَيْلٌ لِّلْكَـٰفِرِينَ مِنْ عَذَابٍ شَدِيدٍ",
      "english": "Allah, to whom belongs whatever is in the heavens and whatever is on the earth. And woe to the disbelievers from a severe punishment",
      "hausa": "Allah wanda Yake Yanã da abin da ke cikin sammai da cikin ƙasa. Kuma bone yã tabbata ga kãfirai daga azãba mai tsanani."
    },
    {
      "ayah": 3,
      "arabic": "ٱلَّذِينَ يَسْتَحِبُّونَ ٱلْحَيَوٰةَ ٱلدُّنْيَا عَلَى ٱلْـَٔاخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبْغُونَهَا عِوَجًا ۚ أُو۟لَـٰٓئِكَ فِى ضَلَـٰلٍۭ بَعِيدٍ",
      "english": "The ones who prefer the worldly life over the Hereafter and avert [people] from the way of Allah, seeking to make it (seem) deviant. Those are in extreme error.",
      "hausa": "Waɗanda suka fi son rãyuwar dũniya fiye da ta Lãhira, kuma sunã kangẽwa daga hanyar Allah, kuma sunã nẽman ta karkace. Waɗancan na a cikin ɓata mai nĩsa."
    },
    {
      "ayah": 4,
      "arabic": "وَمَآ أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِۦ لِيُبَيِّنَ لَهُمْ ۖ فَيُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهْدِى مَن يَشَآءُ ۚ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "english": "And We did not send any messenger except [speaking] in the language of his people to state clearly for them, and Allah sends astray [thereby] whom He wills and guides whom He wills. And He is the Exalted in Might, the Wise.",
      "hausa": "Kuma ba Mu aika wani Manzo ba fãce da harshen mutãnensa dõmin ya bayyanã musu. Sa'an nan Allah Ya ɓatar da wanda Yake so kuma Ya shiryar da wanda Yake so, Kuma shĩ ne Mabuwãyi, Mai hikima."
    },
    {
      "ayah": 5,
      "arabic": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِـَٔايَـٰتِنَآ أَنْ أَخْرِجْ قَوْمَكَ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ وَذَكِّرْهُم بِأَيَّىٰمِ ٱللَّهِ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ",
      "english": "And We certainly sent Moses with Our signs, [saying], \"Bring out your people from darknesses into the light and remind them of the days of Allah.\" Indeed in that are signs for everyone patient and grateful.",
      "hausa": "Kuma lalle ne haƙĩƙa Mun aika Mũsã game, da ãyõin Mu cẽwa, \"Ka fitar da mutãnenkadaga duhu zuwa ga haske. Kuma ka tunar musu da kwãnukan (masĩfun) Allah.\" Lalle ne a cikin wancan akwai ãyõyi dõmin dukan mai yawan haƙuri, mai gõdiya."
    },
    {
      "ayah": 6,
      "arabic": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ ٱذْكُرُوا۟ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ أَنجَىٰكُم مِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ سُوٓءَ ٱلْعَذَابِ وَيُذَبِّحُونَ أَبْنَآءَكُمْ وَيَسْتَحْيُونَ نِسَآءَكُمْ ۚ وَفِى ذَٰلِكُم بَلَآءٌ مِّن رَّبِّكُمْ عَظِيمٌ",
      "english": "And [recall, O Children of Israel], when Moses said to His people, \"Remember the favor of Allah upon you when He saved you from the people of Pharaoh, who were afflicting you with the worst torment and were slaughtering your [newborn] sons and keeping your females alive. And in that was a great trial from your Lord.",
      "hausa": "Kuma a lõkacin da Mũsã yace wa mutãnensa, \"Ku tuna ni'imar Allah a kanku a lõkacin da Ya tsĩrar da ku daga mutãnen Fir'auna, sunã yi muku mummunar azãba, kuma sunã yanyanka ɗiyanku, kuma sunã rãyar da mãtanku. Kuma a cikin wancan akwai jarrabãwa mai girmã daga Ubangijinku.\""
    },
    {
      "ayah": 7,
      "arabic": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِى لَشَدِيدٌ",
      "english": "And [remember] when your Lord proclaimed, 'If you are grateful, I will surely increase you [in favor]; but if you deny, indeed, My punishment is severe.' \"",
      "hausa": "Kuma a lõkacin da Ubangijinku Ya sanar, \"Lalle ne idan kun gõde, haƙĩƙa, Inã ƙãramuku, kuma lalle ne idan kun kãfirta haƙĩƙa azãbãta, tabbas, mai tsanani ce.\""
    },
    {
      "ayah": 8,
      "arabic": "وَقَالَ مُوسَىٰٓ إِن تَكْفُرُوٓا۟ أَنتُمْ وَمَن فِى ٱلْأَرْضِ جَمِيعًا فَإِنَّ ٱللَّهَ لَغَنِىٌّ حَمِيدٌ",
      "english": "And Moses said, \"If you should disbelieve, you and whoever is on the earth entirely - indeed, Allah is Free of need and Praiseworthy.\"",
      "hausa": "Kuma Mũsã ya ce: \"Idan kun kãfirta kũ da waɗanda suke a cikin ƙasa, gabã ɗaya, to, lalle ne Allah haƙĩƙa Mawadãci ne, Mai yawan gõdiya.\""
    },
    {
      "ayah": 9,
      "arabic": "أَلَمْ يَأْتِكُمْ نَبَؤُا۟ ٱلَّذِينَ مِن قَبْلِكُمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ ۛ وَٱلَّذِينَ مِنۢ بَعْدِهِمْ ۛ لَا يَعْلَمُهُمْ إِلَّا ٱللَّهُ ۚ جَآءَتْهُمْ رُسُلُهُم بِٱلْبَيِّنَـٰتِ فَرَدُّوٓا۟ أَيْدِيَهُمْ فِىٓ أَفْوَٰهِهِمْ وَقَالُوٓا۟ إِنَّا كَفَرْنَا بِمَآ أُرْسِلْتُم بِهِۦ وَإِنَّا لَفِى شَكٍّ مِّمَّا تَدْعُونَنَآ إِلَيْهِ مُرِيبٍ",
      "english": "Has there not reached you the news of those before you - the people of Noah and 'Aad and Thamud and those after them? No one knows them but Allah. Their messengers brought them clear proofs, but they returned their hands to their mouths and said, \"Indeed, we disbelieve in that with which you have been sent, and indeed we are, about that to which you invite us, in disquieting doubt.\"",
      "hausa": "Shin lãbãrin waɗanda suke a gabãninku, mutãnen Nũhu da Ãdãwa da Samũdawa bai zomuku ba? Kuma da waɗanda suke daga bãyansu bãbu wanda yake sanin su fãce Allah? Manzanninsu sun jẽ musu da hujjõji mabayyana, sai suka mayar da hannayensu a cikin bãkunansu, kuma suka ce: \"Lalle ne mũ, mun kãfirta da abinda aka aiko ku da shi. Kuma lalle ne mũ haƙĩƙa munã a cikin shakkada abin do kuke kiran mu zuwa gare shi, mai sanya kõkanto.\""
    },
    {
      "ayah": 10,
      "arabic": "قَالَتْ رُسُلُهُمْ أَفِى ٱللَّهِ شَكٌّ فَاطِرِ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ يَدْعُوكُمْ لِيَغْفِرَ لَكُم مِّن ذُنُوبِكُمْ وَيُؤَخِّرَكُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۚ قَالُوٓا۟ إِنْ أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا تُرِيدُونَ أَن تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ ءَابَآؤُنَا فَأْتُونَا بِسُلْطَـٰنٍ مُّبِينٍ",
      "english": "Their messengers said, \"Can there be doubt about Allah, Creator of the heavens and earth? He invites you that He may forgive you of your sins, and He delays your death for a specified term.\" They said, \"You are not but men like us who wish to avert us from what our fathers were worshipping. So bring us a clear authority.\"",
      "hausa": "Manzanninsu suka ce \"Ashe, akwai shakka a cikin (sha'anin) Allah, Mai ƙãga halittar sammai da ƙasa Yanã kiran ku dõmin Ya gãfarta muku zunubanku, kuma Ya jinkirtã muku zuwa ga ajali ambatacce?\" Suka ce: \"Ba ku zama ba fãce mutãne misãlinmu kuma nufinku ku kange mu daga abin da iyãyenmu suka kasance sunã bautãwa sai ku zo mana da dalĩli mabayyani.\""
    },
    {
      "ayah": 11,
      "arabic": "قَالَتْ لَهُمْ رُسُلُهُمْ إِن نَّحْنُ إِلَّا بَشَرٌ مِّثْلُكُمْ وَلَـٰكِنَّ ٱللَّهَ يَمُنُّ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۖ وَمَا كَانَ لَنَآ أَن نَّأْتِيَكُم بِسُلْطَـٰنٍ إِلَّا بِإِذْنِ ٱللَّهِ ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
      "english": "Their messengers said to them, \"We are only men like you, but Allah confers favor upon whom He wills of His servants. It has never been for us to bring you evidence except by permission of Allah. And upon Allah let the believers rely.",
      "hausa": "Manzanninsu suka ce musu, \"Bã mu zama ba fãce mutãne misã, linku, kuma amma Allah Yanã yin falala a kan wanda Yake so daga bãyinsa, kuma bã ya kasancẽwa a gare mu, mu zo muku da wani dalĩli fãce da iznin Allah. Kuma ga Allah sai mũminai su dõgara."
    },
    {
      "ayah": 12,
      "arabic": "وَمَا لَنَآ أَلَّا نَتَوَكَّلَ عَلَى ٱللَّهِ وَقَدْ هَدَىٰنَا سُبُلَنَا ۚ وَلَنَصْبِرَنَّ عَلَىٰ مَآ ءَاذَيْتُمُونَا ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُتَوَكِّلُونَ",
      "english": "And why should we not rely upon Allah while He has guided us to our [good] ways. And we will surely be patient against whatever harm you should cause us. And upon Allah let those who would rely [indeed] rely.\"",
      "hausa": "\"Kuma mẽne ne a gare mu, bã zã mu dõgara ga Allah ba, alhãli kuwa haƙĩƙa Yã shiryar da mu ga hanyõyinmu? Kuma lalle ne munã yin haƙuri a kan abin da kuka cũtar da mu, kuma ga Allah sai mãsu dõgaro su dõgara.\""
    },
    {
      "ayah": 13,
      "arabic": "وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لِرُسُلِهِمْ لَنُخْرِجَنَّكُم مِّنْ أَرْضِنَآ أَوْ لَتَعُودُنَّ فِى مِلَّتِنَا ۖ فَأَوْحَىٰٓ إِلَيْهِمْ رَبُّهُمْ لَنُهْلِكَنَّ ٱلظَّـٰلِمِينَ",
      "english": "And those who disbelieved said to their messengers, \"We will surely drive you out of our land, or you must return to our religion.\" So their Lord inspired to them, \"We will surely destroy the wrongdoers.",
      "hausa": "Kuma waɗanda suka kãfirta suka ce wa Manzanninsu, \"Lalle ne munã fitar da ku daga ƙasarmu, kõ kuwa haƙĩƙa, kunã kõmowã acikin addininmu.\" Sai Ubangijinsu Ya yi wahayi zuwa gare su, \"Lalle ne, Munã halakar da azzãlumai.\""
    },
    {
      "ayah": 14,
      "arabic": "وَلَنُسْكِنَنَّكُمُ ٱلْأَرْضَ مِنۢ بَعْدِهِمْ ۚ ذَٰلِكَ لِمَنْ خَافَ مَقَامِى وَخَافَ وَعِيدِ",
      "english": "And We will surely cause you to dwell in the land after them. That is for he who fears My position and fears My threat.\"",
      "hausa": "Kuma haƙĩƙa, Munã zaunar da ku ga ƙasa a bãyansu. Wancan ne abin gargaɗi ga wanda ya ji tsõron matsayiNa, kuma ya ji tsõron ƙyacẽwãTa."
    },
    {
      "ayah": 15,
      "arabic": "وَٱسْتَفْتَحُوا۟ وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ",
      "english": "And they requested victory from Allah, and disappointed, [therefore], was every obstinate tyrant.",
      "hausa": "Kuma suka yi addu'ar alfãnu. Kuma kõwane kangararre mai tsaurin kai ya tãɓe."
    },
    {
      "ayah": 16,
      "arabic": "مِّن وَرَآئِهِۦ جَهَنَّمُ وَيُسْقَىٰ مِن مَّآءٍ صَدِيدٍ",
      "english": "Before him is Hell, and he will be given a drink of purulent water.",
      "hausa": "Daga bãyansa akwai Jahannama, kuma anã shãyar da shi daga wani ruwa, surkin jini."
    },
    {
      "ayah": 17,
      "arabic": "يَتَجَرَّعُهُۥ وَلَا يَكَادُ يُسِيغُهُۥ وَيَأْتِيهِ ٱلْمَوْتُ مِن كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ ۖ وَمِن وَرَآئِهِۦ عَذَابٌ غَلِيظٌ",
      "english": "He will gulp it but will hardly [be able to] swallow it. And death will come to him from everywhere, but he is not to die. And before him is a massive punishment.",
      "hausa": "Yanã kwankwaɗarsa, kuma bã ya jin sauƙin haɗiyarsa, kuma mutuwa ta jẽ masa daga kõwane wuri kuma bai zama mai mutuwa ba, kuma daga bãyansa akwai azãba mai kauri."
    },
    {
      "ayah": 18,
      "arabic": "مَّثَلُ ٱلَّذِينَ كَفَرُوا۟ بِرَبِّهِمْ ۖ أَعْمَـٰلُهُمْ كَرَمَادٍ ٱشْتَدَّتْ بِهِ ٱلرِّيحُ فِى يَوْمٍ عَاصِفٍ ۖ لَّا يَقْدِرُونَ مِمَّا كَسَبُوا۟ عَلَىٰ شَىْءٍ ۚ ذَٰلِكَ هُوَ ٱلضَّلَـٰلُ ٱلْبَعِيدُ",
      "english": "The example of those who disbelieve in their Lord is [that] their deeds are like ashes which the wind blows forcefully on a stormy day; they are unable [to keep] from what they earned a [single] thing. That is what is extreme error.",
      "hausa": "Misãlin waɗanda suka kãfirta da Ubangijinsu, ayyukansu sun yi kama da tõka wadda iska ta yi tsananin bugãwa da ita a cikin yini mai gũguwa. Ba su iya amfãni daga abin da suka yi tsirfa a kan kõme. Wancan ita ce ɓata mai nĩsa."
    },
    {
      "ayah": 19,
      "arabic": "أَلَمْ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ بِٱلْحَقِّ ۚ إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ",
      "english": "Have you not seen that Allah created the heavens and the earth in truth? If He wills, He can do away with you and produce a new creation.",
      "hausa": "Shin, ba ka gani ba cẽwa lalle ne Allah Yã halicci sammai bakwai da ƙasa da mallakarSa. Idan Yã so zai tafiyar da ku, kuma Ya zo da wata halitta sãbuwa."
    },
    {
      "ayah": 20,
      "arabic": "وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٍ",
      "english": "And that is not difficult for Allah.",
      "hausa": "Kuma wancan bai zama mabuwãyi ba ga Allah."
    },
    {
      "ayah": 21,
      "arabic": "وَبَرَزُوا۟ لِلَّهِ جَمِيعًا فَقَالَ ٱلضُّعَفَـٰٓؤُا۟ لِلَّذِينَ ٱسْتَكْبَرُوٓا۟ إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنتُم مُّغْنُونَ عَنَّا مِنْ عَذَابِ ٱللَّهِ مِن شَىْءٍ ۚ قَالُوا۟ لَوْ هَدَىٰنَا ٱللَّهُ لَهَدَيْنَـٰكُمْ ۖ سَوَآءٌ عَلَيْنَآ أَجَزِعْنَآ أَمْ صَبَرْنَا مَا لَنَا مِن مَّحِيصٍ",
      "english": "And they will come out [for judgement] before Allah all together, and the weak will say to those who were arrogant, \"Indeed, we were your followers, so can you avail us anything against the punishment of Allah?\" They will say, \"If Allah had guided us, we would have guided you. It is all the same for us whether we show intolerance or are patient: there is for us no place of escape.\"",
      "hausa": "Kuma suka bayyana ga Allah gabã daya, sai mãsu rauni suka ce wa waɗanda suka kangara, \"Lalle ne mũ, mun kasance mãsu bi a gare ku, to, shin, kũ mãsu kãrewa ga barinmu ne daga azãbar Allah daga wani abu?\" Suka ce: \"Dã Allah Ya shiryar da mu, dã mun shiryar da ku, daidai ne a kanmu, mun yi rãki ko mun yi haƙuri ba mu da wata mafaka.\""
    },
    {
      "ayah": 22,
      "arabic": "وَقَالَ ٱلشَّيْطَـٰنُ لَمَّا قُضِىَ ٱلْأَمْرُ إِنَّ ٱللَّهَ وَعَدَكُمْ وَعْدَ ٱلْحَقِّ وَوَعَدتُّكُمْ فَأَخْلَفْتُكُمْ ۖ وَمَا كَانَ لِىَ عَلَيْكُم مِّن سُلْطَـٰنٍ إِلَّآ أَن دَعَوْتُكُمْ فَٱسْتَجَبْتُمْ لِى ۖ فَلَا تَلُومُونِى وَلُومُوٓا۟ أَنفُسَكُم ۖ مَّآ أَنَا۠ بِمُصْرِخِكُمْ وَمَآ أَنتُم بِمُصْرِخِىَّ ۖ إِنِّى كَفَرْتُ بِمَآ أَشْرَكْتُمُونِ مِن قَبْلُ ۗ إِنَّ ٱلظَّـٰلِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ",
      "english": "And Satan will say when the matter has been concluded, \"Indeed, Allah had promised you the promise of truth. And I promised you, but I betrayed you. But I had no authority over you except that I invited you, and you responded to me. So do not blame me; but blame yourselves. I cannot be called to your aid, nor can you be called to my aid. Indeed, I deny your association of me [with Allah] before. Indeed, for the wrongdoers is a painful punishment.\"",
      "hausa": "Kuma Shaiɗan ya ce a lõkacin da aka ƙãre al'amarin, \"Lalle ne Allah Ya yi muku wa'adi, wa'adin gaskiyã, kuma na yi muku wa'adi, sa'an nan na sãɓã muku. Kuma bãbu wani dalĩli a gare ni a kanku fãce na kirã ku, sa'an nan kun karɓã mini. Sabõda haka kada ku zarge ni, kuma ku zargi kanku. Ban zama mai amfaninku ba, kuma ba ku zama mãsu amfãnĩna ba. Lalle na barranta da abin da kuka haɗã ni da shi gabanin wannan (matsayi). Lalle azzãlumai sunã da azãba mai raɗaɗi.\""
    },
    {
      "ayah": 23,
      "arabic": "وَأُدْخِلَ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ ۖ تَحِيَّتُهُمْ فِيهَا سَلَـٰمٌ",
      "english": "And those who believed and did righteous deeds will be admitted to gardens beneath which rivers flow, abiding eternally therein by permission of their Lord; and their greeting therein will be, \"Peace!\"",
      "hausa": "Kuma aka shigar da waɗanda suka yi ĩmãni, kuma suka aikata ayyuka na ƙwarai, a gidãjen Aljanna, kõramu sunã gudãna daga ƙarƙashinsu sunã madawwamã a cikinsu da iznin Ubangijinsu, gaisuwarsu a cikinta \"Salãm\", (wãtau Aminci)."
    },
    {
      "ayah": 24,
      "arabic": "أَلَمْ تَرَ كَيْفَ ضَرَبَ ٱللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِى ٱلسَّمَآءِ",
      "english": "Have you not considered how Allah presents an example, [making] a good word like a good tree, whose root is firmly fixed and its branches [high] in the sky?",
      "hausa": "Shin, ba ka ganĩ ba, yadda Allah Ya buga wani mĩsali, kalma mai kyau kamar itãciya ce mai kyau, asalinta yanã tabbatacce, kuma rẽshenta yanã cikin sama?"
    },
    {
      "ayah": 25,
      "arabic": "تُؤْتِىٓ أُكُلَهَا كُلَّ حِينٍۭ بِإِذْنِ رَبِّهَا ۗ وَيَضْرِبُ ٱللَّهُ ٱلْأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "english": "It produces its fruit all the time, by permission of its Lord. And Allah presents examples for the people that perhaps they will be reminded.",
      "hausa": "Tanã bãyar da abincinta a kõwane lõkaci da iznin Ubangijinta! Kuma Allah Yanã buga misãli ga mutãne, mai yiwuwã ne, sunã tunãwa."
    },
    {
      "ayah": 26,
      "arabic": "وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ ٱجْتُثَّتْ مِن فَوْقِ ٱلْأَرْضِ مَا لَهَا مِن قَرَارٍ",
      "english": "And the example of a bad word is like a bad tree, uprooted from the surface of the earth, not having any stability.",
      "hausa": "Kuma misalin kalma mummũnã kamar itãciya mummũnã ce, an tumɓuke ta daga bisa ga ƙasa, bã ta da wata tabbata."
    },
    {
      "ayah": 27,
      "arabic": "يُثَبِّتُ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ بِٱلْقَوْلِ ٱلثَّابِتِ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا وَفِى ٱلْـَٔاخِرَةِ ۖ وَيُضِلُّ ٱللَّهُ ٱلظَّـٰلِمِينَ ۚ وَيَفْعَلُ ٱللَّهُ مَا يَشَآءُ",
      "english": "Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter. And Allah sends astray the wrongdoers. And Allah does what He wills.",
      "hausa": "Allah Yanã tabbatar da waɗanda suka yi ĩmãni da magana tabbatacciya a cikin rãyuwar dũniya, da cikin Lãhira, Kuma Allah Yanã ɓatar da azzãlumai, kuma Allah Yanã aikata abin da Yake so."
    },
    {
      "ayah": 28,
      "arabic": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ بَدَّلُوا۟ نِعْمَتَ ٱللَّهِ كُفْرًا وَأَحَلُّوا۟ قَوْمَهُمْ دَارَ ٱلْبَوَارِ",
      "english": "Have you not considered those who exchanged the favor of Allah for disbelief and settled their people [in] the home of ruin?",
      "hausa": "Shin ba ka lura ba da waɗanda suka musanya ni'imar Allah da kãfirci kuma suka saukar da mutãnensu a gidan halakã?"
    },
    {
      "ayah": 29,
      "arabic": "جَهَنَّمَ يَصْلَوْنَهَا ۖ وَبِئْسَ ٱلْقَرَارُ",
      "english": "[It is] Hell, which they will [enter to] burn, and wretched is the settlement.",
      "hausa": "Sunã ƙõnuwa a wutar jahannama, kuma tir da matabbatarsu."
    },
    {
      "ayah": 30,
      "arabic": "وَجَعَلُوا۟ لِلَّهِ أَندَادًا لِّيُضِلُّوا۟ عَن سَبِيلِهِۦ ۗ قُلْ تَمَتَّعُوا۟ فَإِنَّ مَصِيرَكُمْ إِلَى ٱلنَّارِ",
      "english": "And they have attributed to Allah equals to mislead [people] from His way. Say, \"Enjoy yourselves, for indeed, your destination is the Fire.\"",
      "hausa": "Kuma suka sanya wa Allah kĩshiyõyi, dõmin ɓatarwa daga hanyarSa, Ka ce: \"Ku ji dãɗi, sa'an nan, lalle ne, makõmarku Wutar ce.\""
    },
    {
      "ayah": 31,
      "arabic": "قُل لِّعِبَادِىَ ٱلَّذِينَ ءَامَنُوا۟ يُقِيمُوا۟ ٱلصَّلَوٰةَ وَيُنفِقُوا۟ مِمَّا رَزَقْنَـٰهُمْ سِرًّا وَعَلَانِيَةً مِّن قَبْلِ أَن يَأْتِىَ يَوْمٌ لَّا بَيْعٌ فِيهِ وَلَا خِلَـٰلٌ",
      "english": "[O Muhammad], tell My servants who have believed to establish prayer and spend from what We have provided them, secretly and publicly, before a Day comes in which there will be no exchange, nor any friendships.",
      "hausa": "Ka ce wa bãyĩNa waɗanda suka yi ĩmãni su tsayar da salla kuma su ciyar daga abin da Muka azurtã su, a asirce da bayyane, daga gabãnin wani wuni ya zo, bãbu ciniki a ciki, kuma bãbu abõtaka."
    },
    {
      "ayah": 32,
      "arabic": "ٱللَّهُ ٱلَّذِى خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَأَخْرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزْقًا لَّكُمْ ۖ وَسَخَّرَ لَكُمُ ٱلْفُلْكَ لِتَجْرِىَ فِى ٱلْبَحْرِ بِأَمْرِهِۦ ۖ وَسَخَّرَ لَكُمُ ٱلْأَنْهَـٰرَ",
      "english": "It is Allah who created the heavens and the earth and sent down rain from the sky and produced thereby some fruits as provision for you and subjected for you the ships to sail through the sea by His command and subjected for you the rivers.",
      "hausa": "Allah ne wanda Ya halicci sammai da ƙasa kuma Ya saukar da ruwa daga sama, sa'an nan Ya fitar game da shi, daga 'ya'yan itãce arziki dõminku kuma Ya hõrẽ jirgin ruwa dõmin ya yi gudu a cikin tẽku da umurninSa, kuma Ya hõrẽ muku kõguna."
    },
    {
      "ayah": 33,
      "arabic": "وَسَخَّرَ لَكُمُ ٱلشَّمْسَ وَٱلْقَمَرَ دَآئِبَيْنِ ۖ وَسَخَّرَ لَكُمُ ٱلَّيْلَ وَٱلنَّهَارَ",
      "english": "And He subjected for you the sun and the moon, continuous [in orbit], and subjected for you the night and the day.",
      "hausa": "Kuma Ya hõrẽ muku rãnã da watã sunã madawwama biyu, kuma Ya hõrẽ muku dare da wuni."
    },
    {
      "ayah": 34,
      "arabic": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ ۚ وَإِن تَعُدُّوا۟ نِعْمَتَ ٱللَّهِ لَا تُحْصُوهَآ ۗ إِنَّ ٱلْإِنسَـٰنَ لَظَلُومٌ كَفَّارٌ",
      "english": "And He gave you from all you asked of Him. And if you should count the favor of Allah, you could not enumerate them. Indeed, mankind is [generally] most unjust and ungrateful.",
      "hausa": "Kuma Ya bã ku dukkan abin da kuka rõƙe Shi kuma idan kun ƙidaya, ni'imar Allah bã zã ku lissafe ta ba. Lalle ne mutum, haƙĩƙa, mai yawan zãlunci ne, mai yawan kãfirci."
    },
    {
      "ayah": 35,
      "arabic": "وَإِذْ قَالَ إِبْرَٰهِيمُ رَبِّ ٱجْعَلْ هَـٰذَا ٱلْبَلَدَ ءَامِنًا وَٱجْنُبْنِى وَبَنِىَّ أَن نَّعْبُدَ ٱلْأَصْنَامَ",
      "english": "And [mention, O Muhammad], when Abraham said, \"My Lord, make this city [Makkah] secure and keep me and my sons away from worshipping idols.",
      "hausa": "Kuma a lõkacin da Ibrãhĩm ya ce: \"Yã Ubangijina! Ka sanyã wannan gari amintacce kuma Ka nĩsanta ni, nĩ da ɗiyãna daga bauta wa gumãka."
    },
    {
      "ayah": 36,
      "arabic": "رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِّنَ ٱلنَّاسِ ۖ فَمَن تَبِعَنِى فَإِنَّهُۥ مِنِّى ۖ وَمَنْ عَصَانِى فَإِنَّكَ غَفُورٌ رَّحِيمٌ",
      "english": "My Lord, indeed they have led astray many among the people. So whoever follows me - then he is of me; and whoever disobeys me - indeed, You are [yet] Forgiving and Merciful.",
      "hausa": "\"Yã Ubangijina! Lalle ne sũ, sun ɓatar da mãsu yawa daga mutãne sa'an nan wanda ya bĩ ni, to, lalle shi, yanã daga gare ni, kuma wanda ya sãɓa mini, to, lalle ne Kai Mai gãfara ne, Mai jin ƙai."
    },
    {
      "ayah": 37,
      "arabic": "رَّبَّنَآ إِنِّىٓ أَسْكَنتُ مِن ذُرِّيَّتِى بِوَادٍ غَيْرِ ذِى زَرْعٍ عِندَ بَيْتِكَ ٱلْمُحَرَّمِ رَبَّنَا لِيُقِيمُوا۟ ٱلصَّلَوٰةَ فَٱجْعَلْ أَفْـِٔدَةً مِّنَ ٱلنَّاسِ تَهْوِىٓ إِلَيْهِمْ وَٱرْزُقْهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمْ يَشْكُرُونَ",
      "english": "Our Lord, I have settled some of my descendants in an uncultivated valley near Your sacred House, our Lord, that they may establish prayer. So make hearts among the people incline toward them and provide for them from the fruits that they might be grateful.",
      "hausa": "\"Yã Ubangijinmu! Lalle ne ni, na zaunar da zuriyata ga rãfi wanda ba ma'abũcin shũka ba, a wurin ¦ãkinka mai alfarma. Yã Ubangijinmu! Dõmin su tsayar da salla. Sai Ka sanya zukãta daga mutãne sunã gaggãwar bẽgenzuwa gare su, kuma ka azurtã su daga 'ya'yan itãce, mai yiwuwã ne sunã gõdẽwã.\""
    },
    {
      "ayah": 38,
      "arabic": "رَبَّنَآ إِنَّكَ تَعْلَمُ مَا نُخْفِى وَمَا نُعْلِنُ ۗ وَمَا يَخْفَىٰ عَلَى ٱللَّهِ مِن شَىْءٍ فِى ٱلْأَرْضِ وَلَا فِى ٱلسَّمَآءِ",
      "english": "Our Lord, indeed You know what we conceal and what we declare, and nothing is hidden from Allah on the earth or in the heaven.",
      "hausa": "\"Yã Ubangijinmu! Lalle ne Kai Kanã sanin abin da muke ɓõyẽwa, da abin da muke bayyanãwa. Kuma bãbu abin da yake ɓõyẽwa ga A1lah, daga wani abu a cikin ƙasa, kuma bãbu a cikin sama.\""
    },
    {
      "ayah": 39,
      "arabic": "ٱلْحَمْدُ لِلَّهِ ٱلَّذِى وَهَبَ لِى عَلَى ٱلْكِبَرِ إِسْمَـٰعِيلَ وَإِسْحَـٰقَ ۚ إِنَّ رَبِّى لَسَمِيعُ ٱلدُّعَآءِ",
      "english": "Praise to Allah, who has granted to me in old age Ishmael and Isaac. Indeed, my Lord is the Hearer of supplication.",
      "hausa": "\"Gõdiyã ta tabbata ga Allah wanda Yake Ya bã ni inã a cikin tsufa Ismã'ila da Is'hãƙa. Lalle ne Ubangijina, haƙĩƙa, Mai jin addu'a ne.\""
    },
    {
      "ayah": 40,
      "arabic": "رَبِّ ٱجْعَلْنِى مُقِيمَ ٱلصَّلَوٰةِ وَمِن ذُرِّيَّتِى ۚ رَبَّنَا وَتَقَبَّلْ دُعَآءِ",
      "english": "My Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, and accept my supplication.",
      "hausa": "\"Yã Ubangijina! Ka sanyã ni mai tsayar da salla. Kuma daga zũriyyata. Yã Ubangijinmu! Kuma Ka karɓi addu'ata.\""
    },
    {
      "ayah": 41,
      "arabic": "رَبَّنَا ٱغْفِرْ لِى وَلِوَٰلِدَىَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ ٱلْحِسَابُ",
      "english": "Our Lord, forgive me and my parents and the believers the Day the account is established.\"",
      "hausa": "\"Yã Ubangijinmu! Ka yi gãfara gare ni, kuma ga mahaifãna, kuma da mũminai, a rãnar da hisãbi yake tsayãwa.\""
    },
    {
      "ayah": 42,
      "arabic": "وَلَا تَحْسَبَنَّ ٱللَّهَ غَـٰفِلًا عَمَّا يَعْمَلُ ٱلظَّـٰلِمُونَ ۚ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ ٱلْأَبْصَـٰرُ",
      "english": "And never think that Allah is unaware of what the wrongdoers do. He only delays them for a Day when eyes will stare [in horror].",
      "hausa": "\"Kuma kada ka yi zaton Allah Mai shagalã ne daga abin da azzalumai suke aikatãwã. Abin sani kawai, Yanã jinkirta musu ne zuwa ga wani wuni, wanda idãnuwa suke fita turu- turu a cikinsa.\""
    },
    {
      "ayah": 43,
      "arabic": "مُهْطِعِينَ مُقْنِعِى رُءُوسِهِمْ لَا يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ ۖ وَأَفْـِٔدَتُهُمْ هَوَآءٌ",
      "english": "Racing ahead, their heads raised up, their glance does not come back to them, and their hearts are void.",
      "hausa": "\"Sunã mãsu gaggãwa, mãsu ɗaukaka kãwunansu zuwa sama ƙiftawar ganinsu ba ta kõmãwa gare su. Kuma zukãtansu wõfintattu.\""
    },
    {
      "ayah": 44,
      "arabic": "وَأَنذِرِ ٱلنَّاسَ يَوْمَ يَأْتِيهِمُ ٱلْعَذَابُ فَيَقُولُ ٱلَّذِينَ ظَلَمُوا۟ رَبَّنَآ أَخِّرْنَآ إِلَىٰٓ أَجَلٍ قَرِيبٍ نُّجِبْ دَعْوَتَكَ وَنَتَّبِعِ ٱلرُّسُلَ ۗ أَوَلَمْ تَكُونُوٓا۟ أَقْسَمْتُم مِّن قَبْلُ مَا لَكُم مِّن زَوَالٍ",
      "english": "And, [O Muhammad], warn the people of a Day when the punishment will come to them and those who did wrong will say, \"Our Lord, delay us for a short term; we will answer Your call and follow the messengers.\" [But it will be said], \"Had you not sworn, before, that for you there would be no cessation?",
      "hausa": "Kuma ka yi gargaɗi ga mutãne ga rãnar da azãba take jẽ musu, sai waɗanda suka yi zãlunci su ce: \"Yã Ubangijinmu! Ka yi mana jinkiri zuwa ga wani ajali makusanci, mu karɓa wa kiranKa, kuma mu bi Manzanni.\"(Allah Ya ce musu) \"Ashe, ba ku kasance kun yi rantsuwã ba daga gabãni, cẽwa bã ku da wata gushẽwa?"
    },
    {
      "ayah": 45,
      "arabic": "وَسَكَنتُمْ فِى مَسَـٰكِنِ ٱلَّذِينَ ظَلَمُوٓا۟ أَنفُسَهُمْ وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ وَضَرَبْنَا لَكُمُ ٱلْأَمْثَالَ",
      "english": "And you lived among the dwellings of those who wronged themselves, and it had become clear to you how We dealt with them. And We presented for you [many] examples.\"",
      "hausa": "\"Kuma kuka zaunã a cikin gidãjen waɗanda suka zãlunci kansu, kuma ya bayyana a gare ku yadda Muka aikatã game da su, kuma Muka buga muku misãlai.\""
    },
    {
      "ayah": 46,
      "arabic": "وَقَدْ مَكَرُوا۟ مَكْرَهُمْ وَعِندَ ٱللَّهِ مَكْرُهُمْ وَإِن كَانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ ٱلْجِبَالُ",
      "english": "And they had planned their plan, but with Allah is [recorded] their plan, even if their plan had been [sufficient] to do away with the mountains.",
      "hausa": "Kuma lalle sun yi mãkirci irin makircinSu kuma a wurin Allah makircinsu, yake, kuma lalle ne makircinsu yã kasance, haƙĩƙa, duwãtsu sunã gushẽwã sabõda shi."
    },
    {
      "ayah": 47,
      "arabic": "فَلَا تَحْسَبَنَّ ٱللَّهَ مُخْلِفَ وَعْدِهِۦ رُسُلَهُۥٓ ۗ إِنَّ ٱللَّهَ عَزِيزٌ ذُو ٱنتِقَامٍ",
      "english": "So never think that Allah will fail in His promise to His messengers. Indeed, Allah is Exalted in Might and Owner of Retribution.",
      "hausa": "Sabõda haka, kada ka ƙarfafa zaton Allah Mai sãɓa wa'adinSa ne ga ManzanninSa. Lalle ne Allah ne Mabuwãyi, Ma'abũcin azãbar rãmuwa."
    },
    {
      "ayah": 48,
      "arabic": "يَوْمَ تُبَدَّلُ ٱلْأَرْضُ غَيْرَ ٱلْأَرْضِ وَٱلسَّمَـٰوَٰتُ ۖ وَبَرَزُوا۟ لِلَّهِ ٱلْوَٰحِدِ ٱلْقَهَّارِ",
      "english": "[It will be] on the Day the earth will be replaced by another earth, and the heavens [as well], and all creatures will come out before Allah, the One, the Prevailing.",
      "hausa": "A rãnar da ake musanya ƙasa bã ƙasar nan ba, da sammai kuma su bayyana ga Allah Makaɗaici, Mai tanƙwasãwa."
    },
    {
      "ayah": 49,
      "arabic": "وَتَرَى ٱلْمُجْرِمِينَ يَوْمَئِذٍ مُّقَرَّنِينَ فِى ٱلْأَصْفَادِ",
      "english": "And you will see the criminals that Day bound together in shackles,",
      "hausa": "Kuma kana ganin mãsu laifi, a rãnar nan, sunã waɗanda aka yi wa ciri daidai a cikin marũruwa."
    },
    {
      "ayah": 50,
      "arabic": "سَرَابِيلُهُم مِّن قَطِرَانٍ وَتَغْشَىٰ وُجُوهَهُمُ ٱلنَّارُ",
      "english": "Their garments of liquid pitch and their faces covered by the Fire.",
      "hausa": "Rigunansu daga farar wutã ne, kuma wuta ta rufe fuskõkinsu."
    },
    {
      "ayah": 51,
      "arabic": "لِيَجْزِىَ ٱللَّهُ كُلَّ نَفْسٍ مَّا كَسَبَتْ ۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
      "english": "So that Allah will recompense every soul for what it earned. Indeed, Allah is swift in account.",
      "hausa": "Dõmin Allah Ya sãkã wa kõwane rai da abin da ya tsuwurwurta. Lalle ne, Allah Mai gaggãwar hisãbi ne."
    },
    {
      "ayah": 52,
      "arabic": "هَـٰذَا بَلَـٰغٌ لِّلنَّاسِ وَلِيُنذَرُوا۟ بِهِۦ وَلِيَعْلَمُوٓا۟ أَنَّمَا هُوَ إِلَـٰهٌ وَٰحِدٌ وَلِيَذَّكَّرَ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ",
      "english": "This [Qur'an] is notification for the people that they may be warned thereby and that they may know that He is but one God and that those of understanding will be reminded.",
      "hausa": "Wannan iyarwa ce ga mutãne, kuma dõmin a yi musu gargaɗi da shi, kuma dõmin su sani cẽwa, abin sani kawai, shĩ ne abin bautawa guda. Kuma dõmin masu hankali su riƙa tunãwa."
    }
  ]
}