{
  "surah": 65,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "يَـٰٓأَيُّهَا ٱلنَّبِىُّ إِذَا طَلَّقْتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُوا۟ ٱلْعِدَّةَ ۖ وَٱتَّقُوا۟ ٱللَّهَ رَبَّكُمْ ۖ لَا تُخْرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّآ أَن يَأْتِينَ بِفَـٰحِشَةٍ مُّبَيِّنَةٍ ۚ وَتِلْكَ حُدُودُ ٱللَّهِ ۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدْ ظَلَمَ نَفْسَهُۥ ۚ لَا تَدْرِى لَعَلَّ ٱللَّهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا",
      "english": "O Prophet, when you [Muslims] divorce women, divorce them for [the commencement of] their waiting period and keep count of the waiting period, and fear Allah, your Lord. Do not turn them out of their [husbands'] houses, nor should they [themselves] leave [during that period] unless they are committing a clear immorality. And those are the limits [set by] Allah. And whoever transgresses the limits of Allah has certainly wronged himself. You know not; perhaps Allah will bring about after that a [different] matter.",
      "hausa": "Ya kai Annabi! Idan kun saki mãtã, sai ku sake su ga iddarsu, kuma ku ƙididdige iddar. Kuma ku bi Allah Ubangijinku da taƙawa. Kada ku fitar da su daga gidãjensu, kuma kada su fita fãce idan sunã zuwa da wata alfãshã bayyananna. Kuma waɗancan iyakõkin Allah ne. Kuma wanda ya ƙẽtare iyãkõkin Allah, to, lalle ya zãlunci kansa. Ba ka sani ba ɗammãnin Allah zai fitar da wani al'amari a bãyan haka."
    },
    {
      "ayah": 2,
      "arabic": "فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُوا۟ ذَوَىْ عَدْلٍ مِّنكُمْ وَأَقِيمُوا۟ ٱلشَّهَـٰدَةَ لِلَّهِ ۚ ذَٰلِكُمْ يُوعَظُ بِهِۦ مَن كَانَ يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ ۚ وَمَن يَتَّقِ ٱللَّهَ يَجْعَل لَّهُۥ مَخْرَجًا",
      "english": "And when they have [nearly] fulfilled their term, either retain them according to acceptable terms or part with them according to acceptable terms. And bring to witness two just men from among you and establish the testimony for [the acceptance of] Allah. That is instructed to whoever should believe in Allah and the Last day. And whoever fears Allah - He will make for him a way out",
      "hausa": "Sa'an nan idan sun isa ga ajalinsu (na idda) sai ku riƙe su da abin da aka sani kõ ku rabu da su da abin da aka sani kuma ku shaidar da mãsu adalci biyu daga gare ku. Kuma ku tsayar da shaidar dõmin Allah. Wancan ɗinku anã yin wa'azi da shi ga wanda ya kasance yanã yin ĩmãni da Allah da Rãnar Lãhira. Kuma wanda ya bi Allah da taƙawa, Allah zai sanya masa mafita."
    },
    {
      "ayah": 3,
      "arabic": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُۥٓ ۚ إِنَّ ٱللَّهَ بَـٰلِغُ أَمْرِهِۦ ۚ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَىْءٍ قَدْرًا",
      "english": "And will provide for him from where he does not expect. And whoever relies upon Allah - then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent.",
      "hausa": "Kuma Ya arzũta shi daga inda bã ya zato. Kuma wanda ya dõgara ga Allah, to, Allah ne Ma'ishinsa. Lalle Allah Mai iyar da umurninSa ne. Haƙĩƙa Allah Ya sanyama'auni ga dukan kõme."
    },
    {
      "ayah": 4,
      "arabic": "وَٱلَّـٰٓـِٔى يَئِسْنَ مِنَ ٱلْمَحِيضِ مِن نِّسَآئِكُمْ إِنِ ٱرْتَبْتُمْ فَعِدَّتُهُنَّ ثَلَـٰثَةُ أَشْهُرٍ وَٱلَّـٰٓـِٔى لَمْ يَحِضْنَ ۚ وَأُو۟لَـٰتُ ٱلْأَحْمَالِ أَجَلُهُنَّ أَن يَضَعْنَ حَمْلَهُنَّ ۚ وَمَن يَتَّقِ ٱللَّهَ يَجْعَل لَّهُۥ مِنْ أَمْرِهِۦ يُسْرًا",
      "english": "And those who no longer expect menstruation among your women - if you doubt, then their period is three months, and [also for] those who have not menstruated. And for those who are pregnant, their term is until they give birth. And whoever fears Allah - He will make for him of his matter ease.",
      "hausa": "Kuma waɗanda suka yanke ɗammãni daga haila daga mãtanku, idan kun yi shakka, to, iddarsu watã uku ce da waɗanda ba su yi haila ba. Kuma ma'abũta cikinna ajalinsu, (shi ne) cewa su haifi cikinnansu. Kuma wanda ya bi Allah da taƙawa, (Allah) zai sanya masa wani sauƙi daga al'amarinsa."
    },
    {
      "ayah": 5,
      "arabic": "ذَٰلِكَ أَمْرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيْكُمْ ۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرْ عَنْهُ سَيِّـَٔاتِهِۦ وَيُعْظِمْ لَهُۥٓ أَجْرًا",
      "english": "That is the command of Allah, which He has sent down to you; and whoever fears Allah - He will remove for him his misdeeds and make great for him his reward.",
      "hausa": "Wancan umurnin Allah ne, Ya saukar da shi zuwa gare ku. Kuma wanda ya bi Allah da taƙawa, Allah zai kankare masa mũnãnan ayyukansa, kuma Ya girmama masa sãkamako."
    },
    {
      "ayah": 6,
      "arabic": "أَسْكِنُوهُنَّ مِنْ حَيْثُ سَكَنتُم مِّن وُجْدِكُمْ وَلَا تُضَآرُّوهُنَّ لِتُضَيِّقُوا۟ عَلَيْهِنَّ ۚ وَإِن كُنَّ أُو۟لَـٰتِ حَمْلٍ فَأَنفِقُوا۟ عَلَيْهِنَّ حَتَّىٰ يَضَعْنَ حَمْلَهُنَّ ۚ فَإِنْ أَرْضَعْنَ لَكُمْ فَـَٔاتُوهُنَّ أُجُورَهُنَّ ۖ وَأْتَمِرُوا۟ بَيْنَكُم بِمَعْرُوفٍ ۖ وَإِن تَعَاسَرْتُمْ فَسَتُرْضِعُ لَهُۥٓ أُخْرَىٰ",
      "english": "Lodge them [in a section] of where you dwell out of your means and do not harm them in order to oppress them. And if they should be pregnant, then spend on them until they give birth. And if they breastfeed for you, then give them their payment and confer among yourselves in the acceptable way; but if you are in discord, then there may breastfeed for the father another woman.",
      "hausa": "Ku zaunar da su daga inda kuka zaunar daga gwargwadon sãmunku. Kuma kada ku cũce su dõmin ku ƙuntata a kansu. Kuma idan sun kasance ma'abũta ciki, sai ku ciyar da su har su haifi cikinsu. Sa'an nan idan sun shãyar da mãma sabõda ku, sai ku bã su tsãdõdinsu. Kuma ku yi shãwara a tsakãninku bisa abin da aka sani. Kuma idan kun nũna talauci to wata mace zã ta shãyar da mãma sabõda shi (mijin)."
    },
    {
      "ayah": 7,
      "arabic": "لِيُنفِقْ ذُو سَعَةٍ مِّن سَعَتِهِۦ ۖ وَمَن قُدِرَ عَلَيْهِ رِزْقُهُۥ فَلْيُنفِقْ مِمَّآ ءَاتَىٰهُ ٱللَّهُ ۚ لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا مَآ ءَاتَىٰهَا ۚ سَيَجْعَلُ ٱللَّهُ بَعْدَ عُسْرٍ يُسْرًا",
      "english": "Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allah has given him. Allah does not charge a soul except [according to] what He has given it. Allah will bring about, after hardship, ease.",
      "hausa": "Sai mawadãci ya ciyar daga wadãtarsa kuma wanda aka ƙuntata masa arzikinsa, to, sai ya ciyar daga abin da Allah Ya bã shi. Allah bã Ya kallafa wa wani rai fãce abin da Ya bã shi. Allah zai sanya sauƙi a bãyan tsanani."
    },
    {
      "ayah": 8,
      "arabic": "وَكَأَيِّن مِّن قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِۦ فَحَاسَبْنَـٰهَا حِسَابًا شَدِيدًا وَعَذَّبْنَـٰهَا عَذَابًا نُّكْرًا",
      "english": "And how many a city was insolent toward the command of its Lord and His messengers, so We took it to severe account and punished it with a terrible punishment.",
      "hausa": "Kuma da yawa daga alƙarya wadda ta yi tsaurin kai daga barin umurnin Ubangijinta da ManzanninSa, sai Muka yi mata hisãbi, hisãbi mai tsanani, kuma Muka, azabtar da ita azãba abar ƙyãma."
    },
    {
      "ayah": 9,
      "arabic": "فَذَاقَتْ وَبَالَ أَمْرِهَا وَكَانَ عَـٰقِبَةُ أَمْرِهَا خُسْرًا",
      "english": "And it tasted the bad consequence of its affair, and the outcome of its affair was loss.",
      "hausa": "Sa'an nan ta ɗanɗana masĩfar al'amarinta. kuma ƙarshen al'amarinta ya kasance hasãra,"
    },
    {
      "ayah": 10,
      "arabic": "أَعَدَّ ٱللَّهُ لَهُمْ عَذَابًا شَدِيدًا ۖ فَٱتَّقُوا۟ ٱللَّهَ يَـٰٓأُو۟لِى ٱلْأَلْبَـٰبِ ٱلَّذِينَ ءَامَنُوا۟ ۚ قَدْ أَنزَلَ ٱللَّهُ إِلَيْكُمْ ذِكْرًا",
      "english": "Allah has prepared for them a severe punishment; so fear Allah, O you of understanding who have believed. Allah has sent down to you the Qur'an.",
      "hausa": "Allah Ya yi musu tattalin wata azãba mai tsanani. Sabõda haka ku bi Allah da taƙawa, yã ma'abũta hankula, waɗanda suka yi ĩmãni! Haƙĩƙa Allah Ya saukar da wata tunãtarwa zuwa gare ku."
    },
    {
      "ayah": 11,
      "arabic": "رَّسُولًا يَتْلُوا۟ عَلَيْكُمْ ءَايَـٰتِ ٱللَّهِ مُبَيِّنَـٰتٍ لِّيُخْرِجَ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ ۚ وَمَن يُؤْمِنۢ بِٱللَّهِ وَيَعْمَلْ صَـٰلِحًا يُدْخِلْهُ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًا ۖ قَدْ أَحْسَنَ ٱللَّهُ لَهُۥ رِزْقًا",
      "english": "[He sent] a Messenger [Muhammad] reciting to you the distinct verses of Allah that He may bring out those who believe and do righteous deeds from darknesses into the light. And whoever believes in Allah and does righteousness - He will admit him into gardens beneath which rivers flow to abide therein forever. Allah will have perfected for him a provision.",
      "hausa": "Manzo, yanã karãtun ãyõyin Allah bayyananu a kanku dõmin Ya fitar da waɗanda suka yi ĩmãni kuma suka aikata ayyukan ƙwarai daga duffai zuwa ga haske. Kuma wanda ya yi ĩmãni da Allah ya aikata aikin ƙwarai Allah zai shigar da shi gidãjen Aljanna ƙoramu nã gudãna daga ƙarƙashnsu sunã mãsu dawwama a cikinsu har abada. Haƙĩƙa Allah Yã kyautata masa arziki."
    },
    {
      "ayah": 12,
      "arabic": "ٱللَّهُ ٱلَّذِى خَلَقَ سَبْعَ سَمَـٰوَٰتٍ وَمِنَ ٱلْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ ٱلْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوٓا۟ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ وَأَنَّ ٱللَّهَ قَدْ أَحَاطَ بِكُلِّ شَىْءٍ عِلْمًۢا",
      "english": "It is Allah who has created seven heavens and of the earth, the like of them. [His] command descends among them so you may know that Allah is over all things competent and that Allah has encompassed all things in knowledge.",
      "hausa": "Allah, wanda Ya halitta bakwai ɗin sammai kuma daga ƙasã kwatankwacinsu, umuruinSa yanã ta sauka a tsakaninsu dõmin ku san lalle Allah Mai ĩkon yi ne akan dukan kõme, kuma lalle Allah, haƙĩƙa Ya kẽwaye ga dukan kõme da sani."
    }
  ]
}