{
  "surah": 71,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "إِنَّآ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِۦٓ أَنْ أَنذِرْ قَوْمَكَ مِن قَبْلِ أَن يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ",
      "english": "Indeed, We sent Noah to his people, [saying], \"Warn your people before there comes to them a painful punishment.\"",
      "hausa": "Lalle ne Mun aiki Nũhu zuwa ga mutãnensa, cẽwa ka yi gargaɗi ga mutãnenka gabãnin wata azãba mai raɗaɗi ta zo musu."
    },
    {
      "ayah": 2,
      "arabic": "قَالَ يَـٰقَوْمِ إِنِّى لَكُمْ نَذِيرٌ مُّبِينٌ",
      "english": "He said, \"O my people, indeed I am to you a clear warner,",
      "hausa": "Ya ce: \"Ya mutãnena ni, a gare ku, mai gargaɗi ne, mai bayyanãwa.\""
    },
    {
      "ayah": 3,
      "arabic": "أَنِ ٱعْبُدُوا۟ ٱللَّهَ وَٱتَّقُوهُ وَأَطِيعُونِ",
      "english": "[Saying], 'Worship Allah, fear Him and obey me.",
      "hausa": "\"Cewa ku bauta wa Allah, ku ji tsõronSa, kuma ku bĩ ni.\""
    },
    {
      "ayah": 4,
      "arabic": "يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۚ إِنَّ أَجَلَ ٱللَّهِ إِذَا جَآءَ لَا يُؤَخَّرُ ۖ لَوْ كُنتُمْ تَعْلَمُونَ",
      "english": "Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \"",
      "hausa": "\"Allah zai gãfarta muku daga zunubanku kuma Ya jinkirta muku zuwa ga ajalin da aka ambata. Lalle ne ajalin Allah idan ya zo, ba za a jinkirta Shi ba, dã kun kasance masana (ga abin da nake faɗã dã, kun bar kãfirci).\""
    },
    {
      "ayah": 5,
      "arabic": "قَالَ رَبِّ إِنِّى دَعَوْتُ قَوْمِى لَيْلًا وَنَهَارًا",
      "english": "He said, \"My Lord, indeed I invited my people [to truth] night and day.",
      "hausa": "Nũhu) ya ce: \"Ya Ubangijina! Lalle ne, na kirãyi mutãnena, a cikin dare da yini.\""
    },
    {
      "ayah": 6,
      "arabic": "فَلَمْ يَزِدْهُمْ دُعَآءِىٓ إِلَّا فِرَارًا",
      "english": "But my invitation increased them not except in flight.",
      "hausa": "\"To, amma kirana bai ƙãre su ba sai da, gudu (daga gare ni).\""
    },
    {
      "ayah": 7,
      "arabic": "وَإِنِّى كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوٓا۟ أَصَـٰبِعَهُمْ فِىٓ ءَاذَانِهِمْ وَٱسْتَغْشَوْا۟ ثِيَابَهُمْ وَأَصَرُّوا۟ وَٱسْتَكْبَرُوا۟ ٱسْتِكْبَارًا",
      "english": "And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance.",
      "hausa": "\"Kuma lalle ne ni, kõ da yaushe na kirãye su dõmin Ka gãfarta musu, sai su sanya yatsunsu a cikin kunnuwansu, su lulluɓe da tufãfinsu, su dõge ga yin laifi. Sun yi girman kai iyãkar girman kai.\""
    },
    {
      "ayah": 8,
      "arabic": "ثُمَّ إِنِّى دَعَوْتُهُمْ جِهَارًا",
      "english": "Then I invited them publicly.",
      "hausa": "\"Sa'an nan lalle ne ni, na kira su, a bayyane.\""
    },
    {
      "ayah": 9,
      "arabic": "ثُمَّ إِنِّىٓ أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا",
      "english": "Then I announced to them and [also] confided to them secretly",
      "hausa": "\"Sa'an nan lalle ne, na yi yẽkuwa sabõda su, kuma na gãna da su a cikin asĩri.\""
    },
    {
      "ayah": 10,
      "arabic": "فَقُلْتُ ٱسْتَغْفِرُوا۟ رَبَّكُمْ إِنَّهُۥ كَانَ غَفَّارًا",
      "english": "And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver.",
      "hausa": "\"Shi na ce, 'Ku nẽmi gãfara daga Ubangijinku, lalle ne shi Ya kasance Mai gãfara ne.\""
    },
    {
      "ayah": 11,
      "arabic": "يُرْسِلِ ٱلسَّمَآءَ عَلَيْكُم مِّدْرَارًا",
      "english": "He will send [rain from] the sky upon you in [continuing] showers",
      "hausa": "\"Ya sako (girgijen) sama a kanku da ruwa mai ɓuɓɓuga.\""
    },
    {
      "ayah": 12,
      "arabic": "وَيُمْدِدْكُم بِأَمْوَٰلٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّـٰتٍ وَيَجْعَل لَّكُمْ أَنْهَـٰرًا",
      "english": "And give you increase in wealth and children and provide for you gardens and provide for you rivers.",
      "hausa": "\"Kuma ya yalwata muku game da dũkiya da ɗiya, Ya sanya muku (albarka) ga gõnaki, kuma Ya sanya muku koguna.\""
    },
    {
      "ayah": 13,
      "arabic": "مَّا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا",
      "english": "What is [the matter] with you that you do not attribute to Allah [due] grandeur",
      "hausa": "\"Me ya sãme ku, bã ku fãtar sãmun natsuwa daga Allah,\""
    },
    {
      "ayah": 14,
      "arabic": "وَقَدْ خَلَقَكُمْ أَطْوَارًا",
      "english": "While He has created you in stages?",
      "hausa": "\"Alhãli kuwa, lalle ne, Ya halitta. ku, a cikin hãlãye?\""
    },
    {
      "ayah": 15,
      "arabic": "أَلَمْ تَرَوْا۟ كَيْفَ خَلَقَ ٱللَّهُ سَبْعَ سَمَـٰوَٰتٍ طِبَاقًا",
      "english": "Do you not consider how Allah has created seven heavens in layers",
      "hausa": "\"Ba ku ga yadda Allah Ya halitta wasu sammai bakwai ɗabaƙõƙĩ a kan jũna ba?\""
    },
    {
      "ayah": 16,
      "arabic": "وَجَعَلَ ٱلْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ ٱلشَّمْسَ سِرَاجًا",
      "english": "And made the moon therein a [reflected] light and made the sun a burning lamp?",
      "hausa": "\"Ya sanya watã a cikinsu, yana mai haske, Ya sanya rãnã babbar fitila?\""
    },
    {
      "ayah": 17,
      "arabic": "وَٱللَّهُ أَنۢبَتَكُم مِّنَ ٱلْأَرْضِ نَبَاتًا",
      "english": "And Allah has caused you to grow from the earth a [progressive] growth.",
      "hausa": "\"Kuma Allah Ya tsirar da ku daga ƙasa (kamar ganye) tsirarwa.\""
    },
    {
      "ayah": 18,
      "arabic": "ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا",
      "english": "Then He will return you into it and extract you [another] extraction.",
      "hausa": "\"Sa'an nan Ya mayar da ku a cikinta, kuma Ya fitar da ku fitarwa.\""
    },
    {
      "ayah": 19,
      "arabic": "وَٱللَّهُ جَعَلَ لَكُمُ ٱلْأَرْضَ بِسَاطًا",
      "english": "And Allah has made for you the earth an expanse",
      "hausa": "\"Kuma Allah Ya sanya muku ƙasa shimfidaɗɗiya.\""
    },
    {
      "ayah": 20,
      "arabic": "لِّتَسْلُكُوا۟ مِنْهَا سُبُلًا فِجَاجًا",
      "english": "That you may follow therein roads of passage.' \"",
      "hausa": "\"Dõmin ku shiga a cikinta, hanyõyi mãsu fãɗi.\""
    },
    {
      "ayah": 21,
      "arabic": "قَالَ نُوحٌ رَّبِّ إِنَّهُمْ عَصَوْنِى وَٱتَّبَعُوا۟ مَن لَّمْ يَزِدْهُ مَالُهُۥ وَوَلَدُهُۥٓ إِلَّا خَسَارًا",
      "english": "Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss.",
      "hausa": "Nũhu ya ce: \"Ya Ubangijina! Lalle ne sũ sun saɓa mini sun bi wanda dukiyarsa da ɗiyansa ba su ƙãre shi da kõme ba sai da hasãra.\""
    },
    {
      "ayah": 22,
      "arabic": "وَمَكَرُوا۟ مَكْرًا كُبَّارًا",
      "english": "And they conspired an immense conspiracy.",
      "hausa": "\"Kuma sun yi wani mãkirci, mãkirci babba.\""
    },
    {
      "ayah": 23,
      "arabic": "وَقَالُوا۟ لَا تَذَرُنَّ ءَالِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا",
      "english": "And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.",
      "hausa": "\"Kuma suka ce: Faufau kada ku bar gumãkanku, kuma faufau, kada ku bar wadda, kuma kada ku bar suwã kuma kada ku bar Yagũsa da Ya'ũƙa da Nasra.\""
    },
    {
      "ayah": 24,
      "arabic": "وَقَدْ أَضَلُّوا۟ كَثِيرًا ۖ وَلَا تَزِدِ ٱلظَّـٰلِمِينَ إِلَّا ضَلَـٰلًا",
      "english": "And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error.\"",
      "hausa": "\"Kuma lalle ne sun ɓatar da (mutãne) mãsu yawa, kuma kada Ka ƙãrã wa azzãlumai (kõme) sai ɓata.\""
    },
    {
      "ayah": 25,
      "arabic": "مِّمَّا خَطِيٓـَٔـٰتِهِمْ أُغْرِقُوا۟ فَأُدْخِلُوا۟ نَارًا فَلَمْ يَجِدُوا۟ لَهُم مِّن دُونِ ٱللَّهِ أَنصَارًا",
      "english": "Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers.",
      "hausa": "Sabõda laifukansu na ganganci aka nutsar da su, sa'an nan aka sanya su a wuta. Saboda haka ba su sãmã wa kansu wani mataimaki wanin Allah ba."
    },
    {
      "ayah": 26,
      "arabic": "وَقَالَ نُوحٌ رَّبِّ لَا تَذَرْ عَلَى ٱلْأَرْضِ مِنَ ٱلْكَـٰفِرِينَ دَيَّارًا",
      "english": "And Noah said, \"My Lord, do not leave upon the earth from among the disbelievers an inhabitant.",
      "hausa": "Kuma Nũhu ya ce: \"Ya Ublngijina! Kada Ka bari, a kan ƙasa, daga cikin kãfirai, wanda ke zama a cikin gida.\""
    },
    {
      "ayah": 27,
      "arabic": "إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا۟ عِبَادَكَ وَلَا يَلِدُوٓا۟ إِلَّا فَاجِرًا كَفَّارًا",
      "english": "Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever.",
      "hausa": "\"Lalle ne, Kai idan Ka bar su, zã su ɓatar da bãyinKa, kuma bã zã su haifi kowa ba fãce fãjiri mai yawan kãfirci\""
    },
    {
      "ayah": 28,
      "arabic": "رَّبِّ ٱغْفِرْ لِى وَلِوَٰلِدَىَّ وَلِمَن دَخَلَ بَيْتِىَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ وَلَا تَزِدِ ٱلظَّـٰلِمِينَ إِلَّا تَبَارًۢا",
      "english": "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\"",
      "hausa": "\"Ya Ubanginjina! Ka yi mini gãfara (ni) da mahaifana biyu, da wanda ya shiga gidana, yana mai ĩmãni, da mũminai maza da mũminai mãtã, kuma kada Ka ƙãrã wa azzãlumai kõme sai halaka.\""
    }
  ]
}