{
  "surah": 36,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "يسٓ",
      "english": "Ya, Seen.",
      "hausa": "Y. S̃."
    },
    {
      "ayah": 2,
      "arabic": "وَٱلْقُرْءَانِ ٱلْحَكِيمِ",
      "english": "By the wise Qur'an.",
      "hausa": "Inã rantsuwa da Al-ƙur'ãni Mai hikima."
    },
    {
      "ayah": 3,
      "arabic": "إِنَّكَ لَمِنَ ٱلْمُرْسَلِينَ",
      "english": "Indeed you, [O Muhammad], are from among the messengers,",
      "hausa": "Lalle kai, haƙĩƙa kanã cikinManzanni."
    },
    {
      "ayah": 4,
      "arabic": "عَلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
      "english": "On a straight path.",
      "hausa": "A kan hanya madaidaiciya."
    },
    {
      "ayah": 5,
      "arabic": "تَنزِيلَ ٱلْعَزِيزِ ٱلرَّحِيمِ",
      "english": "[This is] a revelation of the Exalted in Might, the Merciful,",
      "hausa": "(Allah Ya saukar da Al-kur'ãni) saukarwar Mabuwãyi, Mai jin ƙai."
    },
    {
      "ayah": 6,
      "arabic": "لِتُنذِرَ قَوْمًا مَّآ أُنذِرَ ءَابَآؤُهُمْ فَهُمْ غَـٰفِلُونَ",
      "english": "That you may warn a people whose forefathers were not warned, so they are unaware.",
      "hausa": "Dõmin ka yi gargaɗi ga waɗansu mutãne da ba a yi gargaɗi ga ubanninsu ba, sabõda haka sũmasu rafkana ne."
    },
    {
      "ayah": 7,
      "arabic": "لَقَدْ حَقَّ ٱلْقَوْلُ عَلَىٰٓ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ",
      "english": "Already the word has come into effect upon most of them, so they do not believe.",
      "hausa": "Lalle, haƙĩƙa, kalma tã wajaba a kan mafi yawansu, dõmin sũ, bã zã su yi ĩmãni ba."
    },
    {
      "ayah": 8,
      "arabic": "إِنَّا جَعَلْنَا فِىٓ أَعْنَـٰقِهِمْ أَغْلَـٰلًا فَهِىَ إِلَى ٱلْأَذْقَانِ فَهُم مُّقْمَحُونَ",
      "english": "Indeed, We have put shackles on their necks, and they are to their chins, so they are with heads [kept] aloft.",
      "hausa": "Lalle Mũ, Mun sanya ƙuƙumma a cikin wuyõyinsu, sa'an nan sũ (ƙuƙumman sun kai) har zuwa ga haɓõɓinsu, sabõda haka, sũ banƙararru ne."
    },
    {
      "ayah": 9,
      "arabic": "وَجَعَلْنَا مِنۢ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَـٰهُمْ فَهُمْ لَا يُبْصِرُونَ",
      "english": "And We have put before them a barrier and behind them a barrier and covered them, so they do not see.",
      "hausa": "Kuma Muka sanya wata tõshiya a gaba gare su, da wata tõshiya a bãyansu, sabõda haka Muka rufe su, sai suka zama bã su gani."
    },
    {
      "ayah": 10,
      "arabic": "وَسَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ",
      "english": "And it is all the same for them whether you warn them or do not warn them - they will not believe.",
      "hausa": "Kuma daidai yake a gare su, shin, ka yi musu gargaɗi kõ ba ka yi musu gargaɗi ba, sũ bã zã su yi ĩmãni ba."
    },
    {
      "ayah": 11,
      "arabic": "إِنَّمَا تُنذِرُ مَنِ ٱتَّبَعَ ٱلذِّكْرَ وَخَشِىَ ٱلرَّحْمَـٰنَ بِٱلْغَيْبِ ۖ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ",
      "english": "You can only warn one who follows the message and fears the Most Merciful unseen. So give him good tidings of forgiveness and noble reward.",
      "hausa": "Kanã yin gargaɗi kawai ga wanda ya bi Alƙur'ãni ne, kuma ya ji tsõron mai rahama a fake. To, ka yi masa bushãra da gãfara da wani sakamako na karimci."
    },
    {
      "ayah": 12,
      "arabic": "إِنَّا نَحْنُ نُحْىِ ٱلْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا۟ وَءَاثَـٰرَهُمْ ۚ وَكُلَّ شَىْءٍ أَحْصَيْنَـٰهُ فِىٓ إِمَامٍ مُّبِينٍ",
      "english": "Indeed, it is We who bring the dead to life and record what they have put forth and what they left behind, and all things We have enumerated in a clear register.",
      "hausa": "Lalle Mũ, Mũ ne ke rãyar da matattu kuma Mu rubũta abin da suka gabãtar, da gurãbunsu, kuma kõwane abu Mun ƙididdige shi, a cikin babban Littãfi Mabayyani."
    },
    {
      "ayah": 13,
      "arabic": "وَٱضْرِبْ لَهُم مَّثَلًا أَصْحَـٰبَ ٱلْقَرْيَةِ إِذْ جَآءَهَا ٱلْمُرْسَلُونَ",
      "english": "And present to them an example: the people of the city, when the messengers came to it -",
      "hausa": "Kuma ka buga musu misãli: Waɗansu ma'abũta alƙarya, a lõkacin da Manzanni suka jẽ mata."
    },
    {
      "ayah": 14,
      "arabic": "إِذْ أَرْسَلْنَآ إِلَيْهِمُ ٱثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوٓا۟ إِنَّآ إِلَيْكُم مُّرْسَلُونَ",
      "english": "When We sent to them two but they denied them, so We strengthened them with a third, and they said, \"Indeed, we are messengers to you.\"",
      "hausa": "A lõkacin da Muka aika (Manzannin) biyu zuwa gare su, sai suka ƙaryata su, sa'an nan Muka ƙarfafa (su) da na uku, sai suka ce: \"Lalle mũ, Manzanni ne zuwa gare ku.\""
    },
    {
      "ayah": 15,
      "arabic": "قَالُوا۟ مَآ أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا وَمَآ أَنزَلَ ٱلرَّحْمَـٰنُ مِن شَىْءٍ إِنْ أَنتُمْ إِلَّا تَكْذِبُونَ",
      "english": "They said, \"You are not but human beings like us, and the Most Merciful has not revealed a thing. You are only telling lies.\"",
      "hausa": "Suka ce: \"Kũ ba ku zamo bafãce mutãne ne kamarmu kuma Mai rahama bai saukar da kõme ba, ba ku zamo ba fãce ƙarya kuke yi.\""
    },
    {
      "ayah": 16,
      "arabic": "قَالُوا۟ رَبُّنَا يَعْلَمُ إِنَّآ إِلَيْكُمْ لَمُرْسَلُونَ",
      "english": "They said, \"Our Lord knows that we are messengers to you,",
      "hausa": "Suka ce: \"Ubangijinmu Yã sani, lalle mũ, haƙiƙa Manzanni nezuwa gare ku.\""
    },
    {
      "ayah": 17,
      "arabic": "وَمَا عَلَيْنَآ إِلَّا ٱلْبَلَـٰغُ ٱلْمُبِينُ",
      "english": "And we are not responsible except for clear notification.\"",
      "hausa": "\"Kuma bãbu abin da ke kanmu, fãce iyar da manzanci bayyananne.\""
    },
    {
      "ayah": 18,
      "arabic": "قَالُوٓا۟ إِنَّا تَطَيَّرْنَا بِكُمْ ۖ لَئِن لَّمْ تَنتَهُوا۟ لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٌ",
      "english": "They said, \"Indeed, we consider you a bad omen. If you do not desist, we will surely stone you, and there will surely touch you, from us, a painful punishment.\"",
      "hausa": "Suka ce: \"Lalle mũ munã shu'umci da ku! Haƙĩƙa idan ba ku, hanu ba, haƙĩƙa, zã mu jẽfe ku, kuma haƙĩƙa wata azãba mai raɗaɗi daga gare mu zã ta shãfe ku.\""
    },
    {
      "ayah": 19,
      "arabic": "قَالُوا۟ طَـٰٓئِرُكُم مَّعَكُمْ ۚ أَئِن ذُكِّرْتُم ۚ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ",
      "english": "They said, \"Your omen is with yourselves. Is it because you were reminded? Rather, you are a transgressing people.\"",
      "hausa": "Suka ce: \"Shu'umcinku, yanã tãre da ku. Ashe, dõmin an tunãtar da ku? Ã'a, kũ dai mutãne ne mãsu ƙẽtare haddi.\""
    },
    {
      "ayah": 20,
      "arabic": "وَجَآءَ مِنْ أَقْصَا ٱلْمَدِينَةِ رَجُلٌ يَسْعَىٰ قَالَ يَـٰقَوْمِ ٱتَّبِعُوا۟ ٱلْمُرْسَلِينَ",
      "english": "And there came from the farthest end of the city a man, running. He said, \"O my people, follow the messengers.",
      "hausa": "Kuma wani mutum daga mafi nĩsan birnin ya je, yanã tafiya da gaggãwa, ya ce: \"Ya mutãnẽna! Ku bi Manzannin nan."
    },
    {
      "ayah": 21,
      "arabic": "ٱتَّبِعُوا۟ مَن لَّا يَسْـَٔلُكُمْ أَجْرًا وَهُم مُّهْتَدُونَ",
      "english": "Follow those who do not ask of you [any] payment, and they are [rightly] guided.",
      "hausa": "\"Ku bi waɗanda bã su tambayar ku wata ijãra kuma sũ shiryayyu ne.\""
    },
    {
      "ayah": 22,
      "arabic": "وَمَا لِىَ لَآ أَعْبُدُ ٱلَّذِى فَطَرَنِى وَإِلَيْهِ تُرْجَعُونَ",
      "english": "And why should I not worship He who created me and to whom you will be returned?",
      "hausa": "\"Kuma mene ne a gare ni, bã zan bauta wa Wanda Ya ƙãga halittata ba, kuma zuwa gare Shi ake mayar da ku?\""
    },
    {
      "ayah": 23,
      "arabic": "ءَأَتَّخِذُ مِن دُونِهِۦٓ ءَالِهَةً إِن يُرِدْنِ ٱلرَّحْمَـٰنُ بِضُرٍّ لَّا تُغْنِ عَنِّى شَفَـٰعَتُهُمْ شَيْـًٔا وَلَا يُنقِذُونِ",
      "english": "Should I take other than Him [false] deities [while], if the Most Merciful intends for me some adversity, their intercession will not avail me at all, nor can they save me?",
      "hausa": "\"Shin, zan riƙi waninSa abũbuwan bautãwa? Idan Mai rahama Ya nufe ni da wata cũta, to cẽtonsu bã ya amfanĩna da kõme, kuma bã za su iya tsãmar da ni bã.\""
    },
    {
      "ayah": 24,
      "arabic": "إِنِّىٓ إِذًا لَّفِى ضَلَـٰلٍ مُّبِينٍ",
      "english": "Indeed, I would then be in manifest error.",
      "hausa": "\"Lalle nĩ, a lõkacin nan, tabbas, inã a cikin ɓata bayyananna.\""
    },
    {
      "ayah": 25,
      "arabic": "إِنِّىٓ ءَامَنتُ بِرَبِّكُمْ فَٱسْمَعُونِ",
      "english": "Indeed, I have believed in your Lord, so listen to me.\"",
      "hausa": "\"Lalle ni, nã yi ĩmãni da Ubangijinku, sabõda haka ku saurãre ni.\""
    },
    {
      "ayah": 26,
      "arabic": "قِيلَ ٱدْخُلِ ٱلْجَنَّةَ ۖ قَالَ يَـٰلَيْتَ قَوْمِى يَعْلَمُونَ",
      "english": "It was said, \"Enter Paradise.\" He said, \"I wish my people could know",
      "hausa": "Aka ce (masa), \"Ka shiga Aljanna.\" Ya ce, \"Dã dai a ce mutãnẽna sunã iya sani.\""
    },
    {
      "ayah": 27,
      "arabic": "بِمَا غَفَرَ لِى رَبِّى وَجَعَلَنِى مِنَ ٱلْمُكْرَمِينَ",
      "english": "Of how my Lord has forgiven me and placed me among the honored.\"",
      "hausa": "\"Game da gãfarar da Ubangijjĩna ya yi mini, kuma Ya sanya ni a cikin waɗanda aka girmama.\""
    },
    {
      "ayah": 28,
      "arabic": "وَمَآ أَنزَلْنَا عَلَىٰ قَوْمِهِۦ مِنۢ بَعْدِهِۦ مِن جُندٍ مِّنَ ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ",
      "english": "And We did not send down upon his people after him any soldiers from the heaven, nor would We have done so.",
      "hausa": "Kuma ba Mu saukar da waɗansu runduna ba daga sama a kan (halaka) mutãnensa, daga bãyansa, kuma bã zã Mu kasance. Mãsu saukarwa ba."
    },
    {
      "ayah": 29,
      "arabic": "إِن كَانَتْ إِلَّا صَيْحَةً وَٰحِدَةً فَإِذَا هُمْ خَـٰمِدُونَ",
      "english": "It was not but one shout, and immediately they were extinguished.",
      "hausa": "Ba ta kasance ba face tsawa guda, sa'an nan sai gã su sõmammu."
    },
    {
      "ayah": 30,
      "arabic": "يَـٰحَسْرَةً عَلَى ٱلْعِبَادِ ۚ مَا يَأْتِيهِم مِّن رَّسُولٍ إِلَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ",
      "english": "How regretful for the servants. There did not come to them any messenger except that they used to ridicule him.",
      "hausa": "Yã nadãma a kan bãyĩNa! Wani Manzo bã ya zuwa gare su fãce sun kasance sunã mãsu yi masa izgili."
    },
    {
      "ayah": 31,
      "arabic": "أَلَمْ يَرَوْا۟ كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ ٱلْقُرُونِ أَنَّهُمْ إِلَيْهِمْ لَا يَرْجِعُونَ",
      "english": "Have they not considered how many generations We destroyed before them - that they to them will not return?",
      "hausa": "Ba su gani ba, da yawa Muka halakar da (mutãnen) ƙarnõni a gabãninsu kuma cẽwa su bã zã su kõmo ba?"
    },
    {
      "ayah": 32,
      "arabic": "وَإِن كُلٌّ لَّمَّا جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ",
      "english": "And indeed, all of them will yet be brought present before Us.",
      "hausa": "Kuma lalle bãbu kõwa fãce waɗanda ake halartarwa ne a wurinMu."
    },
    {
      "ayah": 33,
      "arabic": "وَءَايَةٌ لَّهُمُ ٱلْأَرْضُ ٱلْمَيْتَةُ أَحْيَيْنَـٰهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ",
      "english": "And a sign for them is the dead earth. We have brought it to life and brought forth from it grain, and from it they eat.",
      "hausa": "Kuma ãyã ce a gare su: ¡asã matacciya, Mu rãyar da ita, Mu fitar da ƙwãya daga gare ta, sai gã shi daga gare ta suke ci."
    },
    {
      "ayah": 34,
      "arabic": "وَجَعَلْنَا فِيهَا جَنَّـٰتٍ مِّن نَّخِيلٍ وَأَعْنَـٰبٍ وَفَجَّرْنَا فِيهَا مِنَ ٱلْعُيُونِ",
      "english": "And We placed therein gardens of palm trees and grapevines and caused to burst forth therefrom some springs -",
      "hausa": "Kuma Muka sanya, a cikinta (ƙasã), waɗansu gõnaki na dabĩno da inabõbi, kuma Muka ɓuɓɓugar da ruwa daga marẽmari a cikinta."
    },
    {
      "ayah": 35,
      "arabic": "لِيَأْكُلُوا۟ مِن ثَمَرِهِۦ وَمَا عَمِلَتْهُ أَيْدِيهِمْ ۖ أَفَلَا يَشْكُرُونَ",
      "english": "That they may eat of His fruit. And their hands have not produced it, so will they not be grateful?",
      "hausa": "Dõmin su ci 'ya'yan itãcensa, alhãli kuwa hannãyensu ba su aikata shi ba. Shin, to, bã zã su gõdẽ ba?"
    },
    {
      "ayah": 36,
      "arabic": "سُبْحَـٰنَ ٱلَّذِى خَلَقَ ٱلْأَزْوَٰجَ كُلَّهَا مِمَّا تُنۢبِتُ ٱلْأَرْضُ وَمِنْ أَنفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ",
      "english": "Exalted is He who created all pairs - from what the earth grows and from themselves and from that which they do not know.",
      "hausa": "Tsarki ya tabbata ga Wanda Ya halitta nau'uka, namiji da mace, dukansu, daga abin da ƙasã ke tsirarwa, kuma daga kansu, kuma daga abin da ba su sani ba."
    },
    {
      "ayah": 37,
      "arabic": "وَءَايَةٌ لَّهُمُ ٱلَّيْلُ نَسْلَخُ مِنْهُ ٱلنَّهَارَ فَإِذَا هُم مُّظْلِمُونَ",
      "english": "And a sign for them is the night. We remove from it [the light of] day, so they are [left] in darkness.",
      "hausa": "Kuma ãyã ce a gare su: Dare Muna feɗe rãna daga gare shi, sai gã su sunã mãsu shiga duhu."
    },
    {
      "ayah": 38,
      "arabic": "وَٱلشَّمْسُ تَجْرِى لِمُسْتَقَرٍّ لَّهَا ۚ ذَٰلِكَ تَقْدِيرُ ٱلْعَزِيزِ ٱلْعَلِيمِ",
      "english": "And the sun runs [on course] toward its stopping point. That is the determination of the Exalted in Might, the Knowing.",
      "hausa": "Kuma rãnã tanã gudãna zuwa ga wani matabbaci nãta. Wannan ƙaddarãwar Mabuwãyi ne, Masani."
    },
    {
      "ayah": 39,
      "arabic": "وَٱلْقَمَرَ قَدَّرْنَـٰهُ مَنَازِلَ حَتَّىٰ عَادَ كَٱلْعُرْجُونِ ٱلْقَدِيمِ",
      "english": "And the moon - We have determined for it phases, until it returns [appearing] like the old date stalk.",
      "hausa": "Kuma da watã Mun ƙaddara masa manzilõli, har ya kõma kamar tsumagiyar murlin dabĩno wadda ta tsũfa."
    },
    {
      "ayah": 40,
      "arabic": "لَا ٱلشَّمْسُ يَنۢبَغِى لَهَآ أَن تُدْرِكَ ٱلْقَمَرَ وَلَا ٱلَّيْلُ سَابِقُ ٱلنَّهَارِ ۚ وَكُلٌّ فِى فَلَكٍ يَسْبَحُونَ",
      "english": "It is not allowable for the sun to reach the moon, nor does the night overtake the day, but each, in an orbit, is swimming.",
      "hausa": "Rãnã bã ya kamãta a gare ta, ta riski watã. Kuma dare bã ya kamãta a gare shi ya zama mai tsẽre wa yini, kuma dukansua cikin sarari guda suke yin iyo."
    },
    {
      "ayah": 41,
      "arabic": "وَءَايَةٌ لَّهُمْ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِى ٱلْفُلْكِ ٱلْمَشْحُونِ",
      "english": "And a sign for them is that We carried their forefathers in a laden ship.",
      "hausa": "Kuma ãyã ce a gare su. Lalle Mũ, Mun ɗauki zuriyarsu a cikin jirgin, wanda aka yi wa lõdi."
    },
    {
      "ayah": 42,
      "arabic": "وَخَلَقْنَا لَهُم مِّن مِّثْلِهِۦ مَا يَرْكَبُونَ",
      "english": "And We created for them from the likes of it that which they ride.",
      "hausa": "Kuma Muka halitta musu, daga irinsa, abin da suke hawa."
    },
    {
      "ayah": 43,
      "arabic": "وَإِن نَّشَأْ نُغْرِقْهُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُنقَذُونَ",
      "english": "And if We should will, We could drown them; then no one responding to a cry would there be for them, nor would they be saved",
      "hausa": "Kuma idan Mun so, zã Mu nutsar da su, har bãbu kururuwar neman ãgaji, a gare su, kuma ba su zama anã tsirar da su ba."
    },
    {
      "ayah": 44,
      "arabic": "إِلَّا رَحْمَةً مِّنَّا وَمَتَـٰعًا إِلَىٰ حِينٍ",
      "english": "Except as a mercy from Us and provision for a time.",
      "hausa": "Sai fa bisa ga wata rahama daga gare Mu, da jiyarwa dãɗi zuwa ga wani ɗan lõkaci."
    },
    {
      "ayah": 45,
      "arabic": "وَإِذَا قِيلَ لَهُمُ ٱتَّقُوا۟ مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُونَ",
      "english": "But when it is said to them, \"Beware of what is before you and what is behind you; perhaps you will receive mercy... \"",
      "hausa": "Kuma idan aka ce musu, \"Ku kãre abin da ke a gaba gare ku da abin da yake a bãyanku, dõmin tsammãninku a ji tausayinku.\""
    },
    {
      "ayah": 46,
      "arabic": "وَمَا تَأْتِيهِم مِّنْ ءَايَةٍ مِّنْ ءَايَـٰتِ رَبِّهِمْ إِلَّا كَانُوا۟ عَنْهَا مُعْرِضِينَ",
      "english": "And no sign comes to them from the signs of their Lord except that they are from it turning away.",
      "hausa": "Kuma wata ãyã daga ãyõyin Ubangijinsu bã ta zuwa a gare su, sai sun kasance sunã mãsu bijirẽwa daga gare ta."
    },
    {
      "ayah": 47,
      "arabic": "وَإِذَا قِيلَ لَهُمْ أَنفِقُوا۟ مِمَّا رَزَقَكُمُ ٱللَّهُ قَالَ ٱلَّذِينَ كَفَرُوا۟ لِلَّذِينَ ءَامَنُوٓا۟ أَنُطْعِمُ مَن لَّوْ يَشَآءُ ٱللَّهُ أَطْعَمَهُۥٓ إِنْ أَنتُمْ إِلَّا فِى ضَلَـٰلٍ مُّبِينٍ",
      "english": "And when it is said to them, \"Spend from that which Allah has provided for you,\" those who disbelieve say to those who believe, \"Should we feed one whom, if Allah had willed, He would have fed? You are not but in clear error.\"",
      "hausa": "Kuma idan aka ce musu, \"Ku ciyar daga abin da Allah Ya azurta ku,\" sai waɗanda suka kãfirta su ce ga waɗanda suka yi ĩmãni, \"Ashe, zã mu ciyar da wanda idan Allah Ya so Yanã ciyar da shi? Ba ku zama ba fãce a cikin ɓata bayyananniya.\""
    },
    {
      "ayah": 48,
      "arabic": "وَيَقُولُونَ مَتَىٰ هَـٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَـٰدِقِينَ",
      "english": "And they say, \"When is this promise, if you should be truthful?\"",
      "hausa": "Kuma sunã cẽwa, \"A yaushe wannan wa'adi yake (aukuwa) idan kun kasance mãsu gaskiya?\""
    },
    {
      "ayah": 49,
      "arabic": "مَا يَنظُرُونَ إِلَّا صَيْحَةً وَٰحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ",
      "english": "They do not await except one blast which will seize them while they are disputing.",
      "hausa": "Bã su jiran (kõme) fãce wata tsãwa guda, zã ta kãma su, alhãli kuwa sunã yin husũma."
    },
    {
      "ayah": 50,
      "arabic": "فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَآ إِلَىٰٓ أَهْلِهِمْ يَرْجِعُونَ",
      "english": "And they will not be able [to give] any instruction, nor to their people can they return.",
      "hausa": "Bã zã su iya yin wasiyya ba, kuma bã zã su iya kõmãwa zuwa ga iyãlansu ba."
    },
    {
      "ayah": 51,
      "arabic": "وَنُفِخَ فِى ٱلصُّورِ فَإِذَا هُم مِّنَ ٱلْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنسِلُونَ",
      "english": "And the Horn will be blown; and at once from the graves to their Lord they will hasten.",
      "hausa": "Kuma aka yi bũsa a cikin ƙaho, to, sai gã su, daga kaburbura zuwa ga Ubangijinsu, sunã ta gudu."
    },
    {
      "ayah": 52,
      "arabic": "قَالُوا۟ يَـٰوَيْلَنَا مَنۢ بَعَثَنَا مِن مَّرْقَدِنَا ۜ ۗ هَـٰذَا مَا وَعَدَ ٱلرَّحْمَـٰنُ وَصَدَقَ ٱلْمُرْسَلُونَ",
      "english": "They will say, \"O woe to us! Who has raised us up from our sleeping place?\" [The reply will be], \"This is what the Most Merciful had promised, and the messengers told the truth.\"",
      "hausa": "Suka ce: \"Yã bonenmu! Wãne ne ya tãyar da mu daga barcinmu?\" \"Wannan shi ne abin da Mai rahama ya yi wa'adi da shi, kuma Manzanni sun yi gaskiya.\""
    },
    {
      "ayah": 53,
      "arabic": "إِن كَانَتْ إِلَّا صَيْحَةً وَٰحِدَةً فَإِذَا هُمْ جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ",
      "english": "It will not be but one blast, and at once they are all brought present before Us.",
      "hausa": "Ba ta kasance ba fãce wata tsãwa ce guda, sai gã su duka, sunã abin halartarwa a gare Mu."
    },
    {
      "ayah": 54,
      "arabic": "فَٱلْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْـًٔا وَلَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ",
      "english": "So today no soul will be wronged at all, and you will not be recompensed except for what you used to do.",
      "hausa": "To, a yau, bã zã a zãlunci wani rai da kõme ba. Kuma bã zã a sãkã muku ba fãce da abin da kuka kasance kunã aikatãwa."
    },
    {
      "ayah": 55,
      "arabic": "إِنَّ أَصْحَـٰبَ ٱلْجَنَّةِ ٱلْيَوْمَ فِى شُغُلٍ فَـٰكِهُونَ",
      "english": "Indeed the companions of Paradise, that Day, will be amused in [joyful] occupation -",
      "hausa": "Lalle, 'yan Aljanna, a yau, sunã cikin shagali, sunã mãsu nishãɗi."
    },
    {
      "ayah": 56,
      "arabic": "هُمْ وَأَزْوَٰجُهُمْ فِى ظِلَـٰلٍ عَلَى ٱلْأَرَآئِكِ مُتَّكِـُٔونَ",
      "english": "They and their spouses - in shade, reclining on adorned couches.",
      "hausa": "Sũ da mãtan aurensu sunã cikin inuwõwi, a kan karagai, sunã mãsu gincira."
    },
    {
      "ayah": 57,
      "arabic": "لَهُمْ فِيهَا فَـٰكِهَةٌ وَلَهُم مَّا يَدَّعُونَ",
      "english": "For them therein is fruit, and for them is whatever they request [or wish]",
      "hausa": "Sunã da, 'ya'yan itãcen marmari a cikinta kuma sunã sãmun abin da suke kiran a kãwo."
    },
    {
      "ayah": 58,
      "arabic": "سَلَـٰمٌ قَوْلًا مِّن رَّبٍّ رَّحِيمٍ",
      "english": "[And] \"Peace,\" a word from a Merciful Lord.",
      "hausa": "\"Aminci,\" da magana, daga Ubangiji Mai jin ƙai."
    },
    {
      "ayah": 59,
      "arabic": "وَٱمْتَـٰزُوا۟ ٱلْيَوْمَ أَيُّهَا ٱلْمُجْرِمُونَ",
      "english": "[Then He will say], \"But stand apart today, you criminals.",
      "hausa": "\"Ku rarrabe dabam, a yau, yã kũ mãsu laifi!\""
    },
    {
      "ayah": 60,
      "arabic": "أَلَمْ أَعْهَدْ إِلَيْكُمْ يَـٰبَنِىٓ ءَادَمَ أَن لَّا تَعْبُدُوا۟ ٱلشَّيْطَـٰنَ ۖ إِنَّهُۥ لَكُمْ عَدُوٌّ مُّبِينٌ",
      "english": "Did I not enjoin upon you, O children of Adam, that you not worship Satan - [for] indeed, he is to you a clear enemy -",
      "hausa": "\"Ashe, ban yi muku umurni na alkawari ba, yã ɗiyan Ãdamu? Cẽwa kada ku bauta wa Shaiɗan, lalle shĩ, maƙiyi ne a gareku bayyananne?\""
    },
    {
      "ayah": 61,
      "arabic": "وَأَنِ ٱعْبُدُونِى ۚ هَـٰذَا صِرَٰطٌ مُّسْتَقِيمٌ",
      "english": "And that you worship [only] Me? This is a straight path.",
      "hausa": "\"Kuma ku bauta Mini. Wannan ita ce hanya madaidaciya.\""
    },
    {
      "ayah": 62,
      "arabic": "وَلَقَدْ أَضَلَّ مِنكُمْ جِبِلًّا كَثِيرًا ۖ أَفَلَمْ تَكُونُوا۟ تَعْقِلُونَ",
      "english": "And he had already led astray from among you much of creation, so did you not use reason?",
      "hausa": "\"Kuma lalle haƙĩƙa, (Shaiɗan) yã ɓatar da jama'a mãsu yawa daga gare ku. Ashe to ba ku kasance kunã yin hankali ba?\""
    },
    {
      "ayah": 63,
      "arabic": "هَـٰذِهِۦ جَهَنَّمُ ٱلَّتِى كُنتُمْ تُوعَدُونَ",
      "english": "This is the Hellfire which you were promised.",
      "hausa": "\"Wannan ita ce Jahannama wadda kuka kasance anã yi muku wa'adi da ita.\""
    },
    {
      "ayah": 64,
      "arabic": "ٱصْلَوْهَا ٱلْيَوْمَ بِمَا كُنتُمْ تَكْفُرُونَ",
      "english": "[Enter to] burn therein today for what you used to deny.\"",
      "hausa": "\"Ku shigẽ ta a yau, sabõda abin da kuka kasance kunã yi na kãfirci.\""
    },
    {
      "ayah": 65,
      "arabic": "ٱلْيَوْمَ نَخْتِمُ عَلَىٰٓ أَفْوَٰهِهِمْ وَتُكَلِّمُنَآ أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُم بِمَا كَانُوا۟ يَكْسِبُونَ",
      "english": "That Day, We will seal over their mouths, and their hands will speak to Us, and their feet will testify about what they used to earn.",
      "hausa": "A yau, Munã sanya hãtimin rufi a kan bãkunansu, kuma hannãyensu su yi Mana magana, kuma ƙafãfunsu su yi shaidu da abin da suka kasance sunã aikatãwa."
    },
    {
      "ayah": 66,
      "arabic": "وَلَوْ نَشَآءُ لَطَمَسْنَا عَلَىٰٓ أَعْيُنِهِمْ فَٱسْتَبَقُوا۟ ٱلصِّرَٰطَ فَأَنَّىٰ يُبْصِرُونَ",
      "english": "And if We willed, We could have obliterated their eyes, and they would race to [find] the path, and how could they see?",
      "hausa": "Dã Mun so, dã Mun shãfe gani daga idãnunsu, sai su yi tsẽre ga hanya, to, yaya zã su yi gani?"
    },
    {
      "ayah": 67,
      "arabic": "وَلَوْ نَشَآءُ لَمَسَخْنَـٰهُمْ عَلَىٰ مَكَانَتِهِمْ فَمَا ٱسْتَطَـٰعُوا۟ مُضِيًّا وَلَا يَرْجِعُونَ",
      "english": "And if We willed, We could have deformed them, [paralyzing them] in their places so they would not be able to proceed, nor could they return.",
      "hausa": "Kuma da Mun so, da Mun juyar da halittarsu a kan halinsu, saboda haka ba zã su iya shuɗewa ba, kuma ba zã su komo ba."
    },
    {
      "ayah": 68,
      "arabic": "وَمَن نُّعَمِّرْهُ نُنَكِّسْهُ فِى ٱلْخَلْقِ ۖ أَفَلَا يَعْقِلُونَ",
      "english": "And he to whom We grant long life We reverse in creation; so will they not understand?",
      "hausa": "Kuma wanda Muka rãya shi, Manã sunkuyar da shi ga halittarsa. Ashe, bã su hankalta?"
    },
    {
      "ayah": 69,
      "arabic": "وَمَا عَلَّمْنَـٰهُ ٱلشِّعْرَ وَمَا يَنۢبَغِى لَهُۥٓ ۚ إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْءَانٌ مُّبِينٌ",
      "english": "And We did not give Prophet Muhammad, knowledge of poetry, nor is it befitting for him. It is not but a message and a clear Qur'an",
      "hausa": "Ba Mu sanar da shi (Annabi) wãkã ba, kuma wãkã ba ta kamãta da shi (Annabi) ba. Shi (Al-ƙur'ãni) bai zama ba fãce tunãtarwa ce, da abin karãtu bayyananne."
    },
    {
      "ayah": 70,
      "arabic": "لِّيُنذِرَ مَن كَانَ حَيًّا وَيَحِقَّ ٱلْقَوْلُ عَلَى ٱلْكَـٰفِرِينَ",
      "english": "To warn whoever is alive and justify the word against the disbelievers.",
      "hausa": "Dõmin ya yi gargaɗi ga wanda ya kasance mai rai, kuma magana ta wajaba a kan kãfirai."
    },
    {
      "ayah": 71,
      "arabic": "أَوَلَمْ يَرَوْا۟ أَنَّا خَلَقْنَا لَهُم مِّمَّا عَمِلَتْ أَيْدِينَآ أَنْعَـٰمًا فَهُمْ لَهَا مَـٰلِكُونَ",
      "english": "Do they not see that We have created for them from what Our hands have made, grazing livestock, and [then] they are their owners?",
      "hausa": "Shin, ba su gani ba (cẽwa) lalle Mun halitta musu dabbõbi daga abin da HannayenMu suka aikata, sai sunã mallakar su?"
    },
    {
      "ayah": 72,
      "arabic": "وَذَلَّلْنَـٰهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ",
      "english": "And We have tamed them for them, so some of them they ride, and some of them they eat.",
      "hausa": "Kuma Muka hõre su, sabõda su, sabõda haka daga gare su abin hawansu yake, kuma daga gare su suke ci."
    },
    {
      "ayah": 73,
      "arabic": "وَلَهُمْ فِيهَا مَنَـٰفِعُ وَمَشَارِبُ ۖ أَفَلَا يَشْكُرُونَ",
      "english": "And for them therein are [other] benefits and drinks, so will they not be grateful?",
      "hausa": "Kuma sunã da waɗansu amfãnõni a cikinsu, da abũbuwan shã. Ashe fa, bã zã; su gõdẽ ba?"
    },
    {
      "ayah": 74,
      "arabic": "وَٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ ءَالِهَةً لَّعَلَّهُمْ يُنصَرُونَ",
      "english": "But they have taken besides Allah [false] deities that perhaps they would be helped.",
      "hausa": "Kuma suka riƙi waɗansu abũbuwan bautãwa wanin Allah, ɗammãninsu zã su taimake su."
    },
    {
      "ayah": 75,
      "arabic": "لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُندٌ مُّحْضَرُونَ",
      "english": "They are not able to help them, and they [themselves] are for them soldiers in attendance.",
      "hausa": "Bã zã su iya taimakonsu ba, alhãli kuwa sũ runduna ce wadda ake halartarwa (a cikin wutã)."
    },
    {
      "ayah": 76,
      "arabic": "فَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ",
      "english": "So let not their speech grieve you. Indeed, We know what they conceal and what they declare.",
      "hausa": "Sabõda haka, kada maganarsu ta ɓãta maka rai. Lalle Mũ, Munã sanin abin da suke asirtãwa da abin da suke bayyanãwa."
    },
    {
      "ayah": 77,
      "arabic": "أَوَلَمْ يَرَ ٱلْإِنسَـٰنُ أَنَّا خَلَقْنَـٰهُ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ",
      "english": "Does man not consider that We created him from a [mere] sperm-drop - then at once he is a clear adversary?",
      "hausa": "Ashe, kuma mutum bai ga (cẽwa) lalle Mũ, Mun halitta shi daga maniyyi ba, sai gã shi mai yawan husũma, mai bayyanãwar husũmar."
    },
    {
      "ayah": 78,
      "arabic": "وَضَرَبَ لَنَا مَثَلًا وَنَسِىَ خَلْقَهُۥ ۖ قَالَ مَن يُحْىِ ٱلْعِظَـٰمَ وَهِىَ رَمِيمٌ",
      "english": "And he presents for Us an example and forgets his [own] creation. He says, \"Who will give life to bones while they are disintegrated?\"",
      "hausa": "Kuma ya buga Mana wani misãli, kuma ya manta da halittarsa, ya ce: \"Wãne ne ke rãyar da ƙasũsuwa alhãli kuwa sunã rududdugaggu?\""
    },
    {
      "ayah": 79,
      "arabic": "قُلْ يُحْيِيهَا ٱلَّذِىٓ أَنشَأَهَآ أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ",
      "english": "Say, \"He will give them life who produced them the first time; and He is, of all creation, Knowing.\"",
      "hausa": "Ka ce: \"Wanda ya ƙãga halittarsu a farkon lõkaci Shĩ ke rãyar da su, kuma Shi, game da kõwace halitta, Mai ilmi ne.\""
    },
    {
      "ayah": 80,
      "arabic": "ٱلَّذِى جَعَلَ لَكُم مِّنَ ٱلشَّجَرِ ٱلْأَخْضَرِ نَارًا فَإِذَآ أَنتُم مِّنْهُ تُوقِدُونَ",
      "english": "[It is] He who made for you from the green tree, fire, and then from it you ignite.",
      "hausa": "\"Wanda ya sanya muku wutã daga itãce kõre, sai gã ku kunã kunnãwa daga gare shi.\""
    },
    {
      "ayah": 81,
      "arabic": "أَوَلَيْسَ ٱلَّذِى خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ بِقَـٰدِرٍ عَلَىٰٓ أَن يَخْلُقَ مِثْلَهُم ۚ بَلَىٰ وَهُوَ ٱلْخَلَّـٰقُ ٱلْعَلِيمُ",
      "english": "Is not He who created the heavens and the earth Able to create the likes of them? Yes, [it is so]; and He is the Knowing Creator.",
      "hausa": "\"Shin, kuma Wanda Ya halitta sammai da ƙasã bai zama Mai ĩkon yi ba ga Ya halitta kwatankwacinsu? Na'am, zai iya! Kuma Shĩ Mai yawan halittãwa ne, Mai ilmi.\""
    },
    {
      "ayah": 82,
      "arabic": "إِنَّمَآ أَمْرُهُۥٓ إِذَآ أَرَادَ شَيْـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ",
      "english": "His command is only when He intends a thing that He says to it, \"Be,\" and it is.",
      "hausa": "UmurninSa idan Yã yi nufin wani abu sai Ya ce masa kawai, \"Ka kasance,\" sai yana kasancewa (kamar yadda Yake nufi)."
    },
    {
      "ayah": 83,
      "arabic": "فَسُبْحَـٰنَ ٱلَّذِى بِيَدِهِۦ مَلَكُوتُ كُلِّ شَىْءٍ وَإِلَيْهِ تُرْجَعُونَ",
      "english": "So exalted is He in whose hand is the realm of all things, and to Him you will be returned.",
      "hausa": "Sabõda haka, tsarki yã tabbata ga Wanda mallakar kõwane abu take ga HannãyenSa, kuma zuwa gare Shi ake mayar da ku."
    }
  ]
}