{
  "surah": 51,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "وَٱلذَّٰرِيَـٰتِ ذَرْوًا",
      "english": "By those [winds] scattering [dust] dispersing",
      "hausa": "Inã rantsuwa da iskõki mãsu shẽkar abũbuwa, shẽƙẽwa."
    },
    {
      "ayah": 2,
      "arabic": "فَٱلْحَـٰمِلَـٰتِ وِقْرًا",
      "english": "And those [clouds] carrying a load [of water]",
      "hausa": "Sa'an nan da girãgizai mãsu ɗaukar nauyi (na ruwa)."
    },
    {
      "ayah": 3,
      "arabic": "فَٱلْجَـٰرِيَـٰتِ يُسْرًا",
      "english": "And those [ships] sailing with ease",
      "hausa": "Sa'an nan da jirãge mãsu gudãna (a kan ruwa) da sauƙi."
    },
    {
      "ayah": 4,
      "arabic": "فَٱلْمُقَسِّمَـٰتِ أَمْرًا",
      "english": "And those [angels] apportioning [each] matter,",
      "hausa": "Sa'an nan da Malã'iku mãsu rabon al'amari (bisa umurnin Allah)."
    },
    {
      "ayah": 5,
      "arabic": "إِنَّمَا تُوعَدُونَ لَصَادِقٌ",
      "english": "Indeed, what you are promised is true.",
      "hausa": "Lalle abin da ake yi muku alkawari (da zuwansa), haƙĩƙa gaskiya ne."
    },
    {
      "ayah": 6,
      "arabic": "وَإِنَّ ٱلدِّينَ لَوَٰقِعٌ",
      "english": "And indeed, the recompense is to occur.",
      "hausa": "Kuma lalle sakamako (ga ayyukanku), haƙĩƙa, mai aukuwa ne"
    },
    {
      "ayah": 7,
      "arabic": "وَٱلسَّمَآءِ ذَاتِ ٱلْحُبُكِ",
      "english": "By the heaven containing pathways,",
      "hausa": "Inã rantsuwa da samã ma'abũciyar hanyõyi (na tafiyar taurãri da sautin rediyo)."
    },
    {
      "ayah": 8,
      "arabic": "إِنَّكُمْ لَفِى قَوْلٍ مُّخْتَلِفٍ",
      "english": "Indeed, you are in differing speech.",
      "hausa": "Lalle kũ, haƙĩƙa, kunã cikin magana mai sãɓa wa juna (game da Alƙur'ani)."
    },
    {
      "ayah": 9,
      "arabic": "يُؤْفَكُ عَنْهُ مَنْ أُفِكَ",
      "english": "Deluded away from the Qur'an is he who is deluded.",
      "hausa": "Anã karkatar da wanda aka jũyar (daga gaskiya)."
    },
    {
      "ayah": 10,
      "arabic": "قُتِلَ ٱلْخَرَّٰصُونَ",
      "english": "Destroyed are the falsifiers",
      "hausa": "An la'ani mãsu ƙiri-faɗi."
    },
    {
      "ayah": 11,
      "arabic": "ٱلَّذِينَ هُمْ فِى غَمْرَةٍ سَاهُونَ",
      "english": "Who are within a flood [of confusion] and heedless.",
      "hausa": "Waɗanda suke shagala a cikin zurfin jãhilci."
    },
    {
      "ayah": 12,
      "arabic": "يَسْـَٔلُونَ أَيَّانَ يَوْمُ ٱلدِّينِ",
      "english": "They ask, \"When is the Day of Recompense?\"",
      "hausa": "Sunã tambaya: \"Yaushe ne rãnar sakamako zã ta auku?\""
    },
    {
      "ayah": 13,
      "arabic": "يَوْمَ هُمْ عَلَى ٱلنَّارِ يُفْتَنُونَ",
      "english": "[It is] the Day they will be tormented over the Fire",
      "hausa": "Ranar da suke a kan wuta anã fitinar su."
    },
    {
      "ayah": 14,
      "arabic": "ذُوقُوا۟ فِتْنَتَكُمْ هَـٰذَا ٱلَّذِى كُنتُم بِهِۦ تَسْتَعْجِلُونَ",
      "english": "[And will be told], \"Taste your torment. This is that for which you were impatient.\"",
      "hausa": "(A ce musu): \"Ku ɗanɗani fitinarku, wannan shĩ ne abin da kuka kasance kunã nẽman zuwansa da gaggãwa.\""
    },
    {
      "ayah": 15,
      "arabic": "إِنَّ ٱلْمُتَّقِينَ فِى جَنَّـٰتٍ وَعُيُونٍ",
      "english": "Indeed, the righteous will be among gardens and springs,",
      "hausa": "Lalle mãsu taƙawa, sunã a cikin lambunan itãce da marẽmari."
    },
    {
      "ayah": 16,
      "arabic": "ءَاخِذِينَ مَآ ءَاتَىٰهُمْ رَبُّهُمْ ۚ إِنَّهُمْ كَانُوا۟ قَبْلَ ذَٰلِكَ مُحْسِنِينَ",
      "english": "Accepting what their Lord has given them. Indeed, they were before that doers of good.",
      "hausa": "Sunã mãsu dĩbar abin da Ubangijinsu Ya bã su. Lalle sũ, sun kasance mãsu kyautatãwa a gabãnin haka (a dũniya)."
    },
    {
      "ayah": 17,
      "arabic": "كَانُوا۟ قَلِيلًا مِّنَ ٱلَّيْلِ مَا يَهْجَعُونَ",
      "english": "They used to sleep but little of the night,",
      "hausa": "Sun kasance a lõkaci kaɗan na dare suke yin barci."
    },
    {
      "ayah": 18,
      "arabic": "وَبِٱلْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ",
      "english": "And in the hours before dawn they would ask forgiveness,",
      "hausa": "Kuma a lõkutan asuba sunã ta yin istigfãri."
    },
    {
      "ayah": 19,
      "arabic": "وَفِىٓ أَمْوَٰلِهِمْ حَقٌّ لِّلسَّآئِلِ وَٱلْمَحْرُومِ",
      "english": "And from their properties was [given] the right of the [needy] petitioner and the deprived.",
      "hausa": "Kuma a cikin dũkiyarsu akwai hakki ga (matalauci) mai rõƙo da wanda aka hana wa rõƙo."
    },
    {
      "ayah": 20,
      "arabic": "وَفِى ٱلْأَرْضِ ءَايَـٰتٌ لِّلْمُوقِنِينَ",
      "english": "And on the earth are signs for the certain [in faith]",
      "hausa": "Kuma a cikin ƙasã akwai ãyõyi ga mãsu yaƙĩni."
    },
    {
      "ayah": 21,
      "arabic": "وَفِىٓ أَنفُسِكُمْ ۚ أَفَلَا تُبْصِرُونَ",
      "english": "And in yourselves. Then will you not see?",
      "hausa": "Kuma a cikin rãyukanku (akwai ãyõyi). To, bã zã ku dũbã ba?"
    },
    {
      "ayah": 22,
      "arabic": "وَفِى ٱلسَّمَآءِ رِزْقُكُمْ وَمَا تُوعَدُونَ",
      "english": "And in the heaven is your provision and whatever you are promised.",
      "hausa": "Kuma a cikin sama arzikinku (yake fitõwa) da abin da ake yi muku alkawari."
    },
    {
      "ayah": 23,
      "arabic": "فَوَرَبِّ ٱلسَّمَآءِ وَٱلْأَرْضِ إِنَّهُۥ لَحَقٌّ مِّثْلَ مَآ أَنَّكُمْ تَنطِقُونَ",
      "english": "Then by the Lord of the heaven and earth, indeed, it is truth - just as [sure as] it is that you are speaking.",
      "hausa": "To, kuma Ina rantsuwa da Ubangijin sama da ƙasã, lalle shĩ (abin da ake yi muku alkawari), haƙĩƙa gaskiya ne, kamar abin da kuka zamo kunã karantãwa na magana,"
    },
    {
      "ayah": 24,
      "arabic": "هَلْ أَتَىٰكَ حَدِيثُ ضَيْفِ إِبْرَٰهِيمَ ٱلْمُكْرَمِينَ",
      "english": "Has there reached you the story of the honored guests of Abraham? -",
      "hausa": "Shin, lãbãrin Bãƙin Ibrãhĩm, waɗanda aka girmama, ya zo maka?"
    },
    {
      "ayah": 25,
      "arabic": "إِذْ دَخَلُوا۟ عَلَيْهِ فَقَالُوا۟ سَلَـٰمًا ۖ قَالَ سَلَـٰمٌ قَوْمٌ مُّنكَرُونَ",
      "english": "When they entered upon him and said, \"[We greet you with] peace.\" He answered, \"[And upon you] peace, [you are] a people unknown.",
      "hausa": "A lõkacin da suka shiga gare shi, sai suka yi sallama; ya ce \"Aminci ya tabbata a gare ku, mutãne bãƙi!\""
    },
    {
      "ayah": 26,
      "arabic": "فَرَاغَ إِلَىٰٓ أَهْلِهِۦ فَجَآءَ بِعِجْلٍ سَمِينٍ",
      "english": "Then he went to his family and came with a fat [roasted] calf",
      "hausa": "Sai ya jũya zuwa ga iyãlinsa, sa'an nan ya zo da maraƙi tutturna,"
    },
    {
      "ayah": 27,
      "arabic": "فَقَرَّبَهُۥٓ إِلَيْهِمْ قَالَ أَلَا تَأْكُلُونَ",
      "english": "And placed it near them; he said, \"Will you not eat?\"",
      "hausa": "Sai ya kusantar da shi zuwa gare su, ya ce: \"Bã zã ku ci ba?\""
    },
    {
      "ayah": 28,
      "arabic": "فَأَوْجَسَ مِنْهُمْ خِيفَةً ۖ قَالُوا۟ لَا تَخَفْ ۖ وَبَشَّرُوهُ بِغُلَـٰمٍ عَلِيمٍ",
      "english": "And he felt from them apprehension. They said, \"Fear not,\" and gave him good tidings of a learned boy.",
      "hausa": "Sai ya ji tsõro daga gare su. Suka ce: \"Kada kaji tsõro.\" Kuma suka yi masa bushãra da (haihuwar) wani yaro mai ilmi."
    },
    {
      "ayah": 29,
      "arabic": "فَأَقْبَلَتِ ٱمْرَأَتُهُۥ فِى صَرَّةٍ فَصَكَّتْ وَجْهَهَا وَقَالَتْ عَجُوزٌ عَقِيمٌ",
      "english": "And his wife approached with a cry [of alarm] and struck her face and said, \"[I am] a barren old woman!\"",
      "hausa": "Sai matarsa ta fuskanta cikin ƙyallõwa, har ta mari fuskarta kuma ta ce: \"Tsõhuwa bakarãriya (zã ta haihu)!\""
    },
    {
      "ayah": 30,
      "arabic": "قَالُوا۟ كَذَٰلِكِ قَالَ رَبُّكِ ۖ إِنَّهُۥ هُوَ ٱلْحَكِيمُ ٱلْعَلِيمُ",
      "english": "They said, \"Thus has said your Lord; indeed, He is the Wise, the Knowing.\"",
      "hausa": "Suka ce: \"Kamar haka Ubangijinki Ya faɗa. Lalle Shĩ, Shĩ ne Mai hikima, Mai ilmi.\""
    },
    {
      "ayah": 31,
      "arabic": "قَالَ فَمَا خَطْبُكُمْ أَيُّهَا ٱلْمُرْسَلُونَ",
      "english": "[Abraham] said, \"Then what is your business [here], O messengers?\"",
      "hausa": "(Ibrãĩm) ya ce: \"To mẽne ne babban al'almarinku, yã kũ Manzanni!\""
    },
    {
      "ayah": 32,
      "arabic": "قَالُوٓا۟ إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمٍ مُّجْرِمِينَ",
      "english": "They said, \"Indeed, we have been sent to a people of criminals",
      "hausa": "Suka ce: \"Lalle mũ, an aike mu zuwa ga waɗansu mutãne, mãsu laifi."
    },
    {
      "ayah": 33,
      "arabic": "لِنُرْسِلَ عَلَيْهِمْ حِجَارَةً مِّن طِينٍ",
      "english": "To send down upon them stones of clay,",
      "hausa": "\"Dõmin mu saka musu waɗansu duwãtsu na wani yumɓu (bom)."
    },
    {
      "ayah": 34,
      "arabic": "مُّسَوَّمَةً عِندَ رَبِّكَ لِلْمُسْرِفِينَ",
      "english": "Marked in the presence of your Lord for the transgressors.\"",
      "hausa": "\"Waɗanda aka yi wa alãma daga wajen Ubangijinka, dõmin mãsu ɓarna.\""
    },
    {
      "ayah": 35,
      "arabic": "فَأَخْرَجْنَا مَن كَانَ فِيهَا مِنَ ٱلْمُؤْمِنِينَ",
      "english": "So We brought out whoever was in the cities of the believers.",
      "hausa": "Sa'an, nan Muka fitar da wanda ya kasance a cikinta daga mũminai."
    },
    {
      "ayah": 36,
      "arabic": "فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٍ مِّنَ ٱلْمُسْلِمِينَ",
      "english": "And We found not within them other than a [single] house of Muslims.",
      "hausa": "Sai dai ba mu sãmu ba, a cikinta, fãce gida guda na Musulmi."
    },
    {
      "ayah": 37,
      "arabic": "وَتَرَكْنَا فِيهَآ ءَايَةً لِّلَّذِينَ يَخَافُونَ ٱلْعَذَابَ ٱلْأَلِيمَ",
      "english": "And We left therein a sign for those who fear the painful punishment.",
      "hausa": "Kuma Muka bar wata ãyã, a cikinta, ga waɗanda ke jin tsõron azãba, mai raɗaɗi."
    },
    {
      "ayah": 38,
      "arabic": "وَفِى مُوسَىٰٓ إِذْ أَرْسَلْنَـٰهُ إِلَىٰ فِرْعَوْنَ بِسُلْطَـٰنٍ مُّبِينٍ",
      "english": "And in Moses [was a sign], when We sent him to Pharaoh with clear authority.",
      "hausa": "Kuma ga Mũsã, a lõkacin da Muka aiko shi zuwa ga Fir'auna da wani dalĩli bayyananne."
    },
    {
      "ayah": 39,
      "arabic": "فَتَوَلَّىٰ بِرُكْنِهِۦ وَقَالَ سَـٰحِرٌ أَوْ مَجْنُونٌ",
      "english": "But he turned away with his supporters and said,\" A magician or a madman.\"",
      "hausa": "Sai ya jũya bãya tãre da ƙarfinsa, kuma ya ce: \"Mai sihiri ne kõ kuwa mahaukaci!\""
    },
    {
      "ayah": 40,
      "arabic": "فَأَخَذْنَـٰهُ وَجُنُودَهُۥ فَنَبَذْنَـٰهُمْ فِى ٱلْيَمِّ وَهُوَ مُلِيمٌ",
      "english": "So We took him and his soldiers and cast them into the sea, and he was blameworthy.",
      "hausa": "Sabõda haka, Muka kama shi tãre da rundunarsa, sa'an nan Muka jẽfa su a cikin tẽku, alhãli kuwa yanã wanda ake zargi."
    },
    {
      "ayah": 41,
      "arabic": "وَفِى عَادٍ إِذْ أَرْسَلْنَا عَلَيْهِمُ ٱلرِّيحَ ٱلْعَقِيمَ",
      "english": "And in 'Aad [was a sign], when We sent against them the barren wind.",
      "hausa": "Kuma ga Ãdãwa, a lõkacin da Muka aika iska ƙẽƙasasshiya a kansu."
    },
    {
      "ayah": 42,
      "arabic": "مَا تَذَرُ مِن شَىْءٍ أَتَتْ عَلَيْهِ إِلَّا جَعَلَتْهُ كَٱلرَّمِيمِ",
      "english": "It left nothing of what it came upon but that it made it like disintegrated ruins.",
      "hausa": "Bã ta barin kõme da ta jẽ a kansa, fãce ta mayar da shi kamar rududdugaggun ƙasũsuwa."
    },
    {
      "ayah": 43,
      "arabic": "وَفِى ثَمُودَ إِذْ قِيلَ لَهُمْ تَمَتَّعُوا۟ حَتَّىٰ حِينٍ",
      "english": "And in Thamud, when it was said to them, \"Enjoy yourselves for a time.\"",
      "hausa": "Kuma ga Samũdãwa, a lõkacin da aka ce musu: \"Ku ji ɗan dãɗi har wani ɗan lõkaci,\""
    },
    {
      "ayah": 44,
      "arabic": "فَعَتَوْا۟ عَنْ أَمْرِ رَبِّهِمْ فَأَخَذَتْهُمُ ٱلصَّـٰعِقَةُ وَهُمْ يَنظُرُونَ",
      "english": "But they were insolent toward the command of their Lord, so the thunderbolt seized them while they were looking on.",
      "hausa": "Sai suka yi girman kai ga umurnin Ubangijinsu, sabõda haka tsãwa ta kãma su, alhãli kuwa sunã kallo."
    },
    {
      "ayah": 45,
      "arabic": "فَمَا ٱسْتَطَـٰعُوا۟ مِن قِيَامٍ وَمَا كَانُوا۟ مُنتَصِرِينَ",
      "english": "And they were unable to arise, nor could they defend themselves.",
      "hausa": "Ba su kõ sãmu dãmar tsayãwa ba, kuma ba su kasance mãsu nẽman ãgaji ba."
    },
    {
      "ayah": 46,
      "arabic": "وَقَوْمَ نُوحٍ مِّن قَبْلُ ۖ إِنَّهُمْ كَانُوا۟ قَوْمًا فَـٰسِقِينَ",
      "english": "And [We destroyed] the people of Noah before; indeed, they were a people defiantly disobedient.",
      "hausa": "Da mutãnen Nũhu a gabãnin haka, lalle sun kasance waɗansu irin mutãne ne fãsiƙai."
    },
    {
      "ayah": 47,
      "arabic": "وَٱلسَّمَآءَ بَنَيْنَـٰهَا بِأَيْي۟دٍ وَإِنَّا لَمُوسِعُونَ",
      "english": "And the heaven We constructed with strength, and indeed, We are [its] expander.",
      "hausa": "Kuma sama, mun gina ta da wani irin ƙarfi, alhãli kuwa lalle Mũ ne Mãsu yalwatãwa."
    },
    {
      "ayah": 48,
      "arabic": "وَٱلْأَرْضَ فَرَشْنَـٰهَا فَنِعْمَ ٱلْمَـٰهِدُونَ",
      "english": "And the earth We have spread out, and excellent is the preparer.",
      "hausa": "Kuma ƙasã Mun shimfiɗa ta, To, madalla da mãsu shimfiɗãwa, Mũ,"
    },
    {
      "ayah": 49,
      "arabic": "وَمِن كُلِّ شَىْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُونَ",
      "english": "And of all things We created two mates; perhaps you will remember.",
      "hausa": "Kuma daga kõme Mun halitta nau'i biyu, watakila zã ku yi tunãni."
    },
    {
      "ayah": 50,
      "arabic": "فَفِرُّوٓا۟ إِلَى ٱللَّهِ ۖ إِنِّى لَكُم مِّنْهُ نَذِيرٌ مُّبِينٌ",
      "english": "So flee to Allah. Indeed, I am to you from Him a clear warner.",
      "hausa": "Sabõda haka ku gudu zuwa ga Allah, lalle nĩ mai gargaɗi kawai ne a gare ku, mai bayyanannen gargaɗi."
    },
    {
      "ayah": 51,
      "arabic": "وَلَا تَجْعَلُوا۟ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ ۖ إِنِّى لَكُم مِّنْهُ نَذِيرٌ مُّبِينٌ",
      "english": "And do not make [as equal] with Allah another deity. Indeed, I am to you from Him a clear warner.",
      "hausa": "Kuma kada ku sanya, tãre da Allah wani abin bautãwa na dabam, lalle nĩ, mai gargaɗi kawai ne a gare ku, mai bayyanannen gargaɗi."
    },
    {
      "ayah": 52,
      "arabic": "كَذَٰلِكَ مَآ أَتَى ٱلَّذِينَ مِن قَبْلِهِم مِّن رَّسُولٍ إِلَّا قَالُوا۟ سَاحِرٌ أَوْ مَجْنُونٌ",
      "english": "Similarly, there came not to those before them any messenger except that they said, \"A magician or a madman.\"",
      "hausa": "Kamar haka dai wani Manzo bai jẽ wa waɗanda ke gabãninsu ba fãce sun ce: \"Mai sihiri ne kõ mahaukaci.\""
    },
    {
      "ayah": 53,
      "arabic": "أَتَوَاصَوْا۟ بِهِۦ ۚ بَلْ هُمْ قَوْمٌ طَاغُونَ",
      "english": "Did they suggest it to them? Rather, they [themselves] are a transgressing people.",
      "hausa": "shin, sunã yi wa jũna wasiyya da shi ne? Ã'a, sũ dai mutãne ne mãsu girman kai."
    },
    {
      "ayah": 54,
      "arabic": "فَتَوَلَّ عَنْهُمْ فَمَآ أَنتَ بِمَلُومٍ",
      "english": "So leave them, [O Muhammad], for you are not to be blamed.",
      "hausa": "Sai ka jũya daga barinsu, kuma kai ba abin zargi ba ne."
    },
    {
      "ayah": 55,
      "arabic": "وَذَكِّرْ فَإِنَّ ٱلذِّكْرَىٰ تَنفَعُ ٱلْمُؤْمِنِينَ",
      "english": "And remind, for indeed, the reminder benefits the believers.",
      "hausa": "Kuma ka tunãtar, dõmin tunãtarwa tanã amfãnin mũminai."
    },
    {
      "ayah": 56,
      "arabic": "وَمَا خَلَقْتُ ٱلْجِنَّ وَٱلْإِنسَ إِلَّا لِيَعْبُدُونِ",
      "english": "And I did not create the jinn and mankind except to worship Me.",
      "hausa": "Kuma Ban halitta aljannu da mutãne ba sai dõmin su bauta Mini."
    },
    {
      "ayah": 57,
      "arabic": "مَآ أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَآ أُرِيدُ أَن يُطْعِمُونِ",
      "english": "I do not want from them any provision, nor do I want them to feed Me.",
      "hausa": "Bã Ni nufln (sãmun) wani arziki daga gare su, Bã Ni nufin su (yi Mini hidimar) ciyar da Ni."
    },
    {
      "ayah": 58,
      "arabic": "إِنَّ ٱللَّهَ هُوَ ٱلرَّزَّاقُ ذُو ٱلْقُوَّةِ ٱلْمَتِينُ",
      "english": "Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength.",
      "hausa": "Lalle Allah, Shĩ ne Mai azurtãwa, Mai ĩkon yi, Mai cikakken ƙarfi."
    },
    {
      "ayah": 59,
      "arabic": "فَإِنَّ لِلَّذِينَ ظَلَمُوا۟ ذَنُوبًا مِّثْلَ ذَنُوبِ أَصْحَـٰبِهِمْ فَلَا يَسْتَعْجِلُونِ",
      "english": "And indeed, for those who have wronged is a portion [of punishment] like the portion of their predecessors, so let them not impatiently urge Me.",
      "hausa": "To, lalle waɗanda suka yi zãlunci sunã da masaki (na ɗĩban zunubi) kamar masakin abõkansu, sabõda haka kada su yi Mini gaggãwa."
    },
    {
      "ayah": 60,
      "arabic": "فَوَيْلٌ لِّلَّذِينَ كَفَرُوا۟ مِن يَوْمِهِمُ ٱلَّذِى يُوعَدُونَ",
      "english": "And woe to those who have disbelieved from their Day which they are promised.",
      "hausa": "Sabõda haka, bone ya tabbata ga waɗanda suka kãfirta, daga rãnar su wadda aka yi musu alkawari."
    }
  ]
}