{
  "surah": 38,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "صٓ ۚ وَٱلْقُرْءَانِ ذِى ٱلذِّكْرِ",
      "english": "Sad. By the Qur'an containing reminder...",
      "hausa": "Ṣ̃, Inã rantsuwa da Al-ƙur'ãni mai hukunce-hukunce."
    },
    {
      "ayah": 2,
      "arabic": "بَلِ ٱلَّذِينَ كَفَرُوا۟ فِى عِزَّةٍ وَشِقَاقٍ",
      "english": "But those who disbelieve are in pride and dissension.",
      "hausa": "Ã'a, waɗanda suka kãfirta sunã cikin girman kai (ga rikon al'ãdunsu) da sãɓãni (tsakãnin jũnansu)."
    },
    {
      "ayah": 3,
      "arabic": "كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ فَنَادَوا۟ وَّلَاتَ حِينَ مَنَاصٍ",
      "english": "How many a generation have We destroyed before them, and they [then] called out; but it was not a time for escape.",
      "hausa": "Da yawa Muka halakar da wani ƙarni, a gabãninsu, suka yi kira (nẽman cẽto), bãbu lõkacin kuɓucewa."
    },
    {
      "ayah": 4,
      "arabic": "وَعَجِبُوٓا۟ أَن جَآءَهُم مُّنذِرٌ مِّنْهُمْ ۖ وَقَالَ ٱلْكَـٰفِرُونَ هَـٰذَا سَـٰحِرٌ كَذَّابٌ",
      "english": "And they wonder that there has come to them a warner from among themselves. And the disbelievers say, \"This is a magician and a liar.",
      "hausa": "Kuma suka yi mãmãki dõmin Mai gargaɗi, daga cikinsu, ya je musu. Kuma kãfirai sukace, \"Wannan mai sihiri ne, maƙaryaci.\""
    },
    {
      "ayah": 5,
      "arabic": "أَجَعَلَ ٱلْـَٔالِهَةَ إِلَـٰهًا وَٰحِدًا ۖ إِنَّ هَـٰذَا لَشَىْءٌ عُجَابٌ",
      "english": "Has he made the gods [only] one God? Indeed, this is a curious thing.\"",
      "hausa": "\"Shin, yã sanya gumãka duka su zama abin bautawa guda? Lalle wannan, haƙĩƙa, abu ne mai ban mãmaki!\""
    },
    {
      "ayah": 6,
      "arabic": "وَٱنطَلَقَ ٱلْمَلَأُ مِنْهُمْ أَنِ ٱمْشُوا۟ وَٱصْبِرُوا۟ عَلَىٰٓ ءَالِهَتِكُمْ ۖ إِنَّ هَـٰذَا لَشَىْءٌ يُرَادُ",
      "english": "And the eminent among them went forth, [saying], \"Continue, and be patient over [the defense of] your gods. Indeed, this is a thing intended.",
      "hausa": "Shũgabanni daga cikinsu, suka tafi (suka ce),\"Ku yi tafiyarku, ku yi haƙuri a kan abũbuwan bautawarku. Lalle wannan, haƙiƙa, wani abu ne ake nufi!\""
    },
    {
      "ayah": 7,
      "arabic": "مَا سَمِعْنَا بِهَـٰذَا فِى ٱلْمِلَّةِ ٱلْـَٔاخِرَةِ إِنْ هَـٰذَآ إِلَّا ٱخْتِلَـٰقٌ",
      "english": "We have not heard of this in the latest religion. This is not but a fabrication.",
      "hausa": "\"Ba mu taɓa ji ba, game da wannan a cikin addinin ƙarshe. Wannan bai zama ba fãce ƙiren ƙarya.\""
    },
    {
      "ayah": 8,
      "arabic": "أَءُنزِلَ عَلَيْهِ ٱلذِّكْرُ مِنۢ بَيْنِنَا ۚ بَلْ هُمْ فِى شَكٍّ مِّن ذِكْرِى ۖ بَل لَّمَّا يَذُوقُوا۟ عَذَابِ",
      "english": "Has the message been revealed to him out of [all of] us?\" Rather, they are in doubt about My message. Rather, they have not yet tasted My punishment.",
      "hausa": "\"Shin, an saukar da Alƙur'ãni ne a kansa, a tsakãninmu (mũ kuma ba mu gani ba)?\" Ã'a, su dai sunã cikin shakka daga hukunciNa Ã'a, ba su i da ɗanɗanar azãba ba."
    },
    {
      "ayah": 9,
      "arabic": "أَمْ عِندَهُمْ خَزَآئِنُ رَحْمَةِ رَبِّكَ ٱلْعَزِيزِ ٱلْوَهَّابِ",
      "english": "Or do they have the depositories of the mercy of your Lord, the Exalted in Might, the Bestower?",
      "hausa": "Ko kuma a wurinsu ne ake ajiye taskõkin rahamar Ubangijinka, Mabuwãyi, Mai yawan kyauta?"
    },
    {
      "ayah": 10,
      "arabic": "أَمْ لَهُم مُّلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا ۖ فَلْيَرْتَقُوا۟ فِى ٱلْأَسْبَـٰبِ",
      "english": "Or is theirs the dominion of the heavens and the earth and what is between them? Then let them ascend through [any] ways of access.",
      "hausa": "Kõ kuma sũ ne da mallakar sammai da ƙasã da abin da ke a tsakãninsu? To sai su hau a cikin sammai (dõmin, su hana saukar Alƙur'ãni ga Muhammadu)."
    },
    {
      "ayah": 11,
      "arabic": "جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّنَ ٱلْأَحْزَابِ",
      "english": "[They are but] soldiers [who will be] defeated there among the companies [of disbelievers].",
      "hausa": "Rundunõni ne abin da ke can, rusassu, na ƙungiyõyinsu."
    },
    {
      "ayah": 12,
      "arabic": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو ٱلْأَوْتَادِ",
      "english": "The people of Noah denied before them, and [the tribe of] 'Aad and Pharaoh, the owner of stakes,",
      "hausa": "Mutãnen Nũhu sun ƙaryata, a gabãninsu, da Ãdãwa da Fir'auna mai turãkun (da suka kafe mulkinsa)."
    },
    {
      "ayah": 13,
      "arabic": "وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَـٰبُ لْـَٔيْكَةِ ۚ أُو۟لَـٰٓئِكَ ٱلْأَحْزَابُ",
      "english": "And [the tribe of] Thamud and the people of Lot and the companions of the thicket. Those are the companies.",
      "hausa": "Da Samũdãwa da mutãnen Luɗu da ma'abũta ƙunci, waɗancan ne ƙungiyõyin."
    },
    {
      "ayah": 14,
      "arabic": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ",
      "english": "Each of them denied the messengers, so My penalty was justified.",
      "hausa": "Bãbu kõwa a cikinsu fãce ya ƙaryata Manzanni, sabõda haka azãbãTa ta wajaba."
    },
    {
      "ayah": 15,
      "arabic": "وَمَا يَنظُرُ هَـٰٓؤُلَآءِ إِلَّا صَيْحَةً وَٰحِدَةً مَّا لَهَا مِن فَوَاقٍ",
      "english": "And these [disbelievers] await not but one blast [of the Horn]; for it there will be no delay.",
      "hausa": "Kuma waɗannan bã su jiran kõme fãce tsãwã guda, wadda bã ta da hani."
    },
    {
      "ayah": 16,
      "arabic": "وَقَالُوا۟ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبْلَ يَوْمِ ٱلْحِسَابِ",
      "english": "And they say, \"Our Lord, hasten for us our share [of the punishment] before the Day of Account\"",
      "hausa": "Kuma suka ce: \"Ya Ubangijinmu! Ka gaggauta mana da rabonmu, a gabãnin rãnar bincike.\""
    },
    {
      "ayah": 17,
      "arabic": "ٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَٱذْكُرْ عَبْدَنَا دَاوُۥدَ ذَا ٱلْأَيْدِ ۖ إِنَّهُۥٓ أَوَّابٌ",
      "english": "Be patient over what they say and remember Our servant, David, the possessor of strength; indeed, he was one who repeatedly turned back [to Allah].",
      "hausa": "Ka yi haƙuri bisa ga abin da suke faɗa (na izgili), kuma ka ambaci bãwanMu Dãwũda ma'abũcin ƙarfin ibãda. Lalle, shi, mai mayar da al'amari ga Allah ne."
    },
    {
      "ayah": 18,
      "arabic": "إِنَّا سَخَّرْنَا ٱلْجِبَالَ مَعَهُۥ يُسَبِّحْنَ بِٱلْعَشِىِّ وَٱلْإِشْرَاقِ",
      "english": "Indeed, We subjected the mountains [to praise] with him, exalting [Allah] in the [late] afternoon and [after] sunrise.",
      "hausa": "Lalle Mũ, Mun hõre duwãtsu tãre da shi, sunã yin tasbĩhi maraice da fitõwar rãnã."
    },
    {
      "ayah": 19,
      "arabic": "وَٱلطَّيْرَ مَحْشُورَةً ۖ كُلٌّ لَّهُۥٓ أَوَّابٌ",
      "english": "And the birds were assembled, all with him repeating [praises].",
      "hausa": "Da tsuntsãye waɗanda ake tattarawa, kõwannensu mai kõmãwa ne a gare shi."
    },
    {
      "ayah": 20,
      "arabic": "وَشَدَدْنَا مُلْكَهُۥ وَءَاتَيْنَـٰهُ ٱلْحِكْمَةَ وَفَصْلَ ٱلْخِطَابِ",
      "english": "And We strengthened his kingdom and gave him wisdom and discernment in speech.",
      "hausa": "Kuma Muka ƙarfafa mulkinsa, kuma Muka bã shi hikima da rarrabẽwar magana."
    },
    {
      "ayah": 21,
      "arabic": "وَهَلْ أَتَىٰكَ نَبَؤُا۟ ٱلْخَصْمِ إِذْ تَسَوَّرُوا۟ ٱلْمِحْرَابَ",
      "english": "And has there come to you the news of the adversaries, when they climbed over the wall of [his] prayer chamber -",
      "hausa": "Kuma shin, lãbãrin mãsu husũma ya zo maka, a lõkacin da suka haura gãrun masallaci?"
    },
    {
      "ayah": 22,
      "arabic": "إِذْ دَخَلُوا۟ عَلَىٰ دَاوُۥدَ فَفَزِعَ مِنْهُمْ ۖ قَالُوا۟ لَا تَخَفْ ۖ خَصْمَانِ بَغَىٰ بَعْضُنَا عَلَىٰ بَعْضٍ فَٱحْكُم بَيْنَنَا بِٱلْحَقِّ وَلَا تُشْطِطْ وَٱهْدِنَآ إِلَىٰ سَوَآءِ ٱلصِّرَٰطِ",
      "english": "When they entered upon David and he was alarmed by them? They said, \"Fear not. [We are] two adversaries, one of whom has wronged the other, so judge between us with truth and do not exceed [it] and guide us to the sound path.",
      "hausa": "A lõkacin da suka shiga ga Dãwũda, sai ya firgita daga gare su. Suka ce: \"Kada kaji tsõro, masu husuma biyu ne; sãshenmu ya zãlunci sãshe. Sabõda haka, ka yi hakunci a tsakãninmu da gaskiya. Kada ka ƙẽtare haddi kuma ka shiryar da mu zuwa, ga tsakar hanya.\""
    },
    {
      "ayah": 23,
      "arabic": "إِنَّ هَـٰذَآ أَخِى لَهُۥ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِىَ نَعْجَةٌ وَٰحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِى فِى ٱلْخِطَابِ",
      "english": "Indeed this, my brother, has ninety-nine ewes, and I have one ewe; so he said, 'Entrust her to me,' and he overpowered me in speech.\"",
      "hausa": "\"Lalle wannan dan'uwãna ne, yanã da tunkiya casa'in da tara, kuma inã da tunkiya guda, sai ya ce: 'Ka lãmunce mini ita. Kuma ya buwãye ni ga magana.\""
    },
    {
      "ayah": 24,
      "arabic": "قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَىٰ نِعَاجِهِۦ ۖ وَإِنَّ كَثِيرًا مِّنَ ٱلْخُلَطَآءِ لَيَبْغِى بَعْضُهُمْ عَلَىٰ بَعْضٍ إِلَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَقَلِيلٌ مَّا هُمْ ۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّـٰهُ فَٱسْتَغْفَرَ رَبَّهُۥ وَخَرَّ رَاكِعًا وَأَنَابَ ۩",
      "english": "[David] said, \"He has certainly wronged you in demanding your ewe [in addition] to his ewes. And indeed, many associates oppress one another, except for those who believe and do righteous deeds - and few are they.\" And David became certain that We had tried him, and he asked forgiveness of his Lord and fell down bowing [in prostration] and turned in repentance [to Allah].",
      "hausa": "(Dãwũda) ya ce: \"Lalle, haƙiƙa ya zãlunce ka game da tambayar tunkiyarka zuwa ga tumakinsa. Kuma lalle ne mãsu yawa daga abõkan tarayya, haƙiƙa, sãshensu na zambatar sãshe fãce waɗanda suka yi ĩmãni, kuma suka aikata ayyukan ƙwarai.\" Kuma Dãwũda ya tabbata cẽwa Mun fitine shi ne, sabõda haka, ya nẽmi Ubangijinsa gãfara, kuma ya fãɗi yanã mai sujada, kuma ya mayar da al'amari ga Allah."
    },
    {
      "ayah": 25,
      "arabic": "فَغَفَرْنَا لَهُۥ ذَٰلِكَ ۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَـَٔابٍ",
      "english": "So We forgave him that; and indeed, for him is nearness to Us and a good place of return.",
      "hausa": "Sabõda haka Muka gãfarta masa wancan, kuma lalle yanã da wata kusantar daraja a wurinMu, da kyaun makõma."
    },
    {
      "ayah": 26,
      "arabic": "يَـٰدَاوُۥدُ إِنَّا جَعَلْنَـٰكَ خَلِيفَةً فِى ٱلْأَرْضِ فَٱحْكُم بَيْنَ ٱلنَّاسِ بِٱلْحَقِّ وَلَا تَتَّبِعِ ٱلْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ ٱللَّهِ ۚ إِنَّ ٱلَّذِينَ يَضِلُّونَ عَن سَبِيلِ ٱللَّهِ لَهُمْ عَذَابٌ شَدِيدٌۢ بِمَا نَسُوا۟ يَوْمَ ٱلْحِسَابِ",
      "english": "[We said], \"O David, indeed We have made you a successor upon the earth, so judge between the people in truth and do not follow [your own] desire, as it will lead you astray from the way of Allah.\" Indeed, those who go astray from the way of Allah will have a severe punishment for having forgotten the Day of Account.",
      "hausa": "Yã Dãwũda! Lalle Mũ Mun sanya ka Halĩfa a cikin ƙasã. To, ka yi hukunci tsakãnin mutãne da gaskiya, kuma kada ka biye wa son zũciyar, har ya ɓatar dakai daga hanyar Allah. Lalle waɗanda ke ɓacẽwa daga hanyar Allah sunã da wata azãba mai tsanani dõmin abin da suka manta, a rãnar hisãbi"
    },
    {
      "ayah": 27,
      "arabic": "وَمَا خَلَقْنَا ٱلسَّمَآءَ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا بَـٰطِلًا ۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُوا۟ ۚ فَوَيْلٌ لِّلَّذِينَ كَفَرُوا۟ مِنَ ٱلنَّارِ",
      "english": "And We did not create the heaven and the earth and that between them aimlessly. That is the assumption of those who disbelieve, so woe to those who disbelieve from the Fire.",
      "hausa": "Kuma ba Mu halitta sama da ƙasã da abin da ke a tsakãninsu ba a kan ƙarya. Wannan shĩ ne zaton waɗanda suka kãfirta. To, bone ya tabbata ga waɗanda suka kãfirta daga wutã."
    },
    {
      "ayah": 28,
      "arabic": "أَمْ نَجْعَلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ كَٱلْمُفْسِدِينَ فِى ٱلْأَرْضِ أَمْ نَجْعَلُ ٱلْمُتَّقِينَ كَٱلْفُجَّارِ",
      "english": "Or should we treat those who believe and do righteous deeds like corrupters in the land? Or should We treat those who fear Allah like the wicked?",
      "hausa": "Kõ zã Mu sanya waɗanda suka yi ĩmãni, kuma suka aikata ayyukan ƙwarai kamar waɗanda suke mãsu barna ne a cikin ƙasa? Ko kuma za Mu sanya masu bin Allah da taƙawa kamar fãjirai makarkata?"
    },
    {
      "ayah": 29,
      "arabic": "كِتَـٰبٌ أَنزَلْنَـٰهُ إِلَيْكَ مُبَـٰرَكٌ لِّيَدَّبَّرُوٓا۟ ءَايَـٰتِهِۦ وَلِيَتَذَكَّرَ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ",
      "english": "[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded.",
      "hausa": "(Wannan) Littãfi ne, Mun saukar da shi zuwa gare ka, yanã, mai albarka, dõmin su lũra da ãyõyinsa, kuma don mãsu hankali su riƙa yin tunãni."
    },
    {
      "ayah": 30,
      "arabic": "وَوَهَبْنَا لِدَاوُۥدَ سُلَيْمَـٰنَ ۚ نِعْمَ ٱلْعَبْدُ ۖ إِنَّهُۥٓ أَوَّابٌ",
      "english": "And to David We gave Solomon. An excellent servant, indeed he was one repeatedly turning back [to Allah].",
      "hausa": "Kuma Muka bai wa Dãwũda Sulaimãn. Mãdalla da bãwanMu, shi. Lalle shi (Sulaimãn) mai mayar da al'amari ne ga Allah."
    },
    {
      "ayah": 31,
      "arabic": "إِذْ عُرِضَ عَلَيْهِ بِٱلْعَشِىِّ ٱلصَّـٰفِنَـٰتُ ٱلْجِيَادُ",
      "english": "[Mention] when there were exhibited before him in the afternoon the poised [standing] racehorses.",
      "hausa": "A lõkacin da aka gitta masa dawãki mãsu asali, a lõkacin maraice."
    },
    {
      "ayah": 32,
      "arabic": "فَقَالَ إِنِّىٓ أَحْبَبْتُ حُبَّ ٱلْخَيْرِ عَن ذِكْرِ رَبِّى حَتَّىٰ تَوَارَتْ بِٱلْحِجَابِ",
      "english": "And he said, \"Indeed, I gave preference to the love of good [things] over the remembrance of my Lord until the sun disappeared into the curtain [of darkness].\"",
      "hausa": "Sai ya ce: \"Lalle nĩ, na fĩfĩta son dũkiya daga tunãwar Ubangijina, har (rãnã) ta faku da shãmaki!\""
    },
    {
      "ayah": 33,
      "arabic": "رُدُّوهَا عَلَىَّ ۖ فَطَفِقَ مَسْحًۢا بِٱلسُّوقِ وَٱلْأَعْنَاقِ",
      "english": "[He said], \"Return them to me,\" and set about striking [their] legs and necks.",
      "hausa": "\"Ku mayar da su a gare ni.\" Sai ya shiga yankansu da takõbi ga ƙwabrukansu da wuyõyinsu."
    },
    {
      "ayah": 34,
      "arabic": "وَلَقَدْ فَتَنَّا سُلَيْمَـٰنَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِۦ جَسَدًا ثُمَّ أَنَابَ",
      "english": "And We certainly tried Solomon and placed on his throne a body; then he returned.",
      "hausa": "Kuma lalle haƙĩƙa, Mun fitini Sulaiman kuma Muka jẽfa wani jikin mutum a kan karagarsa. Sa'an nan ya mayar da al'amari zuwa gare Mu."
    },
    {
      "ayah": 35,
      "arabic": "قَالَ رَبِّ ٱغْفِرْ لِى وَهَبْ لِى مُلْكًا لَّا يَنۢبَغِى لِأَحَدٍ مِّنۢ بَعْدِىٓ ۖ إِنَّكَ أَنتَ ٱلْوَهَّابُ",
      "english": "He said, \"My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower.\"",
      "hausa": "Ya ce: \"Ya Ubangijĩna! Ka gãfarta mini, kuma Ka bã ni mulki wanda bã ya kamãta da kõwa daga bãyãna. Lalle Kai, Kai ne Mai yawan kyauta."
    },
    {
      "ayah": 36,
      "arabic": "فَسَخَّرْنَا لَهُ ٱلرِّيحَ تَجْرِى بِأَمْرِهِۦ رُخَآءً حَيْثُ أَصَابَ",
      "english": "So We subjected to him the wind blowing by his command, gently, wherever he directed,",
      "hausa": "Sabõda haka Muka hõre masa iska tanã gudu da umurninsa, tãna tãshi da sauƙi, inda ya nufa."
    },
    {
      "ayah": 37,
      "arabic": "وَٱلشَّيَـٰطِينَ كُلَّ بَنَّآءٍ وَغَوَّاصٍ",
      "english": "And [also] the devils [of jinn] - every builder and diver",
      "hausa": "Da shaiɗanu dukan mai gini, da mai nutsa (a cikin kõguna.)"
    },
    {
      "ayah": 38,
      "arabic": "وَءَاخَرِينَ مُقَرَّنِينَ فِى ٱلْأَصْفَادِ",
      "english": "And others bound together in shackles.",
      "hausa": "Waɗansu, ɗaɗɗaure a cikin marũruwa."
    },
    {
      "ayah": 39,
      "arabic": "هَـٰذَا عَطَآؤُنَا فَٱمْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ",
      "english": "[We said], \"This is Our gift, so grant or withhold without account.\"",
      "hausa": "Wannan kyautarMu ce. Sai ka yi kyauta ga wanda kake so, ko kuma ka riƙe, bãbu wani bincike."
    },
    {
      "ayah": 40,
      "arabic": "وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَـَٔابٍ",
      "english": "And indeed, for him is nearness to Us and a good place of return.",
      "hausa": "Kuma lalle, haƙĩƙa yanã da kusantar daraja a wurinMu da kyaun makõma."
    },
    {
      "ayah": 41,
      "arabic": "وَٱذْكُرْ عَبْدَنَآ أَيُّوبَ إِذْ نَادَىٰ رَبَّهُۥٓ أَنِّى مَسَّنِىَ ٱلشَّيْطَـٰنُ بِنُصْبٍ وَعَذَابٍ",
      "english": "And remember Our servant Job, when he called to his Lord, \"Indeed, Satan has touched me with hardship and torment.\"",
      "hausa": "Kuma ka ambaci bãwanMu Ayyũba a lõkacin da ya kirãyi Ubangijinsa, ya ce: \"Lalle nĩ, Shaiɗan yã shãfe ni da wahala da kuma wata azãba.\""
    },
    {
      "ayah": 42,
      "arabic": "ٱرْكُضْ بِرِجْلِكَ ۖ هَـٰذَا مُغْتَسَلٌۢ بَارِدٌ وَشَرَابٌ",
      "english": "[So he was told], \"Strike [the ground] with your foot; this is a [spring for] a cool bath and drink.\"",
      "hausa": "Ka shura da ƙafarka. Wannan abin wanka ne mai sanyi da abin shã."
    },
    {
      "ayah": 43,
      "arabic": "وَوَهَبْنَا لَهُۥٓ أَهْلَهُۥ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنَّا وَذِكْرَىٰ لِأُو۟لِى ٱلْأَلْبَـٰبِ",
      "english": "And We granted him his family and a like [number] with them as mercy from Us and a reminder for those of understanding.",
      "hausa": "Kuma Muka bã shi iyalansa da kwatankwacinsu tãre da su sabõda rahama daga gare Mu, da tunãtarwa ga mãsu hankali."
    },
    {
      "ayah": 44,
      "arabic": "وَخُذْ بِيَدِكَ ضِغْثًا فَٱضْرِب بِّهِۦ وَلَا تَحْنَثْ ۗ إِنَّا وَجَدْنَـٰهُ صَابِرًا ۚ نِّعْمَ ٱلْعَبْدُ ۖ إِنَّهُۥٓ أَوَّابٌ",
      "english": "[We said], \"And take in your hand a bunch [of grass] and strike with it and do not break your oath.\" Indeed, We found him patient, an excellent servant. Indeed, he was one repeatedly turning back [to Allah].",
      "hausa": "Kuma ka riƙi wata ƙulla da hannunka, ka yi dũka da ita kuma kada ka karya rantsuwarka. Lalle Mũ, Mun sãme shi mai haƙuri. Madalla da bãwa, shĩ Lalle shĩ mai mayar da al'amari ga Allah ne."
    },
    {
      "ayah": 45,
      "arabic": "وَٱذْكُرْ عِبَـٰدَنَآ إِبْرَٰهِيمَ وَإِسْحَـٰقَ وَيَعْقُوبَ أُو۟لِى ٱلْأَيْدِى وَٱلْأَبْصَـٰرِ",
      "english": "And remember Our servants, Abraham, Isaac and Jacob - those of strength and [religious] vision.",
      "hausa": "Kuma ka ambaci bãyinMu: Ibrahĩm da ls'hãƙa da Ya'aƙũba, ma'abũta ƙarfin (ɗaukar umurninMu) da basĩra."
    },
    {
      "ayah": 46,
      "arabic": "إِنَّآ أَخْلَصْنَـٰهُم بِخَالِصَةٍ ذِكْرَى ٱلدَّارِ",
      "english": "Indeed, We chose them for an exclusive quality: remembrance of the home [of the Hereafter].",
      "hausa": "Lalle Mũ, Mun keɓance su game da wata, tsattsarkar aba: Hukunce-hukuncen gidan dũniya (mai tunãtar da su Lãhira)."
    },
    {
      "ayah": 47,
      "arabic": "وَإِنَّهُمْ عِندَنَا لَمِنَ ٱلْمُصْطَفَيْنَ ٱلْأَخْيَارِ",
      "english": "And indeed they are, to Us, among the chosen and outstanding.",
      "hausa": "Kuma lalle sũ a wurinMu, tabbas, sunã daga zãɓaɓɓu, mafĩfĩta."
    },
    {
      "ayah": 48,
      "arabic": "وَٱذْكُرْ إِسْمَـٰعِيلَ وَٱلْيَسَعَ وَذَا ٱلْكِفْلِ ۖ وَكُلٌّ مِّنَ ٱلْأَخْيَارِ",
      "english": "And remember Ishmael, Elisha and Dhul-Kifl, and all are among the outstanding.",
      "hausa": "Kuma ka ambaci Isma'ĩla da llyãs da Zulkifli, kuma dukansu sunã daga zãɓaɓɓu."
    },
    {
      "ayah": 49,
      "arabic": "هَـٰذَا ذِكْرٌ ۚ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَـَٔابٍ",
      "english": "This is a reminder. And indeed, for the righteous is a good place of return",
      "hausa": "Wannan tunãtarwa ce, kuma lalle mãsu bin Allah da taƙawa, sunã da kyakkyawar makõma."
    },
    {
      "ayah": 50,
      "arabic": "جَنَّـٰتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ ٱلْأَبْوَٰبُ",
      "english": "Gardens of perpetual residence, whose doors will be opened to them.",
      "hausa": "Gidãjen Aljannar zama, alhãli kuwa tanã abar buɗe wa kõfõfi sabõda su."
    },
    {
      "ayah": 51,
      "arabic": "مُتَّكِـِٔينَ فِيهَا يَدْعُونَ فِيهَا بِفَـٰكِهَةٍ كَثِيرَةٍ وَشَرَابٍ",
      "english": "Reclining within them, they will call therein for abundant fruit and drink.",
      "hausa": "Sunã gingincire a cikinsu, sunã kira a cikinsu, ga 'ya'yan itãcen marmari mãsu yawa, da abin shã."
    },
    {
      "ayah": 52,
      "arabic": "وَعِندَهُمْ قَـٰصِرَٰتُ ٱلطَّرْفِ أَتْرَابٌ",
      "english": "And with them will be women limiting [their] glances and of equal age.",
      "hausa": "Kuma a wurinsu akwai mãtan aure mãsu gajarta ganinsu ga mazansu, tsãrar jũna."
    },
    {
      "ayah": 53,
      "arabic": "هَـٰذَا مَا تُوعَدُونَ لِيَوْمِ ٱلْحِسَابِ",
      "english": "This is what you, [the righteous], are promised for the Day of Account.",
      "hausa": "Wannan shĩ ne abin da ake yi muku wa'adi ga rãnar hisãbi."
    },
    {
      "ayah": 54,
      "arabic": "إِنَّ هَـٰذَا لَرِزْقُنَا مَا لَهُۥ مِن نَّفَادٍ",
      "english": "Indeed, this is Our provision; for it there is no depletion.",
      "hausa": "Lalle wannan, haƙĩƙa, azurtarwarMu ce, bã ta ƙãrẽwa."
    },
    {
      "ayah": 55,
      "arabic": "هَـٰذَا ۚ وَإِنَّ لِلطَّـٰغِينَ لَشَرَّ مَـَٔابٍ",
      "english": "This [is so]. But indeed, for the transgressors is an evil place of return -",
      "hausa": "Wannan shĩ ne kuma lalle makangara, haƙĩƙa, sunã da mafi sharrin makõma."
    },
    {
      "ayah": 56,
      "arabic": "جَهَنَّمَ يَصْلَوْنَهَا فَبِئْسَ ٱلْمِهَادُ",
      "english": "Hell, which they will [enter to] burn, and wretched is the resting place.",
      "hausa": "Jahannama, sunã shigarta. To, shimfiɗar tã mũnana, ita."
    },
    {
      "ayah": 57,
      "arabic": "هَـٰذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ",
      "english": "This - so let them taste it - is scalding water and [foul] purulence.",
      "hausa": "Wannan shĩ ne! To, su ɗanɗane shi: ruwan zãfi ne da ruɓaɓɓen jini."
    },
    {
      "ayah": 58,
      "arabic": "وَءَاخَرُ مِن شَكْلِهِۦٓ أَزْوَٰجٌ",
      "english": "And other [punishments] of its type [in various] kinds.",
      "hausa": "Da wani daga siffarsa nau'i-nau'i."
    },
    {
      "ayah": 59,
      "arabic": "هَـٰذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْ ۖ لَا مَرْحَبًۢا بِهِمْ ۚ إِنَّهُمْ صَالُوا۟ ٱلنَّارِ",
      "english": "[Its inhabitants will say], \"This is a company bursting in with you. No welcome for them. Indeed, they will burn in the Fire.\"",
      "hausa": "Wannan wani yanki ne mai kũtsawa tãre da ku, bãbu marãba a gare su, lalle sũ, mãsu shiga Wutã ne."
    },
    {
      "ayah": 60,
      "arabic": "قَالُوا۟ بَلْ أَنتُمْ لَا مَرْحَبًۢا بِكُمْ ۖ أَنتُمْ قَدَّمْتُمُوهُ لَنَا ۖ فَبِئْسَ ٱلْقَرَارُ",
      "english": "They will say, \"Nor you! No welcome for you. You, [our leaders], brought this upon us, and wretched is the settlement.\"",
      "hausa": "Suka ce: \"Ã'a, ku ne bãbu marãba a gare ku, kũ ne kuka gabãtar da shi a gare mu.\" To, matabbatar tã mũnana (ita wutar)."
    },
    {
      "ayah": 61,
      "arabic": "قَالُوا۟ رَبَّنَا مَن قَدَّمَ لَنَا هَـٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِى ٱلنَّارِ",
      "english": "They will say, \"Our Lord, whoever brought this upon us - increase for him double punishment in the Fire.\"",
      "hausa": "Suka ce: \"Ya Ubangijinmu! Wanda ya gabãtar da wannan a gare mu, to, Ka ƙãra masa azãba, ninki, a cikin wutã.\""
    },
    {
      "ayah": 62,
      "arabic": "وَقَالُوا۟ مَا لَنَا لَا نَرَىٰ رِجَالًا كُنَّا نَعُدُّهُم مِّنَ ٱلْأَشْرَارِ",
      "english": "And they will say, \"Why do we not see men whom we used to count among the worst?",
      "hausa": "Kuma suka ce: \"Mẽ ya sãme mu, bã mu ganin waɗansu mazãje, mun kasance munã ƙidãya su daga asharãrai?\""
    },
    {
      "ayah": 63,
      "arabic": "أَتَّخَذْنَـٰهُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ ٱلْأَبْصَـٰرُ",
      "english": "Is it [because] we took them in ridicule, or has [our] vision turned away from them?\"",
      "hausa": "\"Shin, mun riƙe su abin izgili ne kõ idãnunmu sun karkata daga gare su ne?\""
    },
    {
      "ayah": 64,
      "arabic": "إِنَّ ذَٰلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ ٱلنَّارِ",
      "english": "Indeed, that is truth - the quarreling of the people of the Fire.",
      "hausa": "Lalle wannan, haƙĩƙa, gaskiya ne, husũmar mutãnen wutã."
    },
    {
      "ayah": 65,
      "arabic": "قُلْ إِنَّمَآ أَنَا۠ مُنذِرٌ ۖ وَمَا مِنْ إِلَـٰهٍ إِلَّا ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ",
      "english": "Say, [O Muhammad], \"I am only a warner, and there is not any deity except Allah, the One, the Prevailing.",
      "hausa": "Ka ce: \"Nĩ mai gargaɗikawai ne, kuma babu wani abin bautawa sai Allah, Makaɗaici, Mai tilastawa.\""
    },
    {
      "ayah": 66,
      "arabic": "رَبُّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَمَا بَيْنَهُمَا ٱلْعَزِيزُ ٱلْغَفَّـٰرُ",
      "english": "Lord of the heavens and the earth and whatever is between them, the Exalted in Might, the Perpetual Forgiver.\"",
      "hausa": "\"Ubangijin sammai da ƙasã da abin da ke a tsakãninsu Mabuwãyi, Mai gãfara.\""
    },
    {
      "ayah": 67,
      "arabic": "قُلْ هُوَ نَبَؤٌا۟ عَظِيمٌ",
      "english": "Say, \"It is great news",
      "hausa": "Ka ce: \"Shĩ (Alkur'ãni) babban lãbãri ne mai girma\"."
    },
    {
      "ayah": 68,
      "arabic": "أَنتُمْ عَنْهُ مُعْرِضُونَ",
      "english": "From which you turn away.",
      "hausa": "\"Kũ, mãsu bijirẽwa ne daga gare shi!\""
    },
    {
      "ayah": 69,
      "arabic": "مَا كَانَ لِىَ مِنْ عِلْمٍۭ بِٱلْمَلَإِ ٱلْأَعْلَىٰٓ إِذْ يَخْتَصِمُونَ",
      "english": "I had no knowledge of the exalted assembly [of angels] when they were disputing [the creation of Adam].",
      "hausa": "\"Wani ilmi bai kasance a gare ni ba game da jama'a (malã'iku) mafi ɗaukaka a lõkacin da suke yin husũma.\""
    },
    {
      "ayah": 70,
      "arabic": "إِن يُوحَىٰٓ إِلَىَّ إِلَّآ أَنَّمَآ أَنَا۠ نَذِيرٌ مُّبِينٌ",
      "english": "It has not been revealed to me except that I am a clear warner.\"",
      "hausa": "\"Ba a yi mini wahayin kõme ba face cẽwa ni mai gargaɗi kawai ne, mai bayyanãwa.\""
    },
    {
      "ayah": 71,
      "arabic": "إِذْ قَالَ رَبُّكَ لِلْمَلَـٰٓئِكَةِ إِنِّى خَـٰلِقٌۢ بَشَرًا مِّن طِينٍ",
      "english": "[So mention] when your Lord said to the angels, \"Indeed, I am going to create a human being from clay.",
      "hausa": "A lõkacin da Ubangijinka Ya ce wa malã'iku, \"Lalle Nĩ Mai halitta mutum ne daga lãkã."
    },
    {
      "ayah": 72,
      "arabic": "فَإِذَا سَوَّيْتُهُۥ وَنَفَخْتُ فِيهِ مِن رُّوحِى فَقَعُوا۟ لَهُۥ سَـٰجِدِينَ",
      "english": "So when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.\"",
      "hausa": "\"Sa'an nan idan Nã daidaita shi, kuma Na hũra (wani abu) daga RuhĩNa a cikinsa to ku fãɗi kunã mãsu sujada a gare; shi.\""
    },
    {
      "ayah": 73,
      "arabic": "فَسَجَدَ ٱلْمَلَـٰٓئِكَةُ كُلُّهُمْ أَجْمَعُونَ",
      "english": "So the angels prostrated - all of them entirely.",
      "hausa": "Sai malã'ikun suka yi sujada dukansu, gabã ɗaya."
    },
    {
      "ayah": 74,
      "arabic": "إِلَّآ إِبْلِيسَ ٱسْتَكْبَرَ وَكَانَ مِنَ ٱلْكَـٰفِرِينَ",
      "english": "Except Iblees; he was arrogant and became among the disbelievers.",
      "hausa": "Fãce Iblis, ya yi girman kai, kuma ya kasance daga kãfirai."
    },
    {
      "ayah": 75,
      "arabic": "قَالَ يَـٰٓإِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَىَّ ۖ أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ ٱلْعَالِينَ",
      "english": "[Allah] said, \"O Iblees, what prevented you from prostrating to that which I created with My hands? Were you arrogant [then], or were you [already] among the haughty?\"",
      "hausa": "(Allah) Ya ce, \"Yã Ibilis! Mẽ ya hana ka, ka yi sujada ga abin da Nã halitta da HannayeNa biyu? Shin, kã yi girman kai ne, kõ kuwa kã kasance daga maɗaukaka ne?\""
    },
    {
      "ayah": 76,
      "arabic": "قَالَ أَنَا۠ خَيْرٌ مِّنْهُ ۖ خَلَقْتَنِى مِن نَّارٍ وَخَلَقْتَهُۥ مِن طِينٍ",
      "english": "He said, \"I am better than him. You created me from fire and created him from clay.\"",
      "hausa": "Ya ce, \"Nĩ, mafifici ne daga gare shi: Kã halitta ni daga wutã, kuma Kã halitta shi daga lãkã.\""
    },
    {
      "ayah": 77,
      "arabic": "قَالَ فَٱخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ",
      "english": "[Allah] said, \"Then get out of Paradise, for indeed, you are expelled.",
      "hausa": "Ya ce, \"To, ka fita daga gare ta, dõmin lalle kai la'ananne ne.\""
    },
    {
      "ayah": 78,
      "arabic": "وَإِنَّ عَلَيْكَ لَعْنَتِىٓ إِلَىٰ يَوْمِ ٱلدِّينِ",
      "english": "And indeed, upon you is My curse until the Day of Recompense.\"",
      "hausa": "\"Kuma lalle a kanka akwai la'anaTa har zuwa rãnar sakamako.\""
    },
    {
      "ayah": 79,
      "arabic": "قَالَ رَبِّ فَأَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ",
      "english": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\"",
      "hausa": "Ya ce, \"Ya Ubangijina! To, Ka yi mini jinkiri zuwa ga rãnar da ake tãyar da su.\""
    },
    {
      "ayah": 80,
      "arabic": "قَالَ فَإِنَّكَ مِنَ ٱلْمُنظَرِينَ",
      "english": "[Allah] said, \"So indeed, you are of those reprieved",
      "hausa": "Ya ce, \"To, lalle kanã daga waɗanda aka yi wa jinkiri,"
    },
    {
      "ayah": 81,
      "arabic": "إِلَىٰ يَوْمِ ٱلْوَقْتِ ٱلْمَعْلُومِ",
      "english": "Until the Day of the time well-known.\"",
      "hausa": "\"Zuwa ga yinin lõkaci sananne.\""
    },
    {
      "ayah": 82,
      "arabic": "قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ",
      "english": "[Iblees] said, \"By your might, I will surely mislead them all",
      "hausa": "Ya ce, \"To, inã rantsuwa da buwãyarKa, lalle, inã ɓatar da su gabã ɗaya."
    },
    {
      "ayah": 83,
      "arabic": "إِلَّا عِبَادَكَ مِنْهُمُ ٱلْمُخْلَصِينَ",
      "english": "Except, among them, Your chosen servants.\"",
      "hausa": "\"Fãce bãyinKa tsarkakakku daga gare su.\""
    },
    {
      "ayah": 84,
      "arabic": "قَالَ فَٱلْحَقُّ وَٱلْحَقَّ أَقُولُ",
      "english": "[Allah] said, \"The truth [is My oath], and the truth I say -",
      "hausa": "(Allah) Ya ce, \"To, (wannan magana ita ce) gaskiya. Kuma gaskiya Nake faɗa.\""
    },
    {
      "ayah": 85,
      "arabic": "لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ",
      "english": "[That] I will surely fill Hell with you and those of them that follow you all together.\"",
      "hausa": "\"Lalle zã Ni cika Jahannama daga gare ka, kuma daga wanda ya bĩ ka daga gare su, gabã ɗaya\""
    },
    {
      "ayah": 86,
      "arabic": "قُلْ مَآ أَسْـَٔلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَآ أَنَا۠ مِنَ ٱلْمُتَكَلِّفِينَ",
      "english": "Say, [O Muhammad], \"I do not ask you for the Qur'an any payment, and I am not of the pretentious",
      "hausa": "Ka ce: \"Bã ni tambayar ku wata ijãra, a kansa kuma bã ni daga mãsu ƙãƙalen faɗarsa.\""
    },
    {
      "ayah": 87,
      "arabic": "إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَـٰلَمِينَ",
      "english": "It is but a reminder to the worlds.",
      "hausa": "\"Shĩ (Alkur'ãn) bai zama ba fãce ambato ne ga dukan halitta.\""
    },
    {
      "ayah": 88,
      "arabic": "وَلَتَعْلَمُنَّ نَبَأَهُۥ بَعْدَ حِينٍۭ",
      "english": "And you will surely know [the truth of] its information after a time.\"",
      "hausa": "\"Kuma lalle zã ku san babban lãbãrinsa a bayan ɗan lõkaci.\""
    }
  ]
}