{
  "surah": 73,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "يَـٰٓأَيُّهَا ٱلْمُزَّمِّلُ",
      "english": "O you who wraps himself [in clothing],",
      "hausa": "Yã wanda ya lulluɓe!"
    },
    {
      "ayah": 2,
      "arabic": "قُمِ ٱلَّيْلَ إِلَّا قَلِيلًا",
      "english": "Arise [to pray] the night, except for a little -",
      "hausa": "Ka tsayu domin yin salla a cikin dare (duka) fãce kaɗan."
    },
    {
      "ayah": 3,
      "arabic": "نِّصْفَهُۥٓ أَوِ ٱنقُصْ مِنْهُ قَلِيلًا",
      "english": "Half of it - or subtract from it a little",
      "hausa": "Rabinsa, ko ka rage abu kaɗan daga gare shi."
    },
    {
      "ayah": 4,
      "arabic": "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ ٱلْقُرْءَانَ تَرْتِيلًا",
      "english": "Or add to it, and recite the Qur'an with measured recitation.",
      "hausa": "Ko ka ƙara kansa kuma ka kyautata karanta Alƙu'ãni, daki daki."
    },
    {
      "ayah": 5,
      "arabic": "إِنَّا سَنُلْقِى عَلَيْكَ قَوْلًا ثَقِيلًا",
      "english": "Indeed, We will cast upon you a heavy word.",
      "hausa": "Lalle ne, Mũ, zã Mu jẽfa maka magana mai nauyi."
    },
    {
      "ayah": 6,
      "arabic": "إِنَّ نَاشِئَةَ ٱلَّيْلِ هِىَ أَشَدُّ وَطْـًٔا وَأَقْوَمُ قِيلًا",
      "english": "Indeed, the hours of the night are more effective for concurrence [of heart and tongue] and more suitable for words.",
      "hausa": "Lalle ne, tashin dare shi ne mafi tsananin natsuwa, kuma mafi daidaituwa ga magana."
    },
    {
      "ayah": 7,
      "arabic": "إِنَّ لَكَ فِى ٱلنَّهَارِ سَبْحًا طَوِيلًا",
      "english": "Indeed, for you by day is prolonged occupation.",
      "hausa": "Lalle ne, kanã da, a cikin yini, wani tasĩhi mai tsawo."
    },
    {
      "ayah": 8,
      "arabic": "وَٱذْكُرِ ٱسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا",
      "english": "And remember the name of your Lord and devote yourself to Him with [complete] devotion.",
      "hausa": "Kuma ka ambaci sũnan Ubangijinka, kuma ka yanke (ƙauna daga kowa ka koma) zuwa gare Shi, yankewa."
    },
    {
      "ayah": 9,
      "arabic": "رَّبُّ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ لَآ إِلَـٰهَ إِلَّا هُوَ فَٱتَّخِذْهُ وَكِيلًا",
      "english": "[He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.",
      "hausa": "Shi ne Ubangijin mafitar rãnã da mafãɗarta, bãbu abin bautawa fãce Shi. Sabõda haka ka riƙe Shi wakili."
    },
    {
      "ayah": 10,
      "arabic": "وَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَٱهْجُرْهُمْ هَجْرًا جَمِيلًا",
      "english": "And be patient over what they say and avoid them with gracious avoidance.",
      "hausa": "Kuma ka yi haƙuri ga abin da suke faɗã, kuma ka ƙaurace musu, ƙauracẽwa mai kyãwo."
    },
    {
      "ayah": 11,
      "arabic": "وَذَرْنِى وَٱلْمُكَذِّبِينَ أُو۟لِى ٱلنَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا",
      "english": "And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.",
      "hausa": "Kuma ka bar Ni da mãsu ƙaryatãwa, mawadãta, kuma ka jinkirta musu kaɗan."
    },
    {
      "ayah": 12,
      "arabic": "إِنَّ لَدَيْنَآ أَنكَالًا وَجَحِيمًا",
      "english": "Indeed, with Us [for them] are shackles and burning fire",
      "hausa": "Lalle ne, a wurinMu, akwai wasu marũruwa mãsu nauyi da Jahĩm."
    },
    {
      "ayah": 13,
      "arabic": "وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا",
      "english": "And food that chokes and a painful punishment -",
      "hausa": "Da wani abinci mai mãƙara da azãba mai raɗaɗi."
    },
    {
      "ayah": 14,
      "arabic": "يَوْمَ تَرْجُفُ ٱلْأَرْضُ وَٱلْجِبَالُ وَكَانَتِ ٱلْجِبَالُ كَثِيبًا مَّهِيلًا",
      "english": "On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.",
      "hausa": "Rãnar da ƙasa ke raurawa, da duwãtsu kuma duwãtsu su kasance tudun rairayi mai malãlã."
    },
    {
      "ayah": 15,
      "arabic": "إِنَّآ أَرْسَلْنَآ إِلَيْكُمْ رَسُولًا شَـٰهِدًا عَلَيْكُمْ كَمَآ أَرْسَلْنَآ إِلَىٰ فِرْعَوْنَ رَسُولًا",
      "english": "Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.",
      "hausa": "Lalle ne, Mũ. Mun aika zuwa gare ku, wani Manzo mai shaida a kanku, kamar yadda Muka aika wani Manzo zuwaga Fir'auna,"
    },
    {
      "ayah": 16,
      "arabic": "فَعَصَىٰ فِرْعَوْنُ ٱلرَّسُولَ فَأَخَذْنَـٰهُ أَخْذًا وَبِيلًا",
      "english": "But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.",
      "hausa": "Sai Fir'auna ya saɓa wa Manzon, saboda haka Muka kãma shi kãmu mai tsanani."
    },
    {
      "ayah": 17,
      "arabic": "فَكَيْفَ تَتَّقُونَ إِن كَفَرْتُمْ يَوْمًا يَجْعَلُ ٱلْوِلْدَٰنَ شِيبًا",
      "english": "Then how can you fear, if you disbelieve, a Day that will make the children white- haired?",
      "hausa": "To, yãya, idan kun kãfirta, zã ku kãre (azabar) wani yini mai mayar da yãra (tsofaffi) mãsu hurhura."
    },
    {
      "ayah": 18,
      "arabic": "ٱلسَّمَآءُ مُنفَطِرٌۢ بِهِۦ ۚ كَانَ وَعْدُهُۥ مَفْعُولًا",
      "english": "The heaven will break apart therefrom; ever is His promise fulfilled.",
      "hausa": "Sama za ta tsãge a cikinsa, wa'adinsa yã kasance mai aukuwa."
    },
    {
      "ayah": 19,
      "arabic": "إِنَّ هَـٰذِهِۦ تَذْكِرَةٌ ۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
      "english": "Indeed, this is a reminder, so whoever wills may take to his Lord a way.",
      "hausa": "Lalle ne, wannan wata tunãtarwa ce, sai dai wanda ya so, ya kãma hanyar ƙwarai zuwa ga Ubangijinsa."
    },
    {
      "ayah": 20,
      "arabic": "إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِن ثُلُثَىِ ٱلَّيْلِ وَنِصْفَهُۥ وَثُلُثَهُۥ وَطَآئِفَةٌ مِّنَ ٱلَّذِينَ مَعَكَ ۚ وَٱللَّهُ يُقَدِّرُ ٱلَّيْلَ وَٱلنَّهَارَ ۚ عَلِمَ أَن لَّن تُحْصُوهُ فَتَابَ عَلَيْكُمْ ۖ فَٱقْرَءُوا۟ مَا تَيَسَّرَ مِنَ ٱلْقُرْءَانِ ۚ عَلِمَ أَن سَيَكُونُ مِنكُم مَّرْضَىٰ ۙ وَءَاخَرُونَ يَضْرِبُونَ فِى ٱلْأَرْضِ يَبْتَغُونَ مِن فَضْلِ ٱللَّهِ ۙ وَءَاخَرُونَ يُقَـٰتِلُونَ فِى سَبِيلِ ٱللَّهِ ۖ فَٱقْرَءُوا۟ مَا تَيَسَّرَ مِنْهُ ۚ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَأَقْرِضُوا۟ ٱللَّهَ قَرْضًا حَسَنًا ۚ وَمَا تُقَدِّمُوا۟ لِأَنفُسِكُم مِّنْ خَيْرٍ تَجِدُوهُ عِندَ ٱللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا ۚ وَٱسْتَغْفِرُوا۟ ٱللَّهَ ۖ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌۢ",
      "english": "Indeed, your Lord knows, [O Muhammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it and has turned to you in forgiveness, so recite what is easy [for you] of the Qur'an. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allah and others fighting for the cause of Allah. So recite what is easy from it and establish prayer and give zakah and loan Allah a goodly loan. And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward. And seek forgiveness of Allah. Indeed, Allah is Forgiving and Merciful.",
      "hausa": "Lalle ne, Ubangijinka Yã sani cẽwa, kai kana tsayuwa a kusan kashi biyu daga uku na dare, da rabinsa, da sulusinsa, tãre da wani ɓangare na waɗanda ke tãre da kai. Allah Yake iya ƙaddara dare da yini, Ya san bã zã ku iya lissafa shi ba, sabõda haka Ya karɓi tubarku sai, ku karanta abin da ya sauƙaƙa na Alƙur'ãni. Ya san wasu daga cikinku, zã su yi cĩwo, kuma wasu zã su yi tafiya cikin ƙasa suna nẽman falalar Allah da fatauci, kuma wasu zã su yi yãƙi a cikin banyar Allah. Sabõda haka ku karanta abin da ya sauƙaƙa daga gare shi, kuma ku tsai da salla kuma ku bãyar da zakka, kumaa ku bai wa Allah rance, rance mai kyãwo. Kuma abin da kuka gabatar dõmin kanku, na alhẽri, zã ku sãme shi a wurin Allah zai kasance mafifici (daga wanda kuka ajiye) kuma zai fi girma ga sakamako, kuma ku rõƙi Allah gãfara; lalle ne Allah Mai gãfara ne, Mai jin ƙai."
    }
  ]
}