{
  "surah": 53,
  "hasBasmallah": false,
  "basmallah": "",
  "verses": [
    {
      "ayah": 1,
      "arabic": "وَٱلنَّجْمِ إِذَا هَوَىٰ",
      "english": "By the star when it descends,",
      "hausa": "Inã rantsuwa da taurãron, a lõkacin da ya faku."
    },
    {
      "ayah": 2,
      "arabic": "مَا ضَلَّ صَاحِبُكُمْ وَمَا غَوَىٰ",
      "english": "Your companion [Muhammad] has not strayed, nor has he erred,",
      "hausa": "Ma'abũcinku bai ɓata ba, kuma bai ƙẽtare haddi ba."
    },
    {
      "ayah": 3,
      "arabic": "وَمَا يَنطِقُ عَنِ ٱلْهَوَىٰٓ",
      "english": "Nor does he speak from [his own] inclination.",
      "hausa": "Kuma bã ya yin magana daga son zuciyarsa."
    },
    {
      "ayah": 4,
      "arabic": "إِنْ هُوَ إِلَّا وَحْىٌ يُوحَىٰ",
      "english": "It is not but a revelation revealed,",
      "hausa": "(Maganarsa) ba ta zamo ba, fãce wahayi ne da ake aikõwa."
    },
    {
      "ayah": 5,
      "arabic": "عَلَّمَهُۥ شَدِيدُ ٱلْقُوَىٰ",
      "english": "Taught to him by one intense in strength -",
      "hausa": "(Malã'ika) mai tsananin ƙarfi ya sanar da shi."
    },
    {
      "ayah": 6,
      "arabic": "ذُو مِرَّةٍ فَٱسْتَوَىٰ",
      "english": "One of soundness. And he rose to [his] true form",
      "hausa": "Ma'abũcin ƙarfi da kwarjini, sa'an nan ya daidaita."
    },
    {
      "ayah": 7,
      "arabic": "وَهُوَ بِٱلْأُفُقِ ٱلْأَعْلَىٰ",
      "english": "While he was in the higher [part of the] horizon.",
      "hausa": "Alhãli kuwa yanã a sararin samã mafi aukaka."
    },
    {
      "ayah": 8,
      "arabic": "ثُمَّ دَنَا فَتَدَلَّىٰ",
      "english": "Then he approached and descended",
      "hausa": "Sa'an nan ya kusanta, kuma ya matsa zurõwa."
    },
    {
      "ayah": 9,
      "arabic": "فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَىٰ",
      "english": "And was at a distance of two bow lengths or nearer.",
      "hausa": "Har ya kasance gwargwadon zirã'i biyu, kõ kuma abin da ya fi kusa."
    },
    {
      "ayah": 10,
      "arabic": "فَأَوْحَىٰٓ إِلَىٰ عَبْدِهِۦ مَآ أَوْحَىٰ",
      "english": "And he revealed to His Servant what he revealed.",
      "hausa": "Sa'an nan ya yi wahayi zuwa ga bãwan Allah (Muhammadu) da abin da ya faɗa (masa)."
    },
    {
      "ayah": 11,
      "arabic": "مَا كَذَبَ ٱلْفُؤَادُ مَا رَأَىٰٓ",
      "english": "The heart did not lie [about] what it saw.",
      "hausa": "Zũciyar (Annabi) bata ƙaryata abin da ya gani ba."
    },
    {
      "ayah": 12,
      "arabic": "أَفَتُمَـٰرُونَهُۥ عَلَىٰ مَا يَرَىٰ",
      "english": "So will you dispute with him over what he saw?",
      "hausa": "Shin, zã ku yi masa musu a kan abin da yake gani?"
    },
    {
      "ayah": 13,
      "arabic": "وَلَقَدْ رَءَاهُ نَزْلَةً أُخْرَىٰ",
      "english": "And he certainly saw him in another descent",
      "hausa": "Kuma lalle ya gan shi, haƙĩƙatan, a wani lõkacin saukarsa."
    },
    {
      "ayah": 14,
      "arabic": "عِندَ سِدْرَةِ ٱلْمُنتَهَىٰ",
      "english": "At the Lote Tree of the Utmost Boundary -",
      "hausa": "A wurin da magaryar tuƙẽwa take."
    },
    {
      "ayah": 15,
      "arabic": "عِندَهَا جَنَّةُ ٱلْمَأْوَىٰٓ",
      "english": "Near it is the Garden of Refuge -",
      "hausa": "A inda taken, nan Aljannar makoma take."
    },
    {
      "ayah": 16,
      "arabic": "إِذْ يَغْشَى ٱلسِّدْرَةَ مَا يَغْشَىٰ",
      "english": "When there covered the Lote Tree that which covered [it].",
      "hausa": "Lõkacin da abin da yake rufe magaryar tuƙẽwa ya rufe ta."
    },
    {
      "ayah": 17,
      "arabic": "مَا زَاغَ ٱلْبَصَرُ وَمَا طَغَىٰ",
      "english": "The sight [of the Prophet] did not swerve, nor did it transgress [its limit].",
      "hausa": "Ganinsa bai karkata ba, kuma bai ƙetare haddi ba."
    },
    {
      "ayah": 18,
      "arabic": "لَقَدْ رَأَىٰ مِنْ ءَايَـٰتِ رَبِّهِ ٱلْكُبْرَىٰٓ",
      "english": "He certainly saw of the greatest signs of his Lord.",
      "hausa": "Lalle, tabbas, (Annabinku) ya ga waɗanda suka fi girma daga ãyõyin Ubangijinsa."
    },
    {
      "ayah": 19,
      "arabic": "أَفَرَءَيْتُمُ ٱللَّـٰتَ وَٱلْعُزَّىٰ",
      "english": "So have you considered al-Lat and al-'Uzza?",
      "hausa": "Shin, kun ga Lãta da uzza?"
    },
    {
      "ayah": 20,
      "arabic": "وَمَنَوٰةَ ٱلثَّالِثَةَ ٱلْأُخْرَىٰٓ",
      "english": "And Manat, the third - the other one?",
      "hausa": "Da (wani gunki wai shi) Manãta, na ukunsu?"
    },
    {
      "ayah": 21,
      "arabic": "أَلَكُمُ ٱلذَّكَرُ وَلَهُ ٱلْأُنثَىٰ",
      "english": "Is the male for you and for Him the female?",
      "hausa": "Ashe, kũ ne da ɗa namiji Shĩ (Allah) kuma da ɗiya mace?"
    },
    {
      "ayah": 22,
      "arabic": "تِلْكَ إِذًا قِسْمَةٌ ضِيزَىٰٓ",
      "english": "That, then, is an unjust division.",
      "hausa": "Wannan fa ya zama rabo naƙasasshe."
    },
    {
      "ayah": 23,
      "arabic": "إِنْ هِىَ إِلَّآ أَسْمَآءٌ سَمَّيْتُمُوهَآ أَنتُمْ وَءَابَآؤُكُم مَّآ أَنزَلَ ٱللَّهُ بِهَا مِن سُلْطَـٰنٍ ۚ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَمَا تَهْوَى ٱلْأَنفُسُ ۖ وَلَقَدْ جَآءَهُم مِّن رَّبِّهِمُ ٱلْهُدَىٰٓ",
      "english": "They are not but [mere] names you have named them - you and your forefathers - for which Allah has sent down no authority. They follow not except assumption and what [their] souls desire, and there has already come to them from their Lord guidance.",
      "hausa": "Waɗannan bã kõme ba ne fãce sũnãye, waɗanda kuka ambace su da su, kũ da uwãyenku. Allah bai saukar da wani dalĩli game da su ba. (Kãfirai) bã su biyar kõme fãce zato da abin da rãyukansu ke so, Alhãli kuwa shiriyar ta daga wajen Ubangijinsu, ta jẽ musu (sai suka bar ta suka kõma wa zaton)."
    },
    {
      "ayah": 24,
      "arabic": "أَمْ لِلْإِنسَـٰنِ مَا تَمَنَّىٰ",
      "english": "Or is there for man whatever he wishes?",
      "hausa": "Ko (an fai cẽwa) mutum zai sãmi abin da yake gũri?"
    },
    {
      "ayah": 25,
      "arabic": "فَلِلَّهِ ٱلْـَٔاخِرَةُ وَٱلْأُولَىٰ",
      "english": "Rather, to Allah belongs the Hereafter and the first [life].",
      "hausa": "To, Lãhira da dũniya na Allah kawai ne (wanda ya nẽme su daga wani, yã yi kuskure)."
    },
    {
      "ayah": 26,
      "arabic": "وَكَم مِّن مَّلَكٍ فِى ٱلسَّمَـٰوَٰتِ لَا تُغْنِى شَفَـٰعَتُهُمْ شَيْـًٔا إِلَّا مِنۢ بَعْدِ أَن يَأْذَنَ ٱللَّهُ لِمَن يَشَآءُ وَيَرْضَىٰٓ",
      "english": "And how many angels there are in the heavens whose intercession will not avail at all except [only] after Allah has permitted [it] to whom He wills and approves.",
      "hausa": "Akwai malã'iku da yawa a cikin sammai cẽtonsu bã ya wadãtar da kõme fãce bãyan Allah Yã yi izni (da shi) ga wanda Yake so, kuma Yake yarda."
    },
    {
      "ayah": 27,
      "arabic": "إِنَّ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْـَٔاخِرَةِ لَيُسَمُّونَ ٱلْمَلَـٰٓئِكَةَ تَسْمِيَةَ ٱلْأُنثَىٰ",
      "english": "Indeed, those who do not believe in the Hereafter name the angels female names,",
      "hausa": "Lalle waɗannan da bã su yin ĩmãni da Lãhira, haƙĩƙa sunã kiran malã'iku da sũnan mace."
    },
    {
      "ayah": 28,
      "arabic": "وَمَا لَهُم بِهِۦ مِنْ عِلْمٍ ۖ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ ۖ وَإِنَّ ٱلظَّنَّ لَا يُغْنِى مِنَ ٱلْحَقِّ شَيْـًٔا",
      "english": "And they have thereof no knowledge. They follow not except assumption, and indeed, assumption avails not against the truth at all.",
      "hausa": "Kuma bã su da wani ilmi game da shi, bã su bin kõme fãce zato alhãli kuwa lalle zato bã ya amfãnar da kõme daga gaskiya."
    },
    {
      "ayah": 29,
      "arabic": "فَأَعْرِضْ عَن مَّن تَوَلَّىٰ عَن ذِكْرِنَا وَلَمْ يُرِدْ إِلَّا ٱلْحَيَوٰةَ ٱلدُّنْيَا",
      "english": "So turn away from whoever turns his back on Our message and desires not except the worldly life.",
      "hausa": "Sabõda haka sai ka kau da kai daga wanda ya jũya bãya daga ambatonMu kuma bai yi nufin kõme ba fãce rãyuwar kusa (dũniya)."
    },
    {
      "ayah": 30,
      "arabic": "ذَٰلِكَ مَبْلَغُهُم مِّنَ ٱلْعِلْمِ ۚ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِۦ وَهُوَ أَعْلَمُ بِمَنِ ٱهْتَدَىٰ",
      "english": "That is their sum of knowledge. Indeed, your Lord is most knowing of who strays from His way, and He is most knowing of who is guided.",
      "hausa": "Wannan ita ce iyãkar abin da suke iya kai gare shi na ilmi. lalle Ubangijinka Shĩ ne Mafi sanin wanda ya ɓace daga hanyarSa, kuma Shi ne Mafi sani ga wanda ya nẽmi shiriya."
    },
    {
      "ayah": 31,
      "arabic": "وَلِلَّهِ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ لِيَجْزِىَ ٱلَّذِينَ أَسَـٰٓـُٔوا۟ بِمَا عَمِلُوا۟ وَيَجْزِىَ ٱلَّذِينَ أَحْسَنُوا۟ بِٱلْحُسْنَى",
      "english": "And to Allah belongs whatever is in the heavens and whatever is in the earth - that He may recompense those who do evil with [the penalty of] what they have done and recompense those who do good with the best [reward] -",
      "hausa": "Kuma abin da ke cikin sammai da abin da yake a cikin ƙasã na Allah kawai ne, dõmin Yã sãka wa waɗanda suka mũnana da abin da suka aikata, kuma Ya sãka wa waɗanda suki kyautata da sakamakon da ya fi kyau."
    },
    {
      "ayah": 32,
      "arabic": "ٱلَّذِينَ يَجْتَنِبُونَ كَبَـٰٓئِرَ ٱلْإِثْمِ وَٱلْفَوَٰحِشَ إِلَّا ٱللَّمَمَ ۚ إِنَّ رَبَّكَ وَٰسِعُ ٱلْمَغْفِرَةِ ۚ هُوَ أَعْلَمُ بِكُمْ إِذْ أَنشَأَكُم مِّنَ ٱلْأَرْضِ وَإِذْ أَنتُمْ أَجِنَّةٌ فِى بُطُونِ أُمَّهَـٰتِكُمْ ۖ فَلَا تُزَكُّوٓا۟ أَنفُسَكُمْ ۖ هُوَ أَعْلَمُ بِمَنِ ٱتَّقَىٰٓ",
      "english": "Those who avoid the major sins and immoralities, only [committing] slight ones. Indeed, your Lord is vast in forgiveness. He was most knowing of you when He produced you from the earth and when you were fetuses in the wombs of your mothers. So do not claim yourselves to be pure; He is most knowing of who fears Him.",
      "hausa": "Waɗanda ke nĩsantar manyan zunubai da abũbuwan alfãsha, fãce ƙanãnan laifuffuka, lalle Ubangijinka Mai yalwatattar gãfara ne, Shĩ ne Ya fi sani ga abinda ke gare ku a lõkacin da Ya ƙãga halittarku daga ƙasa, kuma a lõkacin da kuke tãyuna a cikin cikannan uwãyenku. Sabõda haka, kada ku tsarkake kanku, Shĩ ne Mafi sani ga wanda ya yi taƙawa."
    },
    {
      "ayah": 33,
      "arabic": "أَفَرَءَيْتَ ٱلَّذِى تَوَلَّىٰ",
      "english": "Have you seen the one who turned away",
      "hausa": "Shin, ka ga wannan da ya jũya baya?"
    },
    {
      "ayah": 34,
      "arabic": "وَأَعْطَىٰ قَلِيلًا وَأَكْدَىٰٓ",
      "english": "And gave a little and [then] refrained?",
      "hausa": "Ya yi kyauta kaɗan, kuma ya yi rowa?"
    },
    {
      "ayah": 35,
      "arabic": "أَعِندَهُۥ عِلْمُ ٱلْغَيْبِ فَهُوَ يَرَىٰٓ",
      "english": "Does he have knowledge of the unseen, so he sees?",
      "hausa": "Shin, akwai ilmin gaibi a wurinsa, Sabõda haka yanã ganin gaibin?"
    },
    {
      "ayah": 36,
      "arabic": "أَمْ لَمْ يُنَبَّأْ بِمَا فِى صُحُفِ مُوسَىٰ",
      "english": "Or has he not been informed of what was in the scriptures of Moses",
      "hausa": "Ko kuwa ba a ba shi lãbãri ba ga abin da yake a cikin Littafan Mũsã?"
    },
    {
      "ayah": 37,
      "arabic": "وَإِبْرَٰهِيمَ ٱلَّذِى وَفَّىٰٓ",
      "english": "And [of] Abraham, who fulfilled [his obligations] -",
      "hausa": "Da Ibrãhĩm wanda ya cika alkawari?"
    },
    {
      "ayah": 38,
      "arabic": "أَلَّا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ",
      "english": "That no bearer of burdens will bear the burden of another",
      "hausa": "Cẽwa wani rai mai kãyan laifi bã ya ɗaukar kãyan laifin wani."
    },
    {
      "ayah": 39,
      "arabic": "وَأَن لَّيْسَ لِلْإِنسَـٰنِ إِلَّا مَا سَعَىٰ",
      "english": "And that there is not for man except that [good] for which he strives",
      "hausa": "Kuma mutum bã shi da kõme fãce abin da ya aikata."
    },
    {
      "ayah": 40,
      "arabic": "وَأَنَّ سَعْيَهُۥ سَوْفَ يُرَىٰ",
      "english": "And that his effort is going to be seen -",
      "hausa": "Kuma lalle, aikinsa zã a gan shi."
    },
    {
      "ayah": 41,
      "arabic": "ثُمَّ يُجْزَىٰهُ ٱلْجَزَآءَ ٱلْأَوْفَىٰ",
      "english": "Then he will be recompensed for it with the fullest recompense",
      "hausa": "Sa'an nan a sãka masa da sakamako wanda yake mafi cikar ma'auni?"
    },
    {
      "ayah": 42,
      "arabic": "وَأَنَّ إِلَىٰ رَبِّكَ ٱلْمُنتَهَىٰ",
      "english": "And that to your Lord is the finality",
      "hausa": "Kuma lalle, makõmar zuwa Ubangijinka kawai take?"
    },
    {
      "ayah": 43,
      "arabic": "وَأَنَّهُۥ هُوَ أَضْحَكَ وَأَبْكَىٰ",
      "english": "And that it is He who makes [one] laugh and weep",
      "hausa": "Kuma lalle, Shĩ, Shĩ ne Ya sanya dariya, kuma Ya sanya kũka."
    },
    {
      "ayah": 44,
      "arabic": "وَأَنَّهُۥ هُوَ أَمَاتَ وَأَحْيَا",
      "english": "And that it is He who causes death and gives life",
      "hausa": "Kuma lalle, Shĩ, Shĩ ne Ya kashe, kuma Ya rãyar."
    },
    {
      "ayah": 45,
      "arabic": "وَأَنَّهُۥ خَلَقَ ٱلزَّوْجَيْنِ ٱلذَّكَرَ وَٱلْأُنثَىٰ",
      "english": "And that He creates the two mates - the male and female -",
      "hausa": "Kuma lalle Shĩ ne Ya yi halitta nau'i-nau'i, namiji da mace."
    },
    {
      "ayah": 46,
      "arabic": "مِن نُّطْفَةٍ إِذَا تُمْنَىٰ",
      "english": "From a sperm-drop when it is emitted",
      "hausa": "Daga wani ɗigon ruwa guda a lõkacin da ake jẽfa shi a cikin mahaifa."
    },
    {
      "ayah": 47,
      "arabic": "وَأَنَّ عَلَيْهِ ٱلنَّشْأَةَ ٱلْأُخْرَىٰ",
      "english": "And that [incumbent] upon Him is the next creation",
      "hausa": "Kuma a kansa ne ƙãga halitta ta biyu take."
    },
    {
      "ayah": 48,
      "arabic": "وَأَنَّهُۥ هُوَ أَغْنَىٰ وَأَقْنَىٰ",
      "english": "And that it is He who enriches and suffices",
      "hausa": "Kuma lalle, Shĩ, Shĩ ne Ya azurta, kuma Ya wadãtar."
    },
    {
      "ayah": 49,
      "arabic": "وَأَنَّهُۥ هُوَ رَبُّ ٱلشِّعْرَىٰ",
      "english": "And that it is He who is the Lord of Sirius",
      "hausa": "Kuma lalle, Shĩ, Shi ne Ubangijin Shi'ira."
    },
    {
      "ayah": 50,
      "arabic": "وَأَنَّهُۥٓ أَهْلَكَ عَادًا ٱلْأُولَىٰ",
      "english": "And that He destroyed the first [people of] 'Aad",
      "hausa": "Kuma lalle, Shĩ, Shĩ ne Ya halaka Ãdãwa na farko."
    },
    {
      "ayah": 51,
      "arabic": "وَثَمُودَا۟ فَمَآ أَبْقَىٰ",
      "english": "And Thamud - and He did not spare [them] -",
      "hausa": "Da Samũdãwa, sa'an nan bai rage su ba."
    },
    {
      "ayah": 52,
      "arabic": "وَقَوْمَ نُوحٍ مِّن قَبْلُ ۖ إِنَّهُمْ كَانُوا۟ هُمْ أَظْلَمَ وَأَطْغَىٰ",
      "english": "And the people of Noah before. Indeed, it was they who were [even] more unjust and oppressing.",
      "hausa": "Da mutãnen Nũhu a gabãnin haka, lalle sũ sun kasance mafi zãlunci kuma mafi girman kai."
    },
    {
      "ayah": 53,
      "arabic": "وَٱلْمُؤْتَفِكَةَ أَهْوَىٰ",
      "english": "And the overturned towns He hurled down",
      "hausa": "Da waɗanda aka birkice ƙasarsu, Ya kãyar da su."
    },
    {
      "ayah": 54,
      "arabic": "فَغَشَّىٰهَا مَا غَشَّىٰ",
      "english": "And covered them by that which He covered.",
      "hausa": "Sa'an nan abin da ya rufe su, ya rufe su."
    },
    {
      "ayah": 55,
      "arabic": "فَبِأَىِّ ءَالَآءِ رَبِّكَ تَتَمَارَىٰ",
      "english": "Then which of the favors of your Lord do you doubt?",
      "hausa": "To, da wace daga ni'imõmin Ubangijinka kake yin shakka?"
    },
    {
      "ayah": 56,
      "arabic": "هَـٰذَا نَذِيرٌ مِّنَ ٱلنُّذُرِ ٱلْأُولَىٰٓ",
      "english": "This [Prophet] is a warner like the former warners.",
      "hausa": "wannan (Muhammadu) mai gargaɗi ne kamar irin mãsu gargaɗi na farko."
    },
    {
      "ayah": 57,
      "arabic": "أَزِفَتِ ٱلْـَٔازِفَةُ",
      "english": "The Approaching Day has approached.",
      "hausa": "Makusanciya fa, tã yi kusa."
    },
    {
      "ayah": 58,
      "arabic": "لَيْسَ لَهَا مِن دُونِ ٱللَّهِ كَاشِفَةٌ",
      "english": "Of it, [from those] besides Allah, there is no remover.",
      "hausa": "Bãbu wani rai, banda Allah, mai iya bãyani gare ta."
    },
    {
      "ayah": 59,
      "arabic": "أَفَمِنْ هَـٰذَا ٱلْحَدِيثِ تَعْجَبُونَ",
      "english": "Then at this statement do you wonder?",
      "hausa": "Shin, kuma daga wannan lãbãri kuke mãmãki?"
    },
    {
      "ayah": 60,
      "arabic": "وَتَضْحَكُونَ وَلَا تَبْكُونَ",
      "english": "And you laugh and do not weep",
      "hausa": "Kuma kunã yin dãriya, kuma bã ku yin kũka?"
    },
    {
      "ayah": 61,
      "arabic": "وَأَنتُمْ سَـٰمِدُونَ",
      "english": "While you are proudly sporting?",
      "hausa": "Alhãli kunã mãsu wãsã?"
    },
    {
      "ayah": 62,
      "arabic": "فَٱسْجُدُوا۟ لِلَّهِ وَٱعْبُدُوا۟ ۩",
      "english": "So prostrate to Allah and worship [Him].",
      "hausa": "To, ku yi tawãli'u ga Allah, kuma ku bauta (masa)."
    }
  ]
}